{"id":1030,"date":"2022-06-16T06:55:53","date_gmt":"2022-06-16T06:55:53","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-servers-for-a-fee\/"},"modified":"2022-06-16T06:55:53","modified_gmt":"2022-06-16T06:55:53","slug":"minecraft-servers-for-a-fee","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-servers-for-a-fee\/","title":{"rendered":"Minecraft servers for a fee?"},"content":{"rendered":"<p>You already said that he bought Minecraft for €20.  This gives him full access to the game and all its features.  The company behind Minecraft called Mojang now calls this a premium account.  This means nothing more.<\/p>\n<p>In order to play with many other people, central servers are needed where many people play at once.  There are already many such servers and your son can join them without any problems.  However, the owner of the server can ask for donations.  However, such inquiries or offers should not be accepted, as they rarely provide real added value.  There are enough servers with nice people who greet every friendly face without asking for money.<\/p>\n<p>Running your own server can be done in two ways.  You can run it at home on your own computer.  However, many technical requirements have to be met and this also entails some security risks.  For this reason and because of the required know-how, it is not advisable. <\/p>\n<p>The other option is to rent a server.  Nitrado.net is usually a good place to go for this.  Although the price per player is quite high compared to other providers, the quality is appropriate and not as tightly cut as with cheap hosters.  For starters, these would also be an option, just to do the test.<\/p>\n<p>It would be important to ask your son what exactly he intends to do with the Serer.  If you want to play with your well-known flesh-and-blood friends, that can make perfect sense.  Four euros a month for four people is no problem.  If he makes it public for other people, he will have to pay more money (since more resources are needed for more people) and also he has some responsibility.  Most of the time, however, such small servers are only rarely visited and are swallowed up again after a short time. <\/p>\n<p>Without such a server (to answer one of your questions) it can play single player (meaning without friends) or with multiple players if they are in the same house\/wifi network as them.  This is also possible via the Internet, but again with more technology.<\/p>\n<p>My recommendation: If he wants the server for himself and his real friends, you can&#8217;t go wrong.  It practically only promotes joint play and communication.  If he wants to make the server public for everyone, then it is strongly discouraged, because of costs, technology, responsibility and all kinds of people who hang around in Minecraft, but not more than usual in life, so don&#8217;t worry 😉<\/p>\n<p>You should personally order, set up and configure the server, as it requires some understanding that you do not automatically expect from a 12-year-old.  There are many instructions for this, but not as small as you might wish (no offense meant, of course 🙂 )<\/p>\n<p>Should you subsequently need such instructions for a special provider, I advise you to ask the support of the same or a tech-savvy acquaintance. <\/p>\n<p>I hope I was able to add some clarity.  If you have any questions, please feel free to ask them.  I noticed the questions and should then be informed if more is written here. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>You already said that he bought Minecraft for €20. This gives him full access to the game and all its <\/p>\n","protected":false},"author":1,"featured_media":55,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1030"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1030"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1030\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/55"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1030"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1030"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1030"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}