{"id":1093,"date":"2022-06-16T17:53:40","date_gmt":"2022-06-16T17:53:40","guid":{"rendered":"https:\/\/minecraft101.site\/suddenly-paid-steam-rip-off-at-tiny-tina\/"},"modified":"2022-06-16T17:53:40","modified_gmt":"2022-06-16T17:53:40","slug":"suddenly-paid-steam-rip-off-at-tiny-tina","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/suddenly-paid-steam-rip-off-at-tiny-tina\/","title":{"rendered":"Suddenly paid: Steam rip-off at Tiny Tina"},"content":{"rendered":"<p>\n\t\t <\/p>\n<p class=\"ft_img_caption_style\">  Be careful when buying on Steam!  The Borderlands 2 DLC Tiny Tina standalone is also free!  Source: 2K \/ Gearbox <\/p>\n<p>Borderlands fans around the world are currently looking forward to the announced Tiny Tina&#8217;s Wonderlands, which should reach you in 2022.  But to bridge the time until you experience a medieval spin-off in typical Borderlands style, in which Tiny Tina causes even more unrest between magic, miracles and weapons, developer Gearbox Software and publisher 2K Games have thought of something.<\/p>\n<p>So there is currently probably the most popular and perhaps the best Borderlands 2 DLC Tiny Tina completely free – but not everywhere.  The content expansion for the legendary Borderlands 2, which introduces you to the fantastic character Tiny Tina, who will play an even more central role in Tiny Tina&#8217;s Storming of Dragon Fortress, is currently available as a standalone, completely free addition to your game library on the Epic Games Store.  Unlike on Steam.<\/p>\n<p>Because the Borderlands 2 Tiny Tina DLC has also been available on Steam as a standalone since November 9, 2021, but Valve estimates a proud 9.99 euros on its own platform for the chapter, which you could also play in 2013 in the Borderlands 2 expansion.  This is exactly the reason why numerous Steam reviews of the Tiny Tina Standalone have a mixed opinion and even expressly warn against buying it in the comments.<\/p>\n<h4>&#8220;Cash Grab&#8221; &#8211; NO purchase recommendation via Steam<\/h4>\n<p>The basic tenor can be summed up in the two clear and unmistakable words “cash grab”.  There&#8217;s no reason to go back to the $9.99 Steam version here.  Especially as long as Epic Games gives you the same content in the same format:<\/p>\n<blockquote class=\"wp-embedded-content\" data-secret=\"S9b2lueUHl\">\n<p>Epic Games is giving you Tiny Tina and content for Rogue Company for free<\/p>\n<\/blockquote>\n<p><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"„Epic Games schenkt euch Tiny Tina und Inhalte für Rogue Company“ — gaming-grounds.de\" src=\"https:\/\/www.gaming-grounds.de\/epic-games-schenkt-euch-tiny-tina-und-inhalte-fuer-rogue-company\/embed\/#?secret=S9b2lueUHl\" data-secret=\"S9b2lueUHl\" width=\"350\" height=\"200\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe><\/p>\n<p>If you really want to step back in time to the time when Tiny Tina appeared in the Borderlands universe and caused spectacle and chaos for the first time with her storming of the Dragonhold, you should fall back on the original Borderlands 2 with the corresponding DLC.  Even in 2021, this can still be enjoyed surprisingly well.<\/p>\n<h4>This is what awaits you in Tiny Tina&#8217;s Wonderlands<\/h4>\n<p>In the coming year, Tiny Tina will become a namesake for a Borderlands spin-off that many could never have imagined.  While the distinctive art style remains, you suddenly find yourself embarking on epic adventures wielding swords and spells and encountering quirky characters.<\/p>\n<p>Tiny Tina leads you in her wonderland through an entire medieval tabletop realm, which is enriched with plenty of fantasy.  You can even create multiclass heroes to express your playstyle.  Majestic cities, musty mushroom forests, and ominous fortresses are just examples of fantastic locations for you to explore.<\/p>\n<p>Of course, Tiny Tina&#8217;s Wonderlands wouldn&#8217;t be a Borderlands offshoot if there weren&#8217;t robots and guns to survive against skeletons, sharks and the like.  Sounds like a strange mixture at first, but could still exude a unique charm.  Let&#8217;s hope Borderlands 2022 finds the storytelling power and atmosphere of Borderlands 2 again.<\/p>\n<p>You will be able to play the Tiny Tina&#8217;s Wonderlands campaign either alone or in the seamless online multiplayer.  With up to three players, there will also be co-op action.<\/p>\n<p><h3 class=\"jp-relatedposts-headline\">similar posts<\/h3><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Be careful when buying on Steam! The Borderlands 2 DLC Tiny Tina standalone is also free! Source: 2K \/ Gearbox <\/p>\n","protected":false},"author":1,"featured_media":1094,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1093"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1093"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1093\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1094"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1093"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1093"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1093"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}