{"id":1150,"date":"2022-06-17T12:26:49","date_gmt":"2022-06-17T12:26:49","guid":{"rendered":"https:\/\/minecraft101.site\/online-game-minecraft-is-hunting-ground-of-sex-offenders\/"},"modified":"2022-06-17T12:26:49","modified_gmt":"2022-06-17T12:26:49","slug":"online-game-minecraft-is-hunting-ground-of-sex-offenders","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/online-game-minecraft-is-hunting-ground-of-sex-offenders\/","title":{"rendered":"Online game &#8220;Minecraft&#8221; is &#8220;hunting ground&#8221; of sex offenders"},"content":{"rendered":"<p><strong>A US parents&#8217; initiative raises serious allegations against Microsoft.  In the online game &#8220;Minecraft&#8221;, sex offenders would prey on children.  In a petition, the parents call on the company to take decisive action against the problem.<\/strong><\/p>\n<p><\/p>\n<p>Is the online game &#8220;Minecraft&#8221; a &#8220;hunting ground&#8221; for sex offenders who approach children here?  (Image: Getty Images)<\/p>\n<p>ParentsTogether has started a campaign against the online game &#8220;Minecraft&#8221;.  The non-profit organization accuses the rights holder Microsoft that the game is a playground for sex offenders.  In an online petition, the parent-led initiative calls on the company to make changes, primarily to the game&#8217;s chat function, where the perpetrators approached the children.  These would have to be led by moderators, it is said.  In addition, the minimum age for private messages should be raised to a minimum age.<\/p>\n<h2><strong>The open world of &#8220;Minecraft&#8221;<\/strong><\/h2>\n<p>In the open-world game &#8220;Minecraft&#8221; players can design their own world.  You can explore caves and so-called dungeons, labyrinthine rooms and corridors, build buildings and craft items.  The characters develop and can be optimized for the fight against opponents.  The game, which is approved for ages six and up, is very popular among players, which has increased in times of Corona.<\/p>\n<p><img class=\"caas-img caas-lazy has-preview\" alt=\"In \"Minecraft\"  players can create their own world.  According to experts, this is definitely beneficial for the creativity of the little players.  In the virtual space of online games, however, children also expose themselves to the risk of sexual exploitation by sex offenders.  (Image: ddp\/Chicago Tribune\/MCT\/Sipa USA)\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655468809_920_Online-game-Minecraft-is-hunting-ground-of-sex-offenders.jpeg\"\/><\/p>\n<p>In &#8220;Minecraft&#8221; players can create their own world.  According to experts, this is definitely beneficial for the creativity of the little players.  In the virtual space of the online game, however, children also expose themselves to the risk of sexual exploitation by sex offenders.  (Image: ddp\/Chicago Tribune\/MCT\/Sipa USA)<\/p>\n<p>The use of &#8220;Minecraft&#8221; is exploding, with many children chatting, playing and even doing schoolwork with friends outside of school, writes ParentsTogether with a view to the current development.  The platform is also a &#8220;popular hunting ground for child molesters&#8221; who &#8220;chat with children, ask them for pictures and then blackmail them to get more.&#8221;  Given these conditions, Microsoft can and must act immediately.<\/p>\n<p><strong>Also read: <\/strong><strong>When Bing is suddenly the default search in the Chrome browser<\/strong><\/p>\n<p>The petition has already been signed by 120,000 parents in the United States, the organization said in a statement published on its website on May 26.  There she refers to other measures she has taken against the game.  Among other things, an artist was commissioned to design an installation in the style of the game, which reads that &#8220;sex offenders prey on children in Minecraft&#8221;.  Another installation said the game&#8217;s creators ignored the concerns of 120,000 parents.<\/p>\n<p>Continue reading<\/p>\n<h2><strong>That&#8217;s what those affected say<\/strong><\/h2>\n<p>To substantiate the allegations, ParentsTogether has also published the statements of some affected parents.  &#8220;Scary people are trying to contact my child in Minecraft,&#8221; says a mother.  &#8220;Fortunately, my child knows to ask me,&#8221; she adds.  Another mother also reports that players approached her six-year-old daughter in the chat.  They are said to have threatened the girl that they would end their friendship if she didn&#8217;t send them pictures.<\/p>\n<p>This content comes from a third party.  To view this, you must change your privacy settings.<\/p>\n<p>Click here.<\/p>\n<p><strong>Also read: <\/strong><strong>Indianer blames Google for his marital woes<\/strong><\/p>\n<p>In addition, the parents&#8217; initiative, which has two million members, refers to urgent information from law enforcement agencies.  In fact, the FBI security agency had already issued a warning in March that children were spending more time online due to the corona crisis and were therefore at risk of sexual exploitation and abuse.  The problem is also discussed in the media.  ParentsTogether references the New York Times article that described Minecraft and similar games as &#8220;sex offender hunting grounds.&#8221;<\/p>\n<h2><strong>Microsoft takes a stand<\/strong><\/h2>\n<p>After ParentsTogether emailed the online petition to Microsoft on April 30, the company has since responded, the organization said.  The answer in the form of a statement is available from the tech magazine Mashable.  It states that the Microsoft-owned development company Majong Studios takes the security of the players &#8220;very seriously&#8221;.  The company has the “best tools and services in the industry to ensure minors have a “safe, fun and positive experience.” One of the tools is “parental control.” Children under the age of 13 need their consent Parents to play &#8220;Minecraft&#8221; Filters would also be used in chat rooms and a team of moderators would remove &#8220;dangerous and inappropriate&#8221; content.<\/p>\n<p><strong>Also read: <\/strong><strong>Data protection officer follows up dispute with Microsoft<\/strong><\/p>\n<p>However, ParentsTogether is not satisfied with the answer and apparently also with the measures mentioned.  The organization still accuses Microsoft of not feeling obliged to solve the problem.<\/p>\n<p><strong>VIDEO: 3 online games for quarantine<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A US parents&#8217; initiative raises serious allegations against Microsoft. In the online game &#8220;Minecraft&#8221;, sex offenders would prey on children. <\/p>\n","protected":false},"author":1,"featured_media":1153,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1150"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1150"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1150\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1153"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1150"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1150"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1150"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}