{"id":1154,"date":"2022-06-17T15:34:26","date_gmt":"2022-06-17T15:34:26","guid":{"rendered":"https:\/\/minecraft101.site\/is-roblox-safe-for-kids-see-parents-guide\/"},"modified":"2022-06-17T15:34:26","modified_gmt":"2022-06-17T15:34:26","slug":"is-roblox-safe-for-kids-see-parents-guide","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/is-roblox-safe-for-kids-see-parents-guide\/","title":{"rendered":"Is Roblox safe for kids &#8211; see Parents Guide"},"content":{"rendered":"<p>Roblox has been a huge hit with kids worldwide, despite being an odd-looking and often confusing game.  At least for parents.<\/p>\n<p>Like Minecraft before it, its appeal to youngsters is partly due to mom and dad not getting it.  That makes it all the more exciting, but it can also lead to security fears.  After all, much of Roblox is played online.<\/p>\n<p>There are many Roblox rumours, fake scary stories and fake advice on social media and even newspapers demonizing the game.  However, children can play it safely and enjoyably with little supervision and understanding.<\/p>\n<p>That&#8217;s why we&#8217;ve put together a quick guide to help you understand what makes Roblox so popular and how to make sure your kids don&#8217;t get any nasty surprises.<\/p>\n<h2>What is Roblox?<\/h2>\n<p>Roblox is an online game development system where most of the content is created by “amateur” game developers.  These game makers can use simple tools to create games and publish them to the community.  And that means they can try out ideas that wouldn&#8217;t be funded for commercial release.<\/p>\n<p>These games can then be played by children worldwide, often together online, via a phone or tablet application, or a web browser.<\/p>\n<p>Games like &#8220;Prison Escape&#8221;, &#8220;Work in a Pizza Place&#8221;, &#8220;Shark Attack&#8221; or &#8220;Disaster Survival&#8221; offer a playful opportunity to experience adult-like scenarios in fast-paced, socially played competitive rounds.<\/p>\n<p>Roblox games reflect the kind of imaginative play you often find on the playground.  One child comes up with an idea for a game, others join them and the rules slowly change as the group decides how to have fun together.  Roblox developers can quickly update their games and adapt them to the needs of the large player community.<\/p>\n<p>This ever-changing and expanding library of games is a big part of Roblox&#8217;s popularity.  Combine this with the millions of other players to compete against challenges and you have the perfect recipe for youngsters.<\/p>\n<p>However, as with any online game, there are some dangers to be aware of which we will now address.<\/p>\n<h2>Roblox age ratings<\/h2>\n<p>Because the content in Roblox is user-generated, it is not subject to the same strict age ratings as content from commercial companies.  Roblox itself is rated PEGI 7 in the UK, with the rating details specifically stating that there is no blood.<\/p>\n<p>The VSC, which administers the legally binding PEGI ratings, states that the rating only covers the base system and some sample games.  The same applies to other areas, with the ESRB taking a similar approach in the US.<\/p>\n<p>Roblox itself filters and checks the games that are created for both inappropriate images and profanity.  However, games that may have horror, murder, or gory themes are still allowed.  In a game we tried, Hotline, Roblox had players knock each other down with guns or knives before hitting each other in the head until they died with blood spatter.<\/p>\n<p><\/p>\n<p>The best solution for this is to specify the account restrictions in the linked Roblox account.  This limits the playable games to those selected by Roblox itself.  Note, however, that setting a child&#8217;s age under 13 does not limit the games they can access.<\/p>\n<h4><img loading=\"lazy\" class=\"alignnone wp-image-9652 size-full\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655480066_39_Is-Roblox-safe-for-kids-see-Parents-Guide.jpg\" alt=\"Screenshot of roblox game account settings\" width=\"600\" height=\"321\"\/><\/h4>\n<h2>Roblox in-game purchases<\/h2>\n<p>Although the actual Roblox game is free, kids are encouraged to make in-game purchases with real money.  Kids can purchase Robux for cash, which is then spent on gear and outfits in the games.<\/p>\n<p>Be sure to track and password protect credit cards on your systems to avoid unexpected purchases.  It pays to talk to your child about this commercial aspect of the game before they play.<\/p>\n<p>All games work perfectly without any additional content, but at the same time they offer players the opportunity to spend money, since this is the way game makers profit from their creations.<\/p>\n<h2>Roblox Parental Controls<\/h2>\n<p class=\"gt-block\">There are other parental controls that can be used in-game to ensure Roblox is extra safe for younger players.  It&#8217;s worth checking the Roblox website for guidance.<\/p>\n<p>First, it is important that you enter the correct date of birth for your child&#8217;s account.  This triggers the corresponding secure chat with a higher level of filtering.  It also means you get a separate parent login so you can review your child&#8217;s interactions.<\/p>\n<p>You should limit games to those curated by Roblox staff, like this:<\/p>\n<ul>\n<li>Sign in to roblox.com<\/li>\n<\/ul>\n<ul>\n<li>Click the gear icon in the top right<\/li>\n<\/ul>\n<ul>\n<li>Select Settings and then Security<\/li>\n<\/ul>\n<ul>\n<li>Enable the Account Limits slider<\/li>\n<\/ul>\n<h2>Monitoring Your Child&#8217;s Account<\/h2>\n<p>Roblox offers several ways to monitor account activity.  While logged in, you can view the following histories in their related sections:<\/p>\n<ul>\n<li>Direct chat and small group chat (Chat &#038; Party feature in the lower right corner of the apps).  There you can see individual chat histories.  This feature is limited to friends and friends of friends.<\/li>\n<li>History of private messages (Messages)<\/li>\n<li>friends and followers (friends)<\/li>\n<li>Purchase and trade history for virtual items (My Transactions, browser only)<\/li>\n<li>Creations such as games, items, sounds, ads, etc. (Create, browser only)<\/li>\n<li>Recently played games (Home, Keep Playing or My Recent)<\/li>\n<\/ul>\n<h2>Roblox Online Interactions<\/h2>\n<p>Being an online game means players can interact and communicate with each other in a variety of ways in Roblox.  This can be done by voice or text once friend requests have been made.<\/p>\n<p>It&#8217;s easy to limit these interactions to your account settings:<\/p>\n<ul>\n<li>Sign in to roblox.com<\/li>\n<\/ul>\n<ul>\n<li>Click the gear icon in the top right<\/li>\n<\/ul>\n<ul>\n<li>Select Settings and then Privacy<\/li>\n<\/ul>\n<ul>\n<li>Restrict interactions via content settings and other settings<\/li>\n<\/ul>\n<p>You should note that this will not disable friend requests in Roblox.  Because of this, it&#8217;s important that you check the &#8220;Friend Requests&#8221; page on the site to make sure strangers aren&#8217;t being accepted.<\/p>\n<h2>Roblox on Xbox<\/h2>\n<p>A few years ago Roblox game on Xbox.  How parental controls work on Xbox is slightly different than on a PC, Mac, or tablet.<\/p>\n<p>Although the Xbox has controls for friend requests, that doesn&#8217;t limit those in Roblox as they are seen as a different type of &#8220;in-game&#8221; friends.  However, Microsoft&#8217;s Game Maker Terms of Service mean that players cannot make new friends while gaming on Xbox.  You only see friends who have already been found on PC, Mac or tablet.<\/p>\n<p>In addition, you can further limit interactions with other players on Xbox as follows:<\/p>\n<ul>\n<li>Select the Account Settings page<\/li>\n<\/ul>\n<ul>\n<li>Identify the linked account<\/li>\n<\/ul>\n<ul>\n<li>Apply restrictions through roblox.com for this account.<\/li>\n<\/ul>\n<ul>\n<li>Turn on\/off cross-platform gameplay to limit who your kids can play with (Note: Currently Roblox doesn&#8217;t support cross-platform messaging, so Xbox players can&#8217;t message players on other platforms.)<\/li>\n<\/ul>\n<h2>Roblox Police Alerts<\/h2>\n<p class=\"gt-block\">Hopefully that should clarify exactly what Roblox is and how to keep your kids safe while playing.  Last thing to mention is that the slew of tweets, Facebook posts, emails and school gates gossiping about police warnings about in-game nudity and stranger danger didn&#8217;t come from Kent Police as has been widely the case reported.<\/p>\n<p>The real danger is in getting parents to ban the game and shutting down the opportunity for healthy and helpful conversations about appropriate behavior online.  As always, the best way to mitigate any of these risks in your family is to play the game together and keep devices and consoles in shared family rooms.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Roblox has been a huge hit with kids worldwide, despite being an odd-looking and often confusing game. At least for <\/p>\n","protected":false},"author":1,"featured_media":1157,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1154"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1154"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1154\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1157"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}