{"id":1160,"date":"2022-06-17T17:07:09","date_gmt":"2022-06-17T17:07:09","guid":{"rendered":"https:\/\/minecraft101.site\/peer-pressure-and-games-parenting-tips-for-the-fortnite-hype\/"},"modified":"2022-06-22T16:04:45","modified_gmt":"2022-06-22T16:04:45","slug":"peer-pressure-and-games-parenting-tips-for-the-fortnite-hype","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/peer-pressure-and-games-parenting-tips-for-the-fortnite-hype\/","title":{"rendered":"Peer pressure and games: parenting tips for the &#8220;Fortnite&#8221; hype"},"content":{"rendered":"<p><strong>First &#8220;Minecraft&#8221;, then &#8220;Fortnite&#8221;: Some video games are a virus that affects entire generations. This can be tricky for parents: will my child become an outsider if I don&#8217;t let them shoot?<\/strong><\/p>\n<p>&#8220;But everyone plays it!&#8221; What seems like a surefire argument for children and young people makes many parents just roll their eyes. Should I really only allow the latest shooting game because the whole class hangs out in front of it every afternoon? no, right? Experts say: Yes, it can be.<\/p>\n<p>Again and again there are video games that are not only successful, but become a mass phenomenon: the virtual block digging of &#8220;Minecraft&#8221;, the monster hunt of &#8220;Pokémon Go&#8221; and above all &#8220;Fortnite&#8221;, depending on the measurement technology, perhaps the most successful game ever.<\/p>\n<p>The problem with this: &#8220;Fortnite&#8221; has colorful comic graphics and happily dancing characters. But it&#8217;s also a shooter. If you want to win, you have to be the last survivor of 100 players &#8211; and you only get that by shooting the competition.<\/p>\n<p>How brutal is &#8220;Fortnite&#8221;?<\/p>\n<p>&#8220;Fortnite already has this competitive spirit, a very combative setting,&#8221; says qualified social worker Daniel Heinz, who heads the game guide NRW. &#8220;Even if the brutality is significantly reduced compared to other shooters.&#8221; In concrete terms, this means that shots are fired, but blood doesn&#8217;t flow, and the characters don&#8217;t die either.<\/p>\n<p>The classification of the Independent Self-Regulation (USK), which is responsible for the age rating of games in Germany, is correspondingly mild: the so-called Battle Royale mode, the popular heart of &#8220;Fortnite&#8221;, is like the rest of the game from 12 years of age Approved. &#8220;The agreement on the game date is transparent for 12-year-olds from the start, there are no shocking elements,&#8221; the statement said.<\/p>\n<p>The verdict of the game advisor NRW is not fundamentally different &#8211; but a bit stricter: &#8220;Fortnite: Battle Royale&#8221; is only suitable for young people from the age of 14 at the earliest &#8211; younger people could be overwhelmed or frustrated by the nerve-wracking competition.<\/p>\n<p>Parents need their own opinion<\/p>\n<p>So even experts are never in complete agreement when it comes to assessing popular games. That&#8217;s why mum and dad can&#8217;t avoid watching the games themselves, says Heinz: &#8220;In discussions like this, parents need a clear stance that they can then represent authentically. But that also means getting a comprehensive picture.&#8221;<\/p>\n<p>&#8220;If I have a stupid gut feeling about a game, I should express it &#8211; then you can talk about it,&#8221; says family blogger Patricia Cammarata, who writes about games and media in education at www.dasnuf.de, among other things. &#8220;Especially with young people, it&#8217;s important to be as specific as possible, otherwise these arguments won&#8217;t be accepted. And for that I just have to deal with the game.&#8221;<\/p>\n<p>If you want to get to know a game, you don&#8217;t necessarily have to use a controller or smartphone yourself. On the one hand, there are websites such as Spielbar or the NRW game guide that publish texts on current games. There are also live streams or recordings of games, so-called lets-plays, available on platforms such as YouTube and Twitch. And, of course, parents can look over their child&#8217;s shoulder while they are playing.<\/p>\n<p>Peer pressure as an argument<\/p>\n<p>Trained in this way, parents can then engage in discussion with their offspring. But what if the child replies &#8220;Everybody&#8217;s playing!&#8221; opposes? &#8220;When such a hype arises, it can happen that young people feel left out when everyone in the schoolyard is talking about it,&#8221; says Daniel Heinz &#8211; and therefore advises at least not completely wiping the peer pressure argument aside.<\/p>\n<p>&#8220;The argument that &#8216;everyone&#8217; is playing something in the class can definitely count,&#8221; agrees Cammarata. However, she also advises, especially with slightly younger children, to listen to other parents first.<\/p>\n<p>Experts therefore advise compromises. “You can also participate in Fortnite outside of the game, for example by watching things on YouTube,” says Cammarata. &#8220;With eight-year-olds who perhaps really don&#8217;t have to play it yet, you say: &#8216;Come on, let&#8217;s look at a few things together.&#8217; That often helps.&#8221;<i> (dpa)<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>First &#8220;Minecraft&#8221;, then &#8220;Fortnite&#8221;: Some video games are a virus that affects entire generations. This can be tricky for parents: <\/p>\n","protected":false},"author":1,"featured_media":1161,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1160"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1160"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1160\/revisions"}],"predecessor-version":[{"id":1616,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1160\/revisions\/1616"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1161"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1160"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1160"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1160"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}