{"id":1166,"date":"2022-06-17T18:33:40","date_gmt":"2022-06-17T18:33:40","guid":{"rendered":"https:\/\/minecraft101.site\/dont-be-afraid-of-gambling-fun-opportunities-and-risks-of-fortnite-minecraft-co\/"},"modified":"2022-06-17T18:33:40","modified_gmt":"2022-06-17T18:33:40","slug":"dont-be-afraid-of-gambling-fun-opportunities-and-risks-of-fortnite-minecraft-co","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/dont-be-afraid-of-gambling-fun-opportunities-and-risks-of-fortnite-minecraft-co\/","title":{"rendered":"Don&#8217;t be afraid of gambling fun: opportunities and risks of Fortnite, Minecraft &#038; Co"},"content":{"rendered":"<h2>Video games are a part of young people&#8217;s lives today.  According to the industry association Bitcom, 89 percent of 10 to 18 year olds play digital games.  Nathanael Ullmann sees a great opportunity in this – but also risks.<\/h2>\n<p>If you follow the debate on the topic of “children and video games”, two camps in particular are particularly loud.  Some see, to put it bluntly, that every computer gamer will become the next gunman.  The others glorify the digital game as the best place to learn.  After years of gaming experience and researching the subject, I can say: the truth, as is so often the case, lies somewhere in the middle.  A few hours in the virtual world will not turn a child with natural social behavior into a problem – but also not into a beast of intelligence.<\/p>\n<p>There is no denying that there are dangers lurking in the digital gaming world.  Despite everything, I am a big supporter of the idea of ​​letting children play – even virtually.  In this article I want to shed light on both sides.  On the one hand I want to draw attention to where pitfalls lurk behind the pixels, but on the other hand I want to take away fears.<\/p>\n<h3>THE PREJUDICES<\/h3>\n<p>When I talk about computer games, I keep getting misconceptions.  I want to clean up here with two.<\/p>\n<p><strong>&#8220;Video games make you lonely&#8221;<\/strong><br \/>In society, one dominant image regularly strikes me: the lonely gambler sitting in front of the flicker box in a dark room.  And in fact, the player initially sits alone in front of the computer or console.  But I can reassure worried parents: it may not be as lonely as your child seems.  For some time now, there has been a movement towards so-called “multiplayer games” on the games market.  This means that people from all over the world can meet online and play together.  Now, one shouldn&#8217;t look at this with glorified glasses.  Depending on the game, the tone between users can be quite harsh.  On the other hand, playing together encourages human interaction.<\/p>\n<p>I meet friends online regularly.  A meeting in real life would be impossible in the evening, since we live far apart.  Despite everything, we can hear each other, experience something together and exchange ideas.  We solve tasks together, celebrate success and have fun.  Gambling doesn&#8217;t necessarily make you lonely.  The question remains, however, whether children should not prefer to see themselves &#8216;for real&#8217;, given time and distance.  And of course digital contact will never be able to replace real meetings.  As so often, the same applies here: It depends on the right measure.  If your child only maintains friendships online, this should be addressed.  Occasionally meeting friends online can be a valuable asset.<\/p>\n<p><strong>&#8220;Video Games Make You Stupid&#8221;<\/strong><br \/>I have seldom encountered this prejudice with such clarity.  But it always resonates.  Computer games can be very useful.  For now, of course, they relax.  But they are also a good school.  A child playing Minecraft can learn to develop and implement creative ideas on their own.  I myself played the strategy game Civilization III while I was at school – the historical background made Roman history more accessible to me.<\/p>\n<h3>THE DANGERS<\/h3>\n<p>I wouldn&#8217;t be serious if I didn&#8217;t talk about the dangers of gambling.  In three places in particular I see stumbling blocks that parents should be aware of.<\/p>\n<p><strong>The Addiction<\/strong><br \/>Video game addiction is a difficult subject.  There&#8217;s no denying that.  The role-playing game genre in particular deliberately uses strategies to keep users engaged over a long period of time.  Here you can go up a level and there you can complete a task (called a quest).  The chance of great fame lures many into the virtual alternative worlds &#8211; and never lets them go.  The immersive feeling that games have over other media then does the rest.  This is far from true for every genre and every player.  I also don&#8217;t think it&#8217;s a good solution to ban children from playing altogether because of this.  But there should be clear boundaries.  The EU initiative Klicksafe, for example, recommends that children between the ages of four and six should not be allowed to play for more than 30 minutes a day when accompanied by their parents.  According to Klicksafe, young people between the ages of eleven and 13 should not play for more than 60 minutes.  Ideally, define rules with your child.  For example: How many rounds can he play after doing his homework?<\/p>\n<p><strong>The gambling<\/strong><br \/>The topic of &#8220;gambling&#8221; is also closely related to the topic of &#8220;addiction&#8221;.  For several years it has been common in the industry to lure players into additional purchases.  Many a game, especially on smartphones, comes onto the market for free, but relies on customers paying extra for additional weapons, maps or outfits.  The methods are often borrowed from gambling.  Initially, the player is overwhelmed with free rewards, he gets to know the charm of quick success.  Later the rewards will be reduced, he should pay for it.  The items are hidden in chests, where a minor item or an incredibly rare weapon may be waiting &#8211; what the buyer gets is random.  A lot of money can be spent on this.  When programs lure with terms like “Free2Play”, parents should take a critical look at them.<\/p>\n<p><strong>the violence<\/strong><br \/>I also have to say a word about violence in video games.  Yes, a lot of mainstream games rely on the player having to wield a weapon.  And yes, video games can also be violent.  When I was a little kid on vacation, I had the opportunity to play GTA: Vice City on my cousin&#8217;s PC for far too long.  For a long time I could not process these impressions of violence.  On the other hand, I would like to put this into perspective: Firstly, for this very reason, there are age ratings that should definitely be observed.  A child cannot yet process certain game content – ​​depending on their age, this also includes gun violence.  Secondly, just outside of the mass market, there are a large number of games that are completely peaceful.  An example is the adventure &#8220;Fire&#8221; from the German developer studio &#8220;Daedelic&#8221;.  Here the player clicks through a lovingly drawn world as a Stone Age man.  The special feature: &#8220;Fire&#8221; manages without written words.  Most Nintendo titles (like the Super Mario series) are also worth recommending when it comes to violence.  Although you can fight monsters in these titles, this is, with a few exceptions, presented in an absolutely child-friendly way.<\/p>\n<h3>WHAT CAN PARENTS DO?<\/h3>\n<p>Parents should steer the playing behavior of their son or daughter in a controlled way.  Because of the existing dangers, it is worth taking a critical look.  What can it look like?<\/p>\n<p><strong>listening and participating<\/strong><br \/>If your child loves games, they will want to talk about it.  Even if you may not be interested, attentive and interested listening can only be useful.  This is the easiest way to find out which game worlds you are sinking into.  And this is the best way for you to find out whether what you have experienced fits your age group.  Participating is of course even better than just listening.  Playing together is an incredible joy, especially at a young age.  The Monday afternoons when my father and I puzzled our way through Monkey Island are still among the fondest memories of my childhood.<\/p>\n<p><strong>Inform<\/strong><br \/>A great advantage of the information age is that there is a multitude of articles about every modern game.  If your child mentions playing Fortnite, it&#8217;s easy to google that term.  Websites like www.  spieleratgeber-nrw.de explain the background to the most important titles in a technically well-founded manner.  And if texts about the title are not enough for you, you can watch a so-called &#8220;Let&#8217;s Play&#8221;.  These are videos in which players film themselves gambling.  This way you will quickly know how the game works and whether it is suitable for your child.<\/p>\n<p><strong>Note USK<\/strong><br \/>A great blessing that we have in Germany is the USK, the “entertainment software self-control”.  No game that hits the store gets by without this label.  A look at the packaging makes it easy to see from which age group a game is suitable.  It becomes problematic when your child no longer buys the games in stores but online.  Some shops such as the Google Play Store or the Xbox Store are part of the IARC system, which assigns an age rating using an automated process.  This marking can also be a clue.  It also makes sense, especially in the case of younger children, not to link online gaming platforms such as Steam to a payment account.  Your children can then only buy new, paid games together with you.  This is how you keep track.<\/p>\n<p><strong>Nathanael Ullman<\/strong> is a trainee in the online editorial office of the SCM Bundes-Verlag and at the men&#8217;s magazine MOVO.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Video games are a part of young people&#8217;s lives today. According to the industry association Bitcom, 89 percent of 10 <\/p>\n","protected":false},"author":1,"featured_media":1167,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1166"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1166"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1166\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1167"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1166"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1166"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1166"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}