{"id":1183,"date":"2022-06-18T05:09:21","date_gmt":"2022-06-18T05:09:21","guid":{"rendered":"https:\/\/minecraft101.site\/children-to-the-consoles-mom-blog\/"},"modified":"2022-06-18T05:09:21","modified_gmt":"2022-06-18T05:09:21","slug":"children-to-the-consoles-mom-blog","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/children-to-the-consoles-mom-blog\/","title":{"rendered":"Children to the consoles!  &#8211; Mom blog"},"content":{"rendered":"<p>By Mamablog Editors, January 7, 2015<\/p>\n<p>A papa blog by Philippe Zweifel*<\/p>\n<p><\/p>\n<p class=\"wp-caption-text\">Like Lego, only a hundred times more sophisticated: the character of a child fights a sword fight in «Minecraft».  The environment, the character, even the gorge: all self-made.  Photo: Minecraft<\/p>\n<p>The debate about how much television or gaming is right for children <strong>is at the top of my parental boredom list<\/strong>, between badminton games and the 100th visit to the zoo monkey house.  Nevertheless, it knocked my pacifier out of the Mamablog post “Gaming for the sake of friends”.  The children of the esteemed colleague Kuster are apparently only allowed to play 10 minutes a day.  If the children&#8217;s friends are playing on iPad or Wii, they are forbidden to join and have to go home.  After all, you have rules at home that you have to enforce – as well as a great collection of board games.<\/p>\n<p>This attitude contradicts my own educational principles so fundamentally and on so many levels that I <strong>I don&#8217;t even know where to start moaning<\/strong>.<\/p>\n<p>With the rules?  They are important, they offer children structures that in turn give them self-confidence.  But guess what?  In Switzerland they overdo it.  When I became a father, the most heard piece of advice was: “set boundaries”.  Sleeping, eating, playing, talking, watching TV, and pretty much every other activity a toddler does. <strong>Everything has to be timed or fixed<\/strong>.  Like in the barracks.  Lunch at 12pm, dinner at 6pm.  30 minutes afternoon nap.  The pee time is still limited!<\/p>\n<p>And surely the little ones can distinguish between foreign and their own rules?  Hello confidence!  But of course, completely forgotten: after ten minutes of gaming you will <strong>fat, stupid and violent<\/strong>creativity and language development go to the dogs.<\/p>\n<p>I don&#8217;t want to use any of the numerous neurological studies that prove the opposite.  Instead, I appeal to belief in progress.  My great-grandparents probably demonized illustrated children&#8217;s books.  The grandparents were suspicious of hula hoops or other newfangled stuff.  And then my parents protect me from plastic toys &#8211; after which I was able to enjoy wooden Pastorini carts.  I can&#8217;t remember that<strong> would have given me even a second of pleasure.<\/strong> But the main thing is that they are educationally valuable.<\/p>\n<p>Speaking of which, I can serve you with a great invention from the 21st century: «Minecraft», a world building game, a kind of virtual Lego box, just a hundred times more sophisticated (especially if you compare it to a ladder game).  The game succeeds with brilliance in awakening human curiosity and the urge to create.  A game that is fun for young and old, boys and girls: <strong>One cannot overestimate this achievement<\/strong>.  My son, six years old, played it several hours a day over the Christmas holidays.  Not alone, but with his cousins, each on their iPad, connected by Wi-Fi.<\/p>\n<p>After four hours of non-stop gaming, he looked up once, saw me and said, &#8220;It&#8217;s damn good on the internet, dear dad.&#8221; <strong>I&#8217;ve rarely been prouder of him<\/strong>.  Except when he joined the football club.  Or learned to play chess.  Climbed his first tree.  He does things like that besides gaming.<\/p>\n<p><iframe title=\"Let&#039;s Play Minecraft  - Episode 1\" width=\"1140\" height=\"641\" src=\"https:\/\/www.youtube.com\/embed\/_uq70stPZ8w?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>The first steps: A guide for newcomers to Minecraft.  Source: Youtube<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-8055\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655528961_720_Children-to-the-consoles-Mom-blog.jpg\" alt=\"doubt\" width=\"100\" height=\"100\"\/>*Philippe Zweifel, 41, is deputy head of the culture department of the &#8220;Tages-Anzeiger&#8221;.  He lives with his family in Zurich.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By Mamablog Editors, January 7, 2015 A papa blog by Philippe Zweifel* Like Lego, only a hundred times more sophisticated: <\/p>\n","protected":false},"author":1,"featured_media":1184,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1183"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1183"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1183\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1184"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}