{"id":1205,"date":"2022-06-18T16:15:04","date_gmt":"2022-06-18T16:15:04","guid":{"rendered":"https:\/\/minecraft101.site\/information-minecraft-landkreis-stade\/"},"modified":"2022-06-18T16:15:04","modified_gmt":"2022-06-18T16:15:04","slug":"information-minecraft-landkreis-stade","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/information-minecraft-landkreis-stade\/","title":{"rendered":"Information &#8211; Minecraft Landkreis Stade"},"content":{"rendered":"<p>Our character starts in a world that consists exclusively of different blocks.  These are always the same size (one cubic meter in relation to reality) and at first glance only differ in their colour.  The game randomly generates an environment from countless blocks, which surprisingly always looks coherent and encourages exploration: barren deserts, mighty mountains, green meadows complete with cows and other animals &#8211; or even an extensive ice region.<\/p>\n<p>So here we are and have no idea what to do, there is no help or explanation.  However, we quickly find out that we can remove brown blocks of earth with our bare hands and also dissect trees into their angular parts.  Everything we get hold of is collected in our inventory, which is like the character&#8217;s backpack.  If we now select the earth blocks found here, we can arrange them anywhere in the world and thus create new structures.  We then make our first tools from the wood &#8211; a shovel for blocks of sand, an ax for trees and a pickaxe for rocks.  To do this, the components must be arranged in a certain way in the menu.  The game does not reveal which shapes lead to which result.  The only thing that helps is to try it out or look it up on the Internet (e.g. on Minecraftwiki.de). <\/p>\n<p>The consistently implemented, angular sun tells us the time of day, it is evening &#8211; our attempts to walk have devoured the first day in no time.  Now comes the tricky part of the otherwise peaceful Minecraft world: As soon as the sun goes down, monsters made of blocks come out of their hiding places and hunt down the player.  To protect ourselves from them, we must find a home.  Either we carve a cave in a mountain or we build a simple hut out of blocks of earth in an open area.  It&#8217;s dark in the hiding place and we have to wait and see.  Tomorrow we have to drive a tunnel into the mountain and look for blocks of coal, if we combine them with our wood, torches are created that also illuminate our accommodation at night.  If we find enough wood, we can build a door.  If we have enough stone for a furnace, we melt sand into it to make glass, which we use to make our windows.  And if we dig deep enough, we might find iron to forge armor to protect ourselves from the creatures.  But as we dig our way into the mountain, we&#8217;re likely to come across underground rivers and lakes that we&#8217;ll have to avoid or divert, encounter dangerous lava, or even encounter new monsters lurking underground.  Adventure awaits around every corner, hope for valuable materials, but also danger.  The possible combinations of the materials are immense, the construction possibilities almost endless.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our character starts in a world that consists exclusively of different blocks. These are always the same size (one cubic <\/p>\n","protected":false},"author":1,"featured_media":1206,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1205"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1205"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1205\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1206"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1205"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1205"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1205"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}