{"id":1254,"date":"2022-06-19T01:34:12","date_gmt":"2022-06-19T01:34:12","guid":{"rendered":"https:\/\/minecraft101.site\/are-computer-games-bad-for-the-brain\/"},"modified":"2022-06-22T16:06:53","modified_gmt":"2022-06-22T16:06:53","slug":"are-computer-games-bad-for-the-brain","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/are-computer-games-bad-for-the-brain\/","title":{"rendered":"Are computer games bad for the brain?"},"content":{"rendered":"<p class=\"text\">\n<p>For some, computer games are the basic evil of modern societies, for others fun, excitement, leisure activities and useful brain training. The argument about the influence of computer games has been going on for decades. A current study by the University of Ulm now seems to agree with the critics. She found out that anyone who spends an hour a day playing online computer games loses brain volume &#8211; after just six weeks. The study also shows that gaming can have a negative impact on emotional management and decision-making.<\/p>\n<blockquote>\n<p class=\"text\">The observed reduction could be associated with poorer emotion regulation and decision making. It is worrying that the structural changes in the brain could already be detected after six weeks.<\/p>\n<p>Christian Monday | University of Ulm<\/p><\/blockquote>\n<h3 class=\"subtitle \">The gray cells become less<\/h3>\n<p class=\"text\">\n<p>The reason for this, according to the study, is the decrease in gray matter in the orbitofrontal cortex, an area of ​​the brain that sits just above eye level at the front of the skull. Because it governs human emotions, it is considered the seat of ethical and moral sentiment. When this area is damaged, those affected lack a moral compass, which is why they have problems making decisions. The ability to assess one&#8217;s own behavior can also be impaired.<\/p>\n<p>The scientists had subjects play the online role-playing game &#8220;World of Warcraft&#8221;. At the beginning and end of the gaming period, the participants were then examined with a magnetic resonance imaging scan. The reason for the change in structure is the ability of the brain to adapt to new circumstances. When learning to play musical instruments, for example, areas of the brain that are responsible for the motor skills of the hands change. And with online games, according to the researchers, there is apparently less gray matter. The scientists speak of neuroplastic processes.<\/p>\n<h3 class=\"subtitle \">Cause or consequence of computer game addiction?<\/h3>\n<p class=\"text\">\n<p>In the study, the participants were divided into different groups: gaming professionals and gaming newcomers. The MRI scans of computer game newcomers were compared right at the start with the results of long-term gamers. Experienced gamers had a lower volume in the affected brain area from the start. They also showed higher addiction tendencies. It is now unclear whether the reduced brain volume is a consequence or possibly a prerequisite for the computer game addiction. The online role-playing game &#8220;World of Warcraft&#8221; was used for the study because it is one of the best-known and most widespread online games. Critics also often associate it with computer game addiction.<\/p>\n<h3 class=\"subtitle \">Positive effects of gaming<\/h3>\n<p class=\"text\">\n<p>A study by the Hanover Medical School, which was published in March of this year, came to completely different conclusions: no difference could be found between gamers and non-gamers. Subjects were shown images that challenge empathy. They were asked to fill out a questionnaire and asked how they felt about it. A brain scan was also made here. The results of the players did not differ from non-players. Gamers are therefore just as empathetic as other people. And violence in games, as the managing director of the German Cultural Council Olaf Zimmermann stated in August this year, is &#8220;an important motive for action&#8221;, comparable to violence &#8220;in novels, films and the visual arts&#8221;. According to Zimmermann, computer games are therefore cultural assets.<\/p>\n<blockquote>\n<p class=\"text\">Some gems among computer games are even works of art.<\/p>\n<p>Olaf Zimmermann, German Cultural Council<\/p><\/blockquote>\n<p class=\"text\">\n<p>It wasn&#8217;t until September that scientists showed the positive effects of gaming. Those who play regularly are better at grasping situations quickly, generating new knowledge and categorizing what they have learned. The reason for this is increased activity in the hippocampus, an area that is important for learning and may be trained through computer games. Certain games could therefore be used in the fight against dementia. With the latest results, the scientific dispute about the influence of computer games seems to be going to the next level.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For some, computer games are the basic evil of modern societies, for others fun, excitement, leisure activities and useful brain <\/p>\n","protected":false},"author":1,"featured_media":1255,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1254"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1254"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1254\/revisions"}],"predecessor-version":[{"id":1628,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1254\/revisions\/1628"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1255"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1254"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1254"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1254"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}