{"id":1256,"date":"2022-06-19T02:53:30","date_gmt":"2022-06-19T02:53:30","guid":{"rendered":"https:\/\/minecraft101.site\/do-computer-games-make-you-stupid-or-do-they-stimulate-the-brain\/"},"modified":"2022-06-19T02:53:30","modified_gmt":"2022-06-19T02:53:30","slug":"do-computer-games-make-you-stupid-or-do-they-stimulate-the-brain","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/do-computer-games-make-you-stupid-or-do-they-stimulate-the-brain\/","title":{"rendered":"Do computer games make you stupid?  Or do they stimulate the brain?"},"content":{"rendered":"<p class=\"First atc-TextParagraph\" id=\"pageIndex_1\">If you don&#8217;t know anything about League of Legends, you&#8217;re probably over thirty and don&#8217;t have much to do with computer games of the newer generation.  Around 100 million people around the world regularly play “LoL”, as connoisseurs call it, and at the moment around seven million are letting their fantasy-look avatars loose on each other.  The game, which usually pits two teams of five members against each other, is even played in front of large crowds as a professional e-sport with an annual world championship.  The winners, who often come from South Korea, can look forward to millions in prize money.<\/p>\n<p class=\"atc-TextParagraph\">LoL is just one of many.  Games like Starcraft, Defense of the Ancients or World of Warcraft, which is notorious for its addictive potential, also belong in the category of multiplayer online battle arenas (MOBAs).  If you look at one of the many introductory videos on the Internet, it quickly becomes clear: This has little to do with stupid daddling.  The rules are complex and strategic thinking is required to win against opponents controlled by other players.  So nothing for the stupid.<\/p>\n<p class=\"atc-TextParagraph\">&#8220;Think of LoL as time-lapse team chess with hundreds of mutated pawns,&#8221; says Alex Wade, a psychologist at the University of York in northern England.  Wade, together with gaming researchers at his university, investigated whether and how gaming success is related to intelligence.  For the study recently published in &#8220;Plos One&#8221;, 56 competitive players completed a common intelligence test: &#8220;There was a clear correlation.  High-ranking LoL players also performed better on the fluid intelligence test, which is problem-solving.” The question of whether the hours in front of the screen made the players smarter or whether smarter players make it further in the league , cannot be answered from such correlation data.  &#8220;We&#8217;re guessing the latter,&#8221; says Wade, &#8220;because experience has shown that IQ improves only slightly with exercise.&#8221;<\/p>\n<h3 class=\"atc-SubHeadline\">Research confirms many a positive effect<\/h3>\n<p class=\"atc-TextParagraph\">Computer games, from mobile phone daddling to violent ball battles to MOBAs, have long been a common pastime for large parts of industrial societies.  The sales achieved with it leave those of the film or music industry far behind.  Research on it is also thriving, generating hundreds of studies annually.  After all, one wants to know whether the brain and behavior are positively or negatively influenced by this mass phenomenon.<\/p>\n<p class=\"atc-TextParagraph\">Contrary to popular belief, the results mostly come down to the fact that computer games improve the brain functions involved.  The ability to direct attention to relevant sensory impressions and to ignore competing perceptions benefits in particular.  This can be seen, for example, in the so-called Stroop task, in which you have to name the font color of words that are presented in quick succession.  If the color terms are different, for example “blue” in red, the response time and error rate increase.  But those who regularly pass the time with action-packed computer games will get along much better with it.  Functional brain scans confirm that competing sensory inputs are dealt with more efficiently.<\/p>\n<p class=\"atc-TextParagraph\">Training effects were also seen in spatial awareness or cognitive control, which makes it easier for someone to switch back and forth between two tasks.  “People who often play action computer games are very good at such tasks.  They change quickly and without much effort,” says Daphne Bavelier, who has been studying how such games affect brain functions at the University of Geneva for many years.  In order to distinguish between cause and effect, subjects who had not previously played were also tested – with a similar effect.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you don&#8217;t know anything about League of Legends, you&#8217;re probably over thirty and don&#8217;t have much to do with <\/p>\n","protected":false},"author":1,"featured_media":1257,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1256"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1256"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1256\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1257"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1256"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1256"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1256"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}