{"id":1258,"date":"2022-06-19T04:57:17","date_gmt":"2022-06-19T04:57:17","guid":{"rendered":"https:\/\/minecraft101.site\/10-games-that-are-good-for-the-brain\/"},"modified":"2022-06-19T04:57:17","modified_gmt":"2022-06-19T04:57:17","slug":"10-games-that-are-good-for-the-brain","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/10-games-that-are-good-for-the-brain\/","title":{"rendered":"10 games that are good for the brain &#8211;"},"content":{"rendered":"<p>There are many things that are good for the brain, but some parents believe TV programs and games make you stupid.  But that is only half the truth.  That may be the case with some films and series as well as games, but there are also films, series and games that are actually very good for the brain and for learning and creativity.  But in order not to digress too much, in this post we will only focus on the games that are good for the brain.<\/p>\n<p><strong>1. <\/strong>Minecraft<\/p>\n<p>Minecraft?  Is this supposed to be good?  Absolutely!  Because all building elements are square, it is all the more difficult to build round things, such as a round tower, an igloo or a dome.  In addition, building is not tied to the usual earthly conditions in many respects.  There you can create floating islands and floating buildings by working your way up in one place with dirt, stones, wood or similar and then building something in the height.  The endless possibilities are good for the brain.  Actually very good.  There are even wonderful Minecraft enchantments, I love them!<\/p>\n<p><strong>2. Hidden Object<\/strong><\/p>\n<p>Unless you always play the same hidden object, it is very good for the brain to look for different objects in different pictures.  However, this assumes that they are correctly translated.  With some games it happens that the translation is not quite correct and you look stupid and stupid.  But that is rarely the case.  Some games even have multiple Hidden Object Search features.  For example, one time you are looking for objects that are indicated with words, another time you are looking for objects that are represented in the form of a silhouette, the next game is about finding a pair of several objects and sometimes you are looking for the differences on the left and right of the picture.<\/p>\n<p><strong>3. &#8220;I&#8217;m packing my suitcase&#8221;<\/strong><\/p>\n<p>A well-known and very old game that is still very good for the brain today.  This is mostly about memory.  How much can you remember?  If you don&#8217;t know the game, you&#8217;ll get a little introduction:<\/p>\n<p>The game begins with the first player packing something in the suitcase. For example: &#8220;I&#8217;m packing my suitcase and putting in it: a tennis racket.&#8221; Then it&#8217;s the second player&#8217;s turn and they have to repeat what the first packed, but with something else add.  Then he says, &#8220;I&#8217;ll pack my suitcase and put in it: a tennis racket and a notebook.&#8221; The more people participate, the more confusing and challenging it gets.  Oh yes: And of course funnier.<\/p>\n<p><strong>4. Mahjong<\/strong><\/p>\n<p>There are many mahjong games with different pictures, shapes and figures, ranging from easy to medium to difficult &#8211; some games also have an option to choose expert.  Determining the correct order to combine the respective images.  You win when you have found all pairs.  This is very tricky in some games.<\/p>\n<p><strong>5. Sudoku<\/strong><\/p>\n<p>Not only as a puzzle, but also as a whole game on the computer, Sudoku is very good for mental movement.  Depending on the game, you either have to enter the different patterns or the numbers 1 to 9 in the individual squares, so that each pattern or each number only appears once per 9-box, per column and per row.  In addition, Sudoku is now not only available in the classic version, but with many other patterns and with more numbers &#8211; for example 1 to 12.<\/p>\n<p><strong>6. Chess<\/strong><\/p>\n<p>The logic classic that should not be missing &#8211; whether online, against the PC or classic on a board.  You have to see that your opponent is checkmated.  This means the king is so encircled that it will fall in each subsequent move, or even fall in the next move.  You have to keep in mind that certain pieces can only move in a certain way on the chessboard.  Some figures may jump over others, the next figures may not.  It is important to make sure that you have as many pieces in play as possible and don&#8217;t let your opponent take them away so that you continue to have good chances.  You only get good at the game if you practice a lot and anticipate your opponent&#8217;s moves.  This requires a good memory, a lot of logic and a lot of strategy.<\/p>\n<p><strong>7. Scrabble<\/strong><\/p>\n<p>Draw letters and place words – place as many words as possible.  These should be long, contain difficult letters and placed on the appropriate fields so that they score as many points as possible.  This is a very good game to learn new words and later it will help you to learn long and complicated words faster.  It&#8217;s a good way to learn the language and helps with spelling.<\/p>\n<p><strong>8. City, country, river<\/strong><\/p>\n<p>The classic that is played both online and offline, also with different categories and with almost all the letters of the alphabet.  The classic is, as the name suggests, with city, country and river, but in the meantime the game has been expanded to include many funny but also serious categories.  The aim is to use different words than the other players (e.g. when they hear the letter P, everyone writes down the name of the city of Paderborn and you choose Pinneberg for a change) &#8211; but you have to guess &#8211; you don&#8217;t look at the other players&#8217; papers!  If you have the same word as someone else, you only get 5 points;  if you have a different word than the other players, you get 10 points, and if you are the only one who filled in a category, you even get 20 points.  The round will automatically stop when someone has completed all categories for the letter (or you can run out an hourglass).  This is a very good game for memory, for learning places, countries, rivers and other terms, as well as a good game for a faster pace.<\/p>\n<p><strong>9. Blocus<\/strong><\/p>\n<p>Block your opponent by placing the stones in your opponent&#8217;s way in such a way that you can get rid of your stones but he can&#8217;t get rid of his.  Everyone has a color &#8211; but they must not touch their own color.  In addition, you have to try to get rid of the most and most difficult figures so that as few points as possible remain.<\/p>\n<p>There is a more detailed explanation here.<\/p>\n<p><strong>10.Dr.  Kawashima&#8217;s Brain Training<\/strong><\/p>\n<p>Who does not know it?  Brain jogging by Dr.  Kawashima?  A colorful mishmash of different puzzles and tasks.  They only last a few moments and yet you can train the brain in many different ways so that you have something for the various areas.  Available for the Nintendo DS, PC, Mac and even as a book.<\/p>\n<p>Which games do you think keep the brain fit?  What do you use to keep your brain busy?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are many things that are good for the brain, but some parents believe TV programs and games make you <\/p>\n","protected":false},"author":1,"featured_media":1259,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1258"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1258"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1258\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1259"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1258"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1258"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1258"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}