{"id":1267,"date":"2022-06-19T08:50:38","date_gmt":"2022-06-19T08:50:38","guid":{"rendered":"https:\/\/minecraft101.site\/trying-to-understand-the-four-dimensional-minecraft-broke-my-brain\/"},"modified":"2022-06-22T16:06:38","modified_gmt":"2022-06-22T16:06:38","slug":"trying-to-understand-the-four-dimensional-minecraft-broke-my-brain","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/trying-to-understand-the-four-dimensional-minecraft-broke-my-brain\/","title":{"rendered":"Trying to understand the four-dimensional Minecraft broke my brain"},"content":{"rendered":"<p>Humans are very good at finding their way around in three-dimensional space. After all, that&#8217;s how the real world works. But try adding an extra dimension to something as simple as, say, Minecraft, and suddenly things take a sharp turn into the confusing.<\/p>\n<p>So what is confusing is how I would describe 4D Miner. Available as a free demo on Steam, developer Mashpoe&#8217;s extradimensional version of Minecraft is plenty to get your head around, even after following a short tutorial that explains the concept of dimensionality using a cute frog.<\/p>\n<p>(Image credit: Mashpoe)<\/p>\n<p>The playable tutorial introduces the concept of rotating through dimensions by showing you a 2D platformer, with a visualization of how this &#8220;slice&#8221; of the world is representative of a larger 3D space. Scroll the mouse wheel and this segment rotates and changes the 2D view.<\/p>\n<p>Enter the game itself, and the same concept applies. You explore a 3D world like regular Minecraft. But scroll the wheel and your &#8220;chunk&#8221; of larger 4D space spins, shearing the world against itself. If it sounds confusing, that&#8217;s because I&#8217;m still struggling with mentally visualizing how the dimensions change relate to each other at all &#8211; one seems to fold the world in on itself, a cubic world finding diagonals, while another, hidden plane rotates against or in, or on top of that, and oh god, it&#8217;s all very confusing, isn&#8217;t it?<\/p>\n<p>As you explore the world from a 3D perspective, you must rotate through the fourth dimension to continue exploring. Objects may fall from trees or boulders that are beyond your current frame of reference, caves may expand into forest valleys, and you may be attacked by terrifying hyper-spiders from outside your current frame of reference.<\/p>\n<p>Fortunately, there are tools to help you navigate 4D space. Crafting 4D glasses from mysterious ore allows you to see things outside of your limited perspective, while a compass not only tells you where you are but gives you a solid visualization of how 4D space is actually constructed.<\/p>\n<p class=\"vanilla-image-block\" style=\"padding-top: 56.25%;\"><\/p>\n<p>(Image credit: Mashpoe)<\/p>\n<p>At the moment, 4D Miner is a fairly simple emulation of Minecraft&#8217;s mechanics. But that extra dimension adds infinite complexity to something as simple as &#8220;how do I build a house in four-dimensional space&#8221;? The developer is even toying with the idea of ​​four-dimensional multiplayer, which sounds like a wonderfully messy way to mistake yourself for a friend.<\/p>\n<p>&#8220;On the surface, this game looks a bit like Minecraft, and the inspiration is undeniable,&#8221; Mashpoe said in a YouTube explainer. &#8220;But things like building, gathering resources, and even navigating the game world are completely different, and that affects pretty much every game mechanic.<\/p>\n<p>&#8220;I plan to expand this aspect of the game much more in the future, so most of the new game mechanics and features will focus on how the player interacts with the fourth dimension.&#8221;<\/p>\n<p>Mashpoe tried to launch 4D Miner last month and unfortunately was unsuccessful, but has accepted to continue Patreon development. Ultimately, it&#8217;s hard to say whether 4D Miner will be able to hold its own as a game or remain a curious tech demo too confusing in its own right.<\/p>\n<p>But I really want Mashpoe&#8217;s experiments to continue in 4D space. Let me just lay down quick, all these dimensional warps have been giving me a bit of a headache.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Humans are very good at finding their way around in three-dimensional space. After all, that&#8217;s how the real world works. <\/p>\n","protected":false},"author":1,"featured_media":1269,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1267"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1267"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1267\/revisions"}],"predecessor-version":[{"id":1627,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1267\/revisions\/1627"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1269"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1267"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1267"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1267"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}