{"id":1296,"date":"2022-06-19T20:48:23","date_gmt":"2022-06-19T20:48:23","guid":{"rendered":"https:\/\/minecraft101.site\/for-heart-and-brain-take-your-time-to-play\/"},"modified":"2022-06-19T20:48:23","modified_gmt":"2022-06-19T20:48:23","slug":"for-heart-and-brain-take-your-time-to-play","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/for-heart-and-brain-take-your-time-to-play\/","title":{"rendered":"For heart and brain &#8211; take your time to play"},"content":{"rendered":"<h2>For heart and brain &#8211; take your time to play<\/h2>\n<p>I&#8217;m just loving playing &#8220;Settlers of Catan&#8221; with my son Alexander.  You can find out why this is so good for him AND me here.  The countdown is on &#8211; tomorrow we&#8217;ll be gliding into the new year.  Of course, a lot of good resolutions will be formulated again for 2020 and in this sense I would like to contribute a personal recommendation: <b>Take more time to play!<\/b> With your friends, your family, but if possible also with (your) children.  In my webinars and lectures, I am repeatedly asked what meaningful gifts one should give children.  I&#8217;m happy to tell you that my nine-year-old son Alexander is really enjoying playing &#8220;The Settlers of Catan&#8221; at the moment.  Exactly, I mean the game of the year 1995. We both develop great ambitions and unfortunately I don&#8217;t have a chance against Alexander more and more often.  He rips me off with ease and still has a smile on his face.  Why does the game evergreen fascinate him?  Clearly &#8211; he loves being challenged right from the start, developing a strategy and implementing it profitably through skillful negotiation and the construction of roads and settlements.  Making plans, pursuing them, misleading myself, my wife and friends &#8211; that seems to give him great pleasure at all.  He also plays chess with passion or he continues to expand his Minecraft worlds on the computer.<\/p>\n<h3>Do mental somersaults again<\/h3>\n<p>Be that as it may, you can of course imagine that I like anything that stimulates our imagination.  It&#8217;s about mental activation for me, about getting involved in something, sinking into a problem, brooding.  Speaking of which: Do you know the brain teasers on my website www.unvergesslich.de\/gedaechtnistraining\/denksport Tasks\/ ?  There is a very important sentence there &#8211; even before you get down to business: Whether you come up with the solutions or not is of secondary importance.  Rather, it is crucial that you hit a few capricious thoughts.  Mental somersaults that you don&#8217;t do every day, because that&#8217;s the only way you can maintain your mental flexibility or even create new networks between your gray cells.  Just surf there and try your hand at the &#8220;fuse cord problem&#8221;, the famous &#8220;Einstein riddle&#8221; or the darn hourglasses.<\/p>\n<h3\/>\n<h3>&#8220;Play is fertilizer for the brain&#8221;<\/h3>\n<p>But stop!  Before you get started, I would like to give you something basic on the subject of “playing”.  Play is extremely important for human development.  In the animal world, too, research has long since clearly shown that the more playful a creature grows up, the more intelligent it is in a position to perform.  Professor Gerald Hüther, one of the most renowned neurobiologists in Germany, once formulated this beautiful sentence: &#8220;Playing is fertilizer for the brain and power feed for children&#8217;s souls.&#8221; The professor expressly does not speak of &#8220;pedagogically valuable games&#8221;.  On the contrary.  It&#8217;s supposed to be <b>NOT<\/b> be determined in advance what is to come out at the end.<\/p>\n<p>If you have children, you may have noticed that they don&#8217;t think much of being patronized.  Instructions or well-intentioned instructions are usually counterproductive.  Rather, it is about trying out something completely freely, discovering something, simulating a situation and gaining your own experiences.  Very important: Even what we think is meaningless usually makes sense.  Using the example of Alexander: he builds settlements in places that don&#8217;t seem very lucrative to me.  But two rounds later he has all the victory points in his hand.  So he tests his most diverse strategies, is open to everything and therefore learns new things extremely quickly.<\/p>\n<h3\/>\n<h3>Man in the flow: completely enraptured!<\/h3>\n<p>It is also clear that our gaming behavior changes with age.  Babies playfully discover themselves and their direct, tangible environment.  Everything is new to her, her brain absorbs every sensation almost automatically.  In the second year of life, children set goals in advance for the first time.  They want to build a tower or put their first puzzles together correctly.  As their imaginations flourish, building blocks suddenly become cell phones or, depending on their needs, bananas for their favorite monkey.  At the age of three to four, children no longer mainly play alone, they now want to get involved in role-playing games in daycare.  Father, mother, child says hello.  As soon as they start school, the rules of the game quickly become important.  Even the first graders understand that a game only works with clearly defined, specific specifications &#8211; if you cheat or just do what you want, you&#8217;re out.  He is perceived as annoying.<\/p>\n<p>What I find particularly fascinating about small children&#8217;s play is how much they can block out everything that is safely around them.  They live in the moment, immersed in their world, nothing can shake them.  They are in a kind of flow, i.e. in a state that was defined for us adults by bestselling author Mihály Csíkszentmihályi (&#8220;Flow &#8211; The Secret of Happiness&#8221;).  The emeritus professor of psychology did this in great detail &#8211; at this point it should only be said that we achieve a flow when we have a clear goal in mind.  When a task requires our full concentration, but it doesn&#8217;t over- or under-challenge us.  We are intrinsically motivated in the solution process and when we approach the solution step by step, satisfaction comes.  The crux of the flow, however, is that you can hardly reach it consciously.  Rather, he turns up unasked.  For mountaineers, researchers, athletes, artists or anyone who devotes himself completely to a topic.<\/p>\n<h3\/>\n<h3>Give your children time and treat them to boredom<\/h3>\n<p>Be that as it may, this newsletter originally dealt with the question of the best gift for children.  My answer is clear: Give your children time together!  Go with them to the construction site around the corner and observe what is happening.  Build a cave under the table or a tree house in the garden.  Set up a regular game afternoon with grandma and\/or grandpa.  Dare to take a climbing course, play football, go to the forest or to the swimming pool.  Just be there &#8211; but is not always available as soon as the little one is bored.  Boredom makes you creative.  No child sits around stupidly for more than 15 minutes and stares into space.<\/p>\n<p>Finally, I would like to quote Gerald Hüther again.  He says: “As initiators, parents and grandparents are very important.  Boredom is just as important.  It may not be funny to the adults at first because the children protest.  But when they are out of the defiant and complaining phase, the children&#8217;s brain starts to work on its own.  They then look for something to play with and that is precisely why children should sometimes get bored.”<\/p>\n<p>Now I don&#8217;t want to bore you any longer, but I wish you all the best for the new year from the bottom of my heart!  Slide in well and achieve all the goals you&#8217;ve set yourself.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For heart and brain &#8211; take your time to play I&#8217;m just loving playing &#8220;Settlers of Catan&#8221; with my son <\/p>\n","protected":false},"author":1,"featured_media":1297,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1296"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1296"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1296\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1297"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1296"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1296"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1296"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}