{"id":1309,"date":"2022-06-20T02:36:05","date_gmt":"2022-06-20T02:36:05","guid":{"rendered":"https:\/\/minecraft101.site\/3-year-anniversary-anniversaries-terraconia\/"},"modified":"2022-06-20T02:36:05","modified_gmt":"2022-06-20T02:36:05","slug":"3-year-anniversary-anniversaries-terraconia","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/3-year-anniversary-anniversaries-terraconia\/","title":{"rendered":"3 year anniversary &#8211; anniversaries &#8211; Terraconia"},"content":{"rendered":"<p>Hello everyone^^<\/p>\n<p>Since my 3 year anniversary is coming up today, I thought I would chat a little bit and tell you something about myself and the time I have already spent here, because who would have thought, I have quite a lot of time on Terra and in Ts spent <\/p>\n<p>When I joined this server here in 2019, I didn&#8217;t expect to be so excited that I would stay for so long (and most likely not).<\/p>\n<p>When I think about it now, to be honest, it only becomes clear to me how lucky I was to come across a server with such a community in which you feel so comfortable that you, even though you&#8217;ve never been on the PC before and actually didn&#8217;t play Minecraft, stays and touches almost nothing else but Minecraft for 3 years.<\/p>\n<p>But further in the story.<\/p>\n<p>After I went through the tutorial well, I came to my wonderful apartment in the city of Kusuo (which unfortunately is no longer active) and was very kindly received by the local officials and even persuaded to Ts.  And although I was a shy and very reserved girl back then, I even managed to talk to them a little bit.<\/p>\n<p>When I came back the next day, I even got my own GS and explored the farm world (which was still the old one back then and I admit it, I was pretty scared XD).<\/p>\n<p>For the following week I did almost nothing but play and meet new people and even became governor of Kusuo (yes, that went pretty fast when I think about it).<\/p>\n<p>In my early days I really got to know a lot of people, most of whom are now inactive.  I usually helped them with their tasks, helped build cities and really talked a lot in TS.  But some of these people are still active and I&#8217;m very happy that I still have a lot to do with them today and that I&#8217;ve chatted with them quite often.  So a big thank you to Joni_X and BeneEdgar who really put up with me almost from the beginning even though I can really be a pain in the ass.<\/p>\n<p>Eventually, as fate would have it, I left Kusuo as a Statti and many other friends of mine also became inactive, so I looked for new occupations, which were mostly random things in Bene&#8217;s cities.<\/p>\n<p>And then my time in the team began, first I started in the event team, which allowed me to meet many other great people and later I was even a supporter and since I was so active all this time anyway, I founded my first (and only) city Skyland which I still complete many projects to this day.<\/p>\n<p>After I was no longer in the team, I had also reached the point where I had played so much on Terra that I was hardly or not at all there for a few months but was still to be found in Ts.<\/p>\n<p>When the virus that must not be named at the beginning of 2021 made sure that I had a lot of home cooling, I probably had no choice but to continue playing and talking more than I already did and to continue all my projects.<\/p>\n<p>And if I&#8217;m being completely honest, there really isn&#8217;t anything more interesting.  I&#8217;m kind of involved and I guess I&#8217;m a household name to a lot of people, but I just play around and sometimes make a few comments of myself in global chat.<\/p>\n<p>So yeah, that&#8217;s probably my Terra story.<\/p>\n<p>But let&#8217;s be honest, there&#8217;s still a bit of kitsch missing, so if you don&#8217;t want to hear that, you can scroll all the way down XD<\/p>\n<p>First of all, I really want to say thank you to everyone.  To the whole community for accepting me straight away and giving me a chance to escape from my everyday life and just be someone else.  I want to say thank you to the whole team for letting me be a part of it and giving me such a warm welcome and for all giving so much to give us a great gaming experience and keep the peace.<\/p>\n<p>And I also want to thank all my found friends for always having an open ear for me, even though I&#8217;m a terrible gossip.  Thank you for showing me that I&#8217;m not as unlucky as I always think I am.<\/p>\n<p>So a big thank you to these people (I&#8217;m sorry if I forget someone but I&#8217;m just a clumsy) JojoEiskristall Nanocrafter02 DoctorHenry snaax_ Kingcla JONIGUS Bananaman19 Trender_ Mulmiger Mr_Leroux XamLetsPlay Lavaherz<\/p>\n<p>I&#8217;ve met so many great people who have been playing for a long time (much longer than me XD) or who have just started with whom I&#8217;ve spent so much time.<\/p>\n<p>Many are still active so I do a lot with them and some are unfortunately inactive.  But on some days I also think back to the inactive ones or sometimes they even come online and then I&#8217;m always really happy.<\/p>\n<p>But most of all I would like to say thank you to whoever invented Terraship (or the word alone, my goodness, that&#8217;s really genius).  Because that, that&#8217;s probably by far the best thing that&#8217;s happened to me here.  Because a lot of people don&#8217;t even know it, but yeah, Bene and I really met on Terra and that&#8217;s how our long-lasting relationship came about, which I&#8217;m very proud of, by the way. <img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655692565_790_3-year-anniversary-anniversaries-Terraconia.png\" class=\"smiley\" alt=\"<3\" height=\"23\"  title=\"heart\"\/><\/p>\n<p>So we come to the end.<\/p>\n<p>Many, many thanks to really everyone for taking me in and still putting up with me and feeling really cuddled.<\/p>\n<p>I really hope that I can continue playing here for a long time and have a lot of conversations.<\/p>\n<p>Take care everyone and we&#8217;ll see you in chat!<\/p>\n<p>LG Tamara <img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655692565_790_3-year-anniversary-anniversaries-Terraconia.png\" class=\"smiley\" alt=\"<3\" height=\"23\"  title=\"heart\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hello everyone^^ Since my 3 year anniversary is coming up today, I thought I would chat a little bit and <\/p>\n","protected":false},"author":1,"featured_media":1310,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1309"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1309"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1309\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1310"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1309"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1309"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1309"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}