{"id":1345,"date":"2022-06-20T20:22:57","date_gmt":"2022-06-20T20:22:57","guid":{"rendered":"https:\/\/minecraft101.site\/positive-and-negative-consequences-of-video-games\/"},"modified":"2022-06-22T16:11:25","modified_gmt":"2022-06-22T16:11:25","slug":"positive-and-negative-consequences-of-video-games","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/positive-and-negative-consequences-of-video-games\/","title":{"rendered":"Positive and negative consequences of video games"},"content":{"rendered":"<p>If you play killer games, you sometimes hit out with your fist or even a weapon in real life? Of course, this cannot be said in general. But many scientists have already dealt with the question of whether violent video games encourage players to behave more violently.<\/p>\n<p>The question of whether video games lead to aggressive behavior poses a problem for researchers. How do you measure aggressive behavior? It would be suboptimal for test subjects to attack each other in the laboratory, also from a legal and ethical point of view. Instead, one examines, for example, whether the subjects steal pens and chocolate from the laboratory or are willing to fill out an optional questionnaire. Even if law-breaking or violent games lead to lower prosocial behavior in these scenarios, the question arises as to how transferrable the results are.<\/p>\n<p>It is clear that violent games can &#8220;numb&#8221; their players. Violent gamers react to real images of violence with less physiological arousal than gamers who consume nonviolent games.<\/p>\n<h3>Associations = Aggressions?<\/h3>\n<p>One way to test whether a player is actually thinking “more aggressively” after a brutal game is to do word completion tasks. Words such as “explo_e” are presented to the subjects. Does the player insert an “r” for “explore” or a “d” for “explode”?<\/p>\n<p>In fact, several researchers have found that playing violent games makes &#8220;aggressive associations&#8221; more likely. But one cannot ignore the nature of the game. Cooperative playing leads to less aggressive associations than competitive or solo playing.<\/p>\n<h3>Emotional confusion after playing<\/h3>\n<p>Regardless, “aggressive associations” are not the same as aggressive feelings. Whether players feel worse, more hostile or more aggressive after a killer game is debatable. Some studies come to this conclusion, while others do not. It is conceivable that only a very small proportion of the population is susceptible to violence in video games, while the majority do not develop hostile feelings from violent games.<\/p>\n<p>Either way, neither aggressive associations nor negative or hostile feelings mean that a gamer is actually acting violently as a result of a video game. People who are generally violent may show their aggression after or during a video game, but this does not mean that the video game is the cause of the underlying violence. Another stimulus could just as well trigger a breakout.<\/p>\n<p>In general, research on video games is inconsistent and often has serious methodological limitations. General statements are therefore difficult. But the motivation for which someone plays, the meaning that this game has for the players, as well as the content and duration of play determine whether the positive or negative consequences outweigh the negative ones.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you play killer games, you sometimes hit out with your fist or even a weapon in real life? Of <\/p>\n","protected":false},"author":1,"featured_media":1346,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1345"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1345"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1345\/revisions"}],"predecessor-version":[{"id":1690,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1345\/revisions\/1690"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1346"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1345"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1345"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1345"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}