{"id":1379,"date":"2022-06-21T07:06:25","date_gmt":"2022-06-21T07:06:25","guid":{"rendered":"https:\/\/minecraft101.site\/herobrine-entity303-and-other-minecraft-myths\/"},"modified":"2022-06-21T07:06:25","modified_gmt":"2022-06-21T07:06:25","slug":"herobrine-entity303-and-other-minecraft-myths","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/herobrine-entity303-and-other-minecraft-myths\/","title":{"rendered":"Herobrine, Entity303 and other Minecraft myths"},"content":{"rendered":"<p>They have been around since the alpha phase of the Minecraft computer game: the Minecraft myths.  The most famous Minecraft myth is probably the Herobrine myth.  In this article, I want to clear up these myths for you.  For a myth, I even did a try of over an hour!  I hope you enjoy reading this post!<\/p>\n<h3>Myth 1: A desert well is always near a village.<\/h3>\n<p>If you explore the deserts in Minecraft closely, you can occasionally come across desert wells.  These are small structures made of sand with water on the bottom.  In fact, the desert well has nothing to do with villages.  Villages are not uncommon in Minecraft.  Therefore, it can happen by chance that a village is generated near a well.  However, that&#8217;s really just a coincidence!<\/p>\n<h3>Myth 2: Diamond ores are more often found near lava.<\/h3>\n<p>That&#8217;s not true either.  Players only often say that because diamonds are easier to see near lava (because it&#8217;s bright there) and are very easy to miss otherwise.<\/p>\n<h3>Myth 3: Mushrooms in a cave indicate mine shafts and dungeons.<\/h3>\n<p>That&#8217;s not true either.  Mushrooms are not related to dungeons and mines!  If mushrooms are ever really close to these structures, that&#8217;s just a coincidence!<\/p>\n<p>Well that was a gentle start, now let&#8217;s move on to the more mysterious and spooky myths.<\/p>\n<h3>Myth 4: Crosses in Minecraft don&#8217;t mean anything good!<\/h3>\n<p>If you look closely at the landscape of Minecraft, you will notice that crosses appear in the landscape from time to time.  This scares many.  But I can reassure you: The Minecraft worlds are randomly generated.  So far nothing has been found in the source code that could indicate that these crosses are created on purpose.<\/p>\n<h3>Myth 5: Herobrine<\/h3>\n<p>Herobrine is probably the most famous Minecraft myth ever.  He was spotted in the alpha phase of the game and still causes a lot of excitement among players today.  I would now like to tell you about the first sighting of Herobrine.  I&#8217;m going to tell it in &#8220;I&#8221; form, that is, from the point of view of the first player who saw Herobrine, but I don&#8217;t mean me!  Also, this narration is not literally the same as the witness&#8217;s, as I am writing the whole thing in my own words.  Formulations may vary, but the content is identical.<\/p>\n<p>&#8220;Recently I created a new Minecraft world in single player mode. Since my computer is not very powerful, I set the view range to &#8220;low&#8221;. I started cutting down trees until I saw a mysterious figure in the thick fog. &#8220;It looked like the standard character, but it didn&#8217;t have any pupils. I wanted to approach the character so I could examine it more closely. However, it&#8217;s gone. I immediately checked to make sure I wasn&#8217;t unlucky enough to end up in multiplayer, but it was it wasn&#8217;t me. As I continued to explore the world, I noticed perfect sand pyramids, tunnels with redstone torches, and trees with no leaves. Of one thing I was certain: no world generator could do that. I saved my game and the Minecraft forum visited. I started a post by asking other players if they saw the shape too. My post was resolved within  album deleted by a few minutes.  So I opened another post.  This was deleted even faster.  Suddenly I got a message from a certain user named &#8220;Herobrine&#8221;.  It read: &#8220;Stop!&#8221;  Just a short time later another message arrived, this time from another user.  He said he had more information but preferred to communicate with me via email as it would be more secure.  After exchanging our contact details, the user told me that he too had seen this figure and knew people who felt the same way.  A few days later I received another message from my email contact.  They informed me that some people looked up the name &#8220;Herobrine&#8221; and found out that this name is used by a Swedish hacker.  It is also said to be Notch&#8217;s brother (Notch is the inventor of Minecraft).  So I contacted Notch and asked him about his brother.  It took a while, but then I got an answer from him: &#8220;I once had a brother, but he is no longer with us.&#8221;  Since then I have never seen the enigmatic figure again.  Luckily I was quick to screenshot the first encounter, so I have a proof image.&#8221; &#8211; The First to See Herobrine (Retold by LuckiGamer)<\/p>\n<p>In the evidence photo, Herobrine can be seen in the fog.  Many believe the picture, many say it&#8217;s a fake.  I wanted to know more about that.  While researching the internet, I found out that there is a ritual that can be used to summon Herobrine.  In an attempt I imitated this ritual.  I have summarized the exact test and the result here in the form of a test protocol.<\/p>\n<p><strong>test protocol<\/strong><\/p>\n<p><strong>Trial question:<\/strong> Does Herobrine really exist?<\/p>\n<p><strong>Assumption\/Hypothesis: <\/strong>My guess is that Herobrine doesn&#8217;t exist as it hasn&#8217;t been found in the source code yet.<\/p>\n<p><strong>material<\/strong>l: Of course Minecraft, in Minecraft:<\/p>\n<ul>\n<li>a best new world<\/li>\n<li>9 gold blocks<\/li>\n<li>1 quarry stone or 1 soul sand (you can choose)<\/li>\n<li>1 nether rack<\/li>\n<li>1 lighter<\/li>\n<li>4 Redstone Torches<\/li>\n<li>(possibly a record player with record 11)<\/li>\n<\/ul>\n<p><strong>Experimental setup:<\/strong> Build a 3*3 area out of gold blocks and replace the middle block with quarry stone\/soul sand (so you actually only need 8 gold blocks, but it&#8217;s easier to explain this way ) Netherrack is now placed on the quarry stone\/soul sand.  The 4 redstone torches are now placed on the corner blocks of the gold surface.  Once this is done, the netherrack is ignited with the lighter.  The ritual is now complete!  According to some players, you have to place a record player on a gold block that has no other block placed on top of it and insert the record 11 into it.  You may even have to jump into the fire (which is why the ritual isn&#8217;t suitable for hardcore mode, where you don&#8217;t respawn after death <img alt=\"laugh\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/Herobrine-Entity303-and-other-Minecraft-myths.png\"\/>)!<\/p>\n<p><strong>Test execution:<\/strong> Now that the ritual has been performed, you have to explore the world for at least an hour and look around to see if Herobrine is anywhere.<\/p>\n<p><strong>Trial observation:<\/strong> I didn&#8217;t notice anything strange.  Everything was as usual.<\/p>\n<p><strong>test evaluation:<\/strong> Herobrine seems to be a myth.  There are no signs to prove its existence.<\/p>\n<p>Many Minecraft players have asked Notch about Herobrine, and Notch denies that he has a brother.  But Notch also said that Herobrine could be in Minecraft at some point&#8230; <img alt=\"nod\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655795185_684_Herobrine-Entity303-and-other-Minecraft-myths.png\"\/><\/p>\n<h3>Myth 6: Entity303<\/h3>\n<p>Entity303 is the new Herobrine.  According to reports, he is said to attack other players (which Herobrine is also supposed to do, by the way) and always write the words &#8220;Make a wish&#8221; in the chat, which could be interpreted as &#8220;Wünsche dir something&#8221; in German.  This Minecraft character wears a white suit, has an all-black face, and has red eyes.  Entity303 is said to be a former Mojang employee (Mojang is the development studio behind Minecraft) who was fired from Notch and now wants revenge by hacking into the game.  According to some sources, Entity303 can be in one of your worlds if you have files on your computer that contain the number 303.  You can look for 303 in the search bar in Explorer. <strong>But does not delete any files that are displayed in the search results!  The number 303 could also just be in the file by accident!  If you delete files just like that, you can even damage your system!<\/strong> However, it can be assumed that this is not true either, just like with Herobrine.<\/p>\n<p>Those were all known Minecraft myths.  As you have seen, one cannot always believe everything.  I wish you all a nice day!  See you soon!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>They have been around since the alpha phase of the Minecraft computer game: the Minecraft myths. The most famous Minecraft <\/p>\n","protected":false},"author":1,"featured_media":1382,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1379"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1379"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1379\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1382"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1379"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1379"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1379"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}