{"id":1385,"date":"2022-06-21T08:53:34","date_gmt":"2022-06-21T08:53:34","guid":{"rendered":"https:\/\/minecraft101.site\/what-is-minecraft-for-you\/"},"modified":"2022-06-21T08:53:34","modified_gmt":"2022-06-21T08:53:34","slug":"what-is-minecraft-for-you","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/what-is-minecraft-for-you\/","title":{"rendered":"What is Minecraft for you?"},"content":{"rendered":"<p>I kind of miss that simple base game.  I&#8217;m also missing the overview of what&#8217;s being added to Minecraft and what&#8217;s not.  Whether something is planned for the distant future or will be interpreted soon.<\/p>\n<p>And then there&#8217;s Microsoft, which is almost outrageously monetizing its Minecraft Bedrock Edition, Minecraft Earth and Minecraft Dungeons (the &#8220;bad&#8221; successor to Story Mode).<br \/>All of a sudden, the former Pocket Edition also has in-app purchases, etc. I just think it&#8217;s a shame that Minecraft is becoming a mass product for little kiddies, whose parents then literally have the money taken out of their pockets.  I even know people who didn&#8217;t even know about the Java Edition until I told them about it.<br \/>I just have the feeling that the Bedrock Edition, which is developed exclusively by Microsoft, should represent the new and exclusive Minecraft and the Java Edition, which was only called Minecraft until 1.11, at some point when the community loses interest in it Microsoft is swept under the rug.<br \/>Another example of all this is Realms Plus.  Should Minecraft get privileges for the rich or even become one?<br \/>I myself am not at all a fan of temptations that are ultimately just an unloving source of money for the owners.  All of a sudden, funny Easter eggs disappeared from the Java Edition (examples are: Searge says or the Secret Settings button).<br \/>I think this is what Microsoft would say about their captured game if you get bored with it:<br \/>&#8220;If you want to have a really great Minecraft experience, it&#8217;s best to buy the very latest computer\/game console\/smartphone (Microsoft devices such as the XBOX ONE or a MICROSOFT SURFACE are recommended). Get it Then you get the Minecraft Bedrock Edition along with the Premium Package and it would be good to put the ultimate Minecraft Realms Plus in your shopping cart for the multiplayer and if the maps are not enough for you, there is also the Minecraft Marketplace for which you can get 1000 M- Got coins as a gift. We put together &#8220;a few&#8221; skin packages for you there. If you &#8220;don&#8217;t have any more M-Coins, you can get some in the Microsoft Store.&#8221;<br \/>The demo version of the Bedrock Edition is often pre-installed on PCs with Windows 10.<br \/>It is best to rename the Bedrock Edition to &#8220;Microsoft(R) Minecraft(R)&#8221; right away.<br \/>I don&#8217;t know if the sale to EA would have had similar or even &#8220;worse&#8221; consequences.<\/p>\n<p>So much for buying Minecraft from Microsoft.  Now I want to dedicate myself to the Minecraft Java Edition itself and give my opinion on which innovations I find good, bad or superfluous since 1.9.<br \/>First of all, I have the feeling that Mojang has been working on Minecraft far too superficially since 1.12 and is building far too many levels of functions while the foundation is already at its breaking point.<br \/>In my opinion, Minecraft has improved all the biome updates and items like the Elytra.  All the new blocks like concrete and scaffolding, where things like seaweed and seaweed didn&#8217;t need animaion.<br \/>But the llamas, polar bears and pandas or foxes, ice walkers and desert zombies have not essentially enriched Minecraft.  All the new AIs are much too &#8220;big&#8221;.  Instead, many of these mobs could have simply been merged with the meta (which was &#8220;stupidly&#8221; removed, which also annoys me) and the NBT data.  The new textures could almost have been left out, in my opinion they destroy the recognition feature of vanilla Minecraft a little.  Of course Minecraft should look more realistic, but then I would have further expanded the support for shaders and not let them disappear from the game again.<br \/>Mojang could actually learn a lot from OptiFine or at least join forces with their developers.  Although I could imagine that the cloaks from Optifine don&#8217;t exactly promote such a cooperation.  Basically, I always play with Optifine because you can just make a lot more adjustments with it.<br \/>Minecraft is increasingly becoming an easy-to-use game rather than a sandbox game where you have to experiment before you understand how something works.  Rather, you don&#8217;t even need to understand how something works, because you are left with no other option than the standard.  Since 1.13 you can set much less on the world generator.<br \/>In 1.12 I always had fun tweaking the world settings and, for example, having an abundance of slides because the ore veins could be influenced by their size and height.<\/p>\n<p>In general, I like a lot of the changes in Minecraft, but there&#8217;s just as much that Mojang could do better.  Because only a compact game remains clear so that you don&#8217;t lose yourself.  Nevertheless, it must remain diverse and something must be added with each update.  Because just like many others, Minecraft was really boring for me between 1.8 and 1.9.  So without new features, the game is literally on hold.<br \/>As long as Minecraft runs smoothly and it doesn&#8217;t get too monotonous, it will remain my favorite computer game from everyday life, to which I am loyal.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I kind of miss that simple base game. I&#8217;m also missing the overview of what&#8217;s being added to Minecraft and <\/p>\n","protected":false},"author":1,"featured_media":498,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1385"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1385"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1385\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/498"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1385"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1385"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1385"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}