{"id":1425,"date":"2022-06-21T21:20:20","date_gmt":"2022-06-21T21:20:20","guid":{"rendered":"https:\/\/minecraft101.site\/a-journey-to-the-end-of-the-minecraft-world-minecraft-games\/"},"modified":"2022-06-21T21:20:20","modified_gmt":"2022-06-21T21:20:20","slug":"a-journey-to-the-end-of-the-minecraft-world-minecraft-games","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/a-journey-to-the-end-of-the-minecraft-world-minecraft-games\/","title":{"rendered":"A Journey to the End of the Minecraft World › Minecraft Games"},"content":{"rendered":"<p><\/p>\n<p class=\"meta hidden-xs\">    01\/28\/14 News, Videos Bohn comments<\/p>\n<p class=\"meta visible-xs\">    01\/28\/14<\/p>\n<p class=\"lead\">A Minecraft fan set out about three years ago to find the far end of the block world.  He is driven by a statement made at the time by Markus &#8220;Notch&#8221; Persson, the inventor of the game.  Has he already reached the end?<\/p>\n<h3>Minecraft&#8217;s Far Lands<\/h3>\n<p>In January 2012, the PC version of Minecraft (German edition) saw the light of day.  The game hit like a bomb and the success continues to this day.  One reason for the popularity in the community is the apparent infinity of the game world.  Blocks as far as the eye can see.  But it&#8217;s not as endless as the virtual world seems.  This was also confirmed by Notch, who explained in a blog post in early March 2011 that the Minecraft world is coming to an end.  He called the areas &#8220;Far lands&#8221;.  If someone finds these areas, the entire game slows down and wild formations and landscape features appear that are not found anywhere else.  Notch added that while the state of the ending could be fixed, he liked the idea of ​​an almost unreachable and mysterious world far away.  So he wants to keep it that way.  And by noting that it&#8217;s almost impossible for players to reach the ending, one fan came up with a very special idea.  He wants to see the map &#8220;disintegrating&#8221; at the end of a game world with his own eyes!<\/p>\n<h3>The never-ending Minecraft journey<\/h3>\n<p>As a result, player Kurt J. Mac set out on March 28, 2011 to scour the endless expanses of the block world and finally to reach the goal of all goals: the actual end!  The calculation error in the game is described in the Minecraft Wiki, which creates the previously unexplored ending.  It states that the distance from the center of a map to the edge is 12,520,820 meters on the scale referenced in a Minecraft generated world.  The wiki also calculated that it takes around 800 to 900 hours to finish.<\/p>\n<p>Although the far lands problem was removed in beta version 1.8, those who are still playing with the old version can still find these areas today.  In theory, of course.  Because so far only one person came up with the idea of ​​actually wanting to find the end.  Mac is still playing in Minecraft Beta Version 1.7.3 today.<\/p>\n<p>&#13;<br \/>\n     &#13;<br \/>\n&#13;<br \/>\n     &#13;<\/p>\n<p>According to Mac, he has already come across some mysterious things that caused image errors and are apparently solved by the handling.  Are these the first signs that he is getting closer to his goal?  If you want to be there when Kurt J. Mac reaches his long-awaited end, be sure to check farlandorbust.com regularly.  Click here to go directly to his YouTube channel!  Of course we watched the current episode of &#8220;Minecraft Far Lands or Bust&#8221;, which was published just yesterday, and included it here.  The gamer is on the move with his virtual companion &#8220;Wolfie&#8221;, a loyal dog who is always at his side;  ).  Check it out and be a part of Mac&#8217;s great adventure.<\/p>\n<p>Click the button below to load the content of .<\/p>\n<p>load content<\/p>\n<p><h3>About the author: Bohn<\/h3>\n<p>\t\t\t\t\t\t\tI&#8217;m Ralf, also known as &#8220;bohncraft&#8221; in Minecraft.  Minecraft is my adult Lego.  Here I can let off steam and forget everything else.  Because the game fascinates me so much, I started this magazine in early 2012.\t\t\t\t\t\t\t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>01\/28\/14 News, Videos Bohn comments 01\/28\/14 A Minecraft fan set out about three years ago to find the far end <\/p>\n","protected":false},"author":1,"featured_media":1426,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1425"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1425"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1425\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1426"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1425"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1425"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1425"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}