{"id":1462,"date":"2022-06-22T07:20:18","date_gmt":"2022-06-22T07:20:18","guid":{"rendered":"https:\/\/minecraft101.site\/10-creepy-minecraft-myths-that-might-be-true-selfesteem\/"},"modified":"2022-06-22T16:12:55","modified_gmt":"2022-06-22T16:12:55","slug":"10-creepy-minecraft-myths-that-might-be-true-selfesteem","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/10-creepy-minecraft-myths-that-might-be-true-selfesteem\/","title":{"rendered":"10 Creepy Minecraft Myths That Might Be True"},"content":{"rendered":"<p>The block game, which is a bit reminiscent of Lego, has been very popular for several years.  Hardly any game was bought as often as the sandbox game.  But even in a beautiful world where you can do whatever you want, not everything is always rosy and beautiful.  For that reason, here are 10 creepy Minecraft myths that might be true.<\/p>\n<h2>Herobrine<\/h2>\n<p>Of course, this myth should not be missing from this list and belongs right at the top.  Herobrine is considered one of the most exciting and most discussed myths in the entire gaming world.  The legend revolves around the character Herobrine, but what exactly is Herobrine?<\/p>\n<p>Herobrine is a creature that looks very similar to the original player character, Steve.  In addition to Steve&#8217;s normal appearance, Herobrine has glowing white eyes.<\/p>\n<p>There are almost more legends about the character Herobrine than zombies in a cave.  For example, he should be able to kill the player in one hit despite the best armor.  In other theories he is said to be the devil and in some even the god of this world who is enraged by your presence.<\/p>\n<p>But no matter where it comes from or what exactly it is, beware if your mirror suddenly speaks to you.<\/p>\n<h2>Entity 303<\/h2>\n<p>This creature is often thought of as Herobrine&#8217;s little brother.  Like Herobrine, he is said to have the character of a player.  This time, however, he doesn&#8217;t look like Steve.  He wears a white suit and has an all-black face.<\/p>\n<p>But where does this creepy creature come from?<\/p>\n<p>According to the legends, Entity 303 is a former Mojang employee.  According to legend, after being fired from Notch a few years ago, he now wants revenge on his game.<\/p>\n<p>His abilities are said to be very similar to Herobrine&#8217;s.<\/p>\n<p>However, the scariest thing about this creature is that it will spam your chat before and while it appears.  In your chat you can then read the line &#8220;Make a wish&#8221; again and again.  This sentence is rumored to allude to the horror film Wish Upon, in which every wish has deadly consequences.<\/p>\n<p>Entity 303 may also have deadly consequences for you or your character.<\/p>\n<h2>A cross does not mean anything good<\/h2>\n<p>This theory is more or less about building your world in the game.  According to this legend, some parts of your beautiful world are said to be more dangerous than others.<\/p>\n<p>Whenever part of the landscape is a cross, it may not be the best place for you to stay.  The wildest fan theories say that there are more monsters waiting for you there.  In addition, there should also be other monsters like ghosts and traps should be waiting for you on every corner.<\/p>\n<p>So it is better to take a good look at your building plot before this cross represents your tombstone.<\/p>\n<h2>The mad professor<\/h2>\n<p>As an experienced Minecraft player, it has probably happened to you hundreds of times.  You&#8217;re standing comfortably in a mine, knocking your diamonds out of the wall and suddenly it starts hissing behind you.  In most cases, this is the moment when you already know that all your previous efforts have been in vain.<\/p>\n<p>We&#8217;re talking about the creepers.  Those horrid creatures that sneak up behind you and blow up in a matter of seconds.  But where do these green spoilsports come from?<\/p>\n<p>After all, most of the other monsters, such as zombies, skeletons, and giant spiders, still have reasonable explanations.<\/p>\n<p>According to a fan theory, there is an enemy in Minecraft who is usually called &#8220;The Mad Prof.&#8221; within this legend.  He&#8217;s supposed to spend every day in his lab growing these walking explosive traps.<\/p>\n<p>Even if no player has ever seen this professor, this assumption cannot be completely ruled out.  It may be found where there is a lot of sand.  After all, he needs a TNT block for every creeper.<\/p>\n<h2>The last disc<\/h2>\n<p>This theory is also based on Herobrine&#8217;s theory.  It should be possible to find a very specific record within the game.<\/p>\n<p>This record is designed to play the same tune that you hear when Herobrine walks towards you.<\/p>\n<p>By the way, Herobrine should feel insulted by playing this record and start hunting you very soon.  So find better other music before you have to pay with your life for your last song.<\/p>\n<h2>Steve is an experiment<\/h2>\n<p>As the friendly and well-disposed Steve, we make the block world unsafe right from the start.  We chop down trees with the edge of our hands, break the necks of cows with three or four blows, and can burn for up to a minute without dying.<\/p>\n<p>All in all, that doesn&#8217;t sound human at all.  Also, he seems to be the only human who can move freely throughout the game.  The movements of the other people always look like this (warning bad joke) pre-programmed.<\/p>\n<p>But how is it that Steve seems to be able to do much more than a normal person?  Is it the raw meat diet?  Or the constant brawls with zombies, creepers and skeletons?<\/p>\n<p>Many fans believe they have found the solution in their theory.  Steve should therefore not be a human, but a human-like being from an experiment.<\/p>\n<p>After the experiment, he is said to have been abandoned on a strange earth-like planet, where he is being observed by scientists and doctors to monitor his success and vital functions.  This theory also states that Steve doesn&#8217;t actually respawn, but rather a new version of himself is sent to the planet.  Quasi a Steve 2.0.<\/p>\n<p>The development studio has not yet commented on this theory, even if it would be a good explanation for the legend of Herobrine.  It could then be a failed experiment that eventually became malicious and developed a will of its own.<\/p>\n<h2>Atlantis, the Leviathan and the sea<\/h2>\n<p>As you explore your randomly generated world, you will eventually come across a large ocean.  According to some rumours, you can experience quite a bit there.  There are said to be ancient ruins of the sunken city of Atlantis.  These are guarded by the guards, who you have to hunt down before they finish you off.<\/p>\n<p>There is also said to be a hidden treasure chest, but it is guarded by a Leviathan.<\/p>\n<p>While there is no file in the Minecraft files that would suggest a Leviathan, Notch may have hidden it too well to keep the myth alive.<\/p>\n<p>However, underwater ruins that bear a certain resemblance to Atlantis have now been confirmed.  There you will also find chests that sometimes contain more and sometimes less valuable things.<\/p>\n<h2>Damage from another dimension<\/h2>\n<p>This situation has happened to many players.  You&#8217;re walking peacefully across a plain or a mountain and suddenly you&#8217;re getting damage from somewhere.  While it&#8217;s not much (around 1-2 hearts depending on armor), you can&#8217;t see where this damage is coming from.<\/p>\n<p>There was no thorn bush, no cactus and no hidden mobs were waiting for you anywhere.<\/p>\n<p>Various fans have already tried to find a logical explanation for this mystery.  They came up with the strangest ideas.  Except for the bores who just think it&#8217;s a bug, most fans assume it&#8217;s Herobrine or Entity 303.  They are supposed to jump out of another dimension, hit you and then immediately vanish into thin air.<\/p>\n<p>Other fans also suspect it&#8217;s an unknown enemy that&#8217;s even harder to beat than an Enderman.  No matter what it is, it can definitely become very dangerous and very frustrating when you end up running across the desert at your wits end and your last heart is shattered by such a blow.<\/p>\n<h2>Back to sea<\/h2>\n<p>For the penultimate spooky myth you have to go to the open sea again.  In addition to the already mentioned ruins, there are also monuments and monuments under water.  These are guarded by a guard.<\/p>\n<p>This guardian will not harm you, but he will definitely teach you to fear.  As soon as you venture near such a monument (about 50 blocks), a sudden jumpscare appears and you probably get wet.<\/p>\n<p>In addition, this guardian applies one of two curses that either slow you down or even completely stop you.  So he makes it very clear to you that you really have no business there.  But isn&#8217;t the temptation all the greater if there is an express ban?<\/p>\n<h2>The Abandoned Village<\/h2>\n<p>Villages in Minecraft have become more beautiful and diverse with each update since their introduction.  Be it the trading function with the residents or the opportunity to get some fruit and vegetables without having to grow them yourself.<\/p>\n<p>But there is also the perfect counterpart to this idyll.  We are talking about the abandoned villages.  Almost all clichés of a ghost town are served here without exception.  From destroyed houses, to spider webs on every corner, to traces of a sudden flight of the former inhabitants.<\/p>\n<p>After a short time in such a ghost village, however, you will find that not all residents have fled.  Some stayed behind and, well let&#8217;s call it, adapted to the circumstances.<\/p>\n<p>They became Zombie Villagers.  For this reason, extreme caution is required when you go in search of valuable resources in such a village.  After all, you never know who or what is behind you.<\/p>\n<p>Whether you want to face these ten myths and legends is up to you to decide.  Some of them may be true while others are most likely fictional.  Do you dare to find out which of these myths are true?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The block game, which is a bit reminiscent of Lego, has been very popular for several years. Hardly any game <\/p>\n","protected":false},"author":1,"featured_media":1463,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1462"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=1462"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1462\/revisions"}],"predecessor-version":[{"id":1707,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/1462\/revisions\/1707"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/1463"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=1462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=1462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=1462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}