{"id":197,"date":"2022-06-02T17:23:54","date_gmt":"2022-06-02T17:23:54","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-game-guide-nrw\/"},"modified":"2022-06-22T16:17:42","modified_gmt":"2022-06-22T16:17:42","slug":"minecraft-game-guide-nrw","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-game-guide-nrw\/","title":{"rendered":"Minecraft &#8211; game guide NRW"},"content":{"rendered":"<p style=\"text-align: justify;\"><strong>Game description: <\/strong><br \/>\nOur character starts in a world that consists exclusively of different blocks. These are always the same size (one cubic meter in relation to reality) and at first glance only differ in their colour. The game randomly generates an environment from innumerable blocks, which surprisingly always looks coherent and encourages exploration: barren deserts, mighty mountains, green meadows complete with cows and other animals &#8211; or sometimes an extensive ice region.<br \/>\nSo here we are and have no idea what to do, there is no help or explanation. However, we quickly find out that we can remove brown blocks of earth with our bare hands and also dissect trees into their angular parts. Everything we get hold of is collected in our inventory, which is basically the character&#8217;s backpack. If we now select the earth blocks found here, we can arrange them anywhere in the world and thus create new structures. We then make our first tools from the wood &#8211; a shovel for sand blocks, an ax for trees and a pickaxe for rocks. To do this, the components must be arranged in a certain way in the menu. The game does not reveal which shapes lead to which result. The only thing that helps is to try it out or look it up on the Internet (e.g. on Minecraftwiki.de).<br \/>\nThe consistently implemented, angular sun tells us the time of day, it&#8217;s evening &#8211; our attempts to walk have devoured the first day in no time. Now comes the tricky part of the otherwise peaceful Minecraft world: As soon as the sun goes down, monsters made of blocks come out of their hiding places and hunt down the player. In order to protect ourselves from them, we must find shelter. We either dig a cave into a mountain or we build a simple hut out of blocks of earth in an open area. It&#8217;s dark in the hiding place and we have to wait and see. Tomorrow we have to drive a tunnel into the mountain and look for blocks of coal, if we combine them with our wood, torches are created that also illuminate our accommodation at night. If we find enough wood, we can build a door. If we have enough stone for a furnace, we melt sand into it to make glass, which we use to make our windows. And if we dig deep enough, we might find iron to forge armor to protect ourselves from the creatures. But as we drive our tunnel into the mountain, we&#8217;re likely to come across underground rivers and lakes that we have to avoid or divert, encounter dangerous lava, or even new monsters lurking underground. Adventure awaits around every corner, hope for valuable materials, but also danger. The possible combinations of the materials are immense, the construction possibilities almost endless.<\/p>\n<p><strong>Pedagogical assessment:<\/strong><br \/>\nOld school in the here and now<br \/>\nFrom a technical point of view, Minecraft is anything but up-to-date, the graphics are not only outdated but old. The sound is simple, the menus are confusing. But you can ignore that when you have converted your first hut into a house, the house into a castle, the castle into a castle with a moat and so on and so forth. Minecraft doesn&#8217;t explain anything and pretends only a little, almost everything the player experiences here comes from his own imagination and creativity. The sandbox game can be played alone on the PC, but can also be played with several players over the Internet. The most sensible thing is to use the keyboard and mouse to control it. An Xbox version is also expected to appear at the end of the year. For this purpose, the developer will also optimize the menus for gamepads and possibly even use motion control with the Kinect camera, which is available as an optional accessory can be connected to the Xbox.<\/p>\n<p>Order is all of life<br \/>\nSince Minecraft doesn&#8217;t have a set goal, it&#8217;s up to you how much time you invest, but we quickly found that a new &#8220;project&#8221; &#8211; such as the new moat for our home &#8211; can quickly become a hog of hours. The situation is similar with the activity that gives the game its name (Minecraft: English mining trade), digging tunnels and building gigantic mine networks in order to find new and more valuable materials. These are needed to craft better tools. For example, we can&#8217;t dig tunnels as quickly with the wooden pickaxe as we can with a metal one. The path through the mountains is exciting and awakens the urge to explore, because you never know what&#8217;s hiding around the next corner in the randomly generated world. The contrast to the dark tunnels, which are only lit by torches, is the colorful upper world, where animals romp around during the day, and wolves can even be tamed by them. The cows serve as a supplier of leather and meat, the sheep can be shorn to process their wool. The motivation to play comes from goals that the player sets himself, such as: &#8220;I want to build a tower that reaches into the clouds&#8221;. That is possible. How the goal is reached is up to the player and requires planning. What building materials do I use? Where can I get these? Should the tower only serve a purpose or should it also be beautiful to look at? Do I only build safely during the day, or do I need weapons and armor to defend myself against the monsters? Where can I get these? But the more materials accumulate in the character&#8217;s inventory, the more difficult it becomes to find the right ones at the crucial moment. So it makes sense to create a storage room with chests in which the building materials, food, clothing and other found junk can be sorted and managed. If a project is to run properly, order is important.<\/p>\n<p>researchers and builders<br \/>\nEven if tidying up isn&#8217;t exactly one of them, despite its simple appearance, Minecraft combines many aspects that fascinate children: the player can be the master of his own four walls, which can be designed as he likes. A glass floor? A tree in the living room? A pig in the closet? No problem. The monsters, on the other hand, offer the incentive to defend themselves, to build better and more visually appealing weapons and armor in order to be able to assert themselves and prove themselves in the world. To do this, the player has to go exploring &#8211; exploring the game world is very appealing. However, if the character dies (e.g. if it is hit by a monster too many times, falls into an abyss or stays under water for too long), it will appear at a certain point (the so-called revive point) and the game can continue. However, all utensils and materials that were in the inventory are at the point where the character died and must be retrieved.<br \/>\nThe player is free to decide how big the desired projects are, so you can play Minecraft for half an hour in between, but there are also videos on the Internet of players who have recreated the spaceship Enterprise or landscapes from the Lord of the Rings books. In original size and each several hundred or even thousand working hours, which of course are extreme exceptions. Since the development game is stingy with explanations and can be used quite awkwardly at times, some familiarization is necessary, which makes it a bit bumpy for casual gamers to get started. But as soon as the basic mechanics of assembling and dismantling the blocks have been understood, the potential for fun and learning also unfolds for younger children, because a giant box of Lego is now available that can be rebuilt to your heart&#8217;s content. Depending on the drive, creative thinking, the development of solution strategies, organization and planning, as well as frustration tolerance can be encouraged.<\/p>\n<p>Minecraft is currently still in the so-called beta test phase (as of 2011), but can also be played online for a long time. The full version will be released on September 11th for 20 euros. Anyone who buys the game in the current beta stage pays 15 euros, but can already play and also receive the finished version. The important and helpful statement by the USK about an age rating can be missing for online games like Minecraft, here parents have to decide for themselves whether they consider the game suitable for their children. We provide an educational review to help and recommend Minecraft for children ages 6+.<\/p>\n<p><strong>Conclusion: <\/strong><br \/>\nMinecraft is a phenomenon: it tells no story, completely dispenses with explanations and, thanks to simple 3D graphics, looks terribly old-fashioned. Yet it&#8217;s fun, intriguing and limited only by the player&#8217;s own creativity &#8211; which offers many learning opportunities and makes it extremely popular with our tester groups. Due to the cumbersome controls, the confusing menus and the lack of help, the game has to be explained by an adult, especially to younger children, but then it is a modern Lego box for children and young people from the age of six. The monsters in the game world are sometimes a bit scary and especially when the game world is dark, they can frighten younger people, but on closer inspection the meanies are more funny than scary with their bodies built out of blocks.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Our project <strong>Gaming without limits<\/strong> tested Minecraft for accessibility. The result is here.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<p>Game description: Our character starts in a world that consists exclusively of different blocks. These are always the same size <\/p>\n","protected":false},"author":1,"featured_media":198,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/197"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=197"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/197\/revisions"}],"predecessor-version":[{"id":1767,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/197\/revisions\/1767"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/198"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}