{"id":199,"date":"2022-06-02T21:32:23","date_gmt":"2022-06-02T21:32:23","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-is-not-suitable-for-children-says-stiftung-warentest\/"},"modified":"2022-06-02T21:32:23","modified_gmt":"2022-06-02T21:32:23","slug":"minecraft-is-not-suitable-for-children-says-stiftung-warentest","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-is-not-suitable-for-children-says-stiftung-warentest\/","title":{"rendered":"Minecraft is not suitable for children, says Stiftung Warentest"},"content":{"rendered":"<p>&#8220;Anything but child-friendly&#8221; &#8211; This is how Stiftung Warentest judged 14 mobile phone games that they tested from the point of view of a ten-year-old.  Prominent titles such as Minecraft and Fortnite were also represented.\n<\/p>\n<p><\/p>\n<p>14 prominent game apps were put to the test by Stiftung Warentest.  However, the organization does not recommend any of them.  However, the reason is often not the game content itself. The main problems cited are a lack of data protection, a malicious community, inappropriate advertising and in-app purchases.  The terms and conditions are also very incomplete and not legally compliant.<\/p>\n<p>Popular games such as Minecraft, Fortnite, Clash of Clans and Candy Crush were tested.<\/p>\n<p>Stiftung Warentest complained that in many game lobbies there were players with racist nicknames and motives, and that there were sometimes links to sites with pornographic content.  She also criticizes the advertising strategies of the games.  Why do I get ads for 18+ games in a game rated for ages 0, 6, or 12?<\/p>\n<p>After all, the foundation sees it as a danger how expensive and sometimes simple the in-game purchases are.  Some games even rely on the fact that at a certain point in the game you can no longer progress without investing cash for rares.<\/p>\n<blockquote>\n<h2>Opinion of Johannes Repp<\/h2>\n<p><img class=\"lazyload\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/Minecraft-is-not-suitable-for-children-says-Stiftung-Warentest.png\" alt=\"\" title=\"\"\/><\/p>\n<p>That&#8217;s not new.  Everything that the Stiftung Warentest lists as defects is actually old hat, they have been known for years.  Even if the applicable law is violated here, the responsible authorities are overwhelmed by the daily flood of games.  However, I have a problem with the fact that Stiftung Warentest presents the games per se as endangering children.  The games themselves are child-friendly.  All the trappings of microtransactions and a toxic community is the main issue here.  Data protection is also in need of revision.  However, games like Minecraft can be classified as educational because they encourage creativity and spatial thinking.  Fortnite contributes to tactical thinking and better group dynamics.<\/p>\n<p>The test deliberately puts the games in a bad light without going into the core of the game content.  Therefore, a reader could draw the wrong conclusion from keeping the game completely from the child.  I think clarification is the key here.  Children must learn to deal with the Internet and its dangers correctly and not be shielded from them.  In their article, our colleagues from the familie.de editorial team give tips on how to develop better media skills in children.  Purchases can be blocked, relevant servers avoided.  The child must be taught how to identify and deal with the dangers.  This is the only way to pave the way to safe surfing.<\/p>\n<\/blockquote>\n<p>  Don&#8217;t want to miss any more news about technology, games and pop culture?  No current tests and guides?  Then follow us on Facebook (GIGA Tech, GIGA Games) or Twitter (GIGA Tech, GIGA Games).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Anything but child-friendly&#8221; &#8211; This is how Stiftung Warentest judged 14 mobile phone games that they tested from the point <\/p>\n","protected":false},"author":1,"featured_media":202,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/199"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=199"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/199\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/202"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=199"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}