{"id":220,"date":"2022-06-03T01:26:42","date_gmt":"2022-06-03T01:26:42","guid":{"rendered":"https:\/\/minecraft101.site\/my-child-is-playing-minecraft-explanation-for-parents\/"},"modified":"2022-06-22T16:17:53","modified_gmt":"2022-06-22T16:17:53","slug":"my-child-is-playing-minecraft-explanation-for-parents","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/my-child-is-playing-minecraft-explanation-for-parents\/","title":{"rendered":"My child is playing Minecraft &#8211; Explanation for parents"},"content":{"rendered":"<p><img class=\"entry-thumb td-modal-image\" title=\"Minecraft\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/My-child-is-playing-Minecraft-Explanation-for-parents.jpg\" alt=\"what parents should know about Minecraft\" width=\"696\" height=\"392\" \/><\/p>\n<h3>content of the game<\/h3>\n<p>Minecraft is a strategy game for various platforms (PC, smartphone, etc.) that takes place in an open world. It is played from the point of view of the main character. The game does not give the player a fixed game goal, so that the player can develop his ideas freely. The game resembles a kind of &#8220;construction kit&#8221; in which the player changes his environment. Materials such as wood, stone, etc. are mined in different game modes (survival mode, creative mode, etc.) to build building projects such as palaces, houses and castles. Minecraft differs greatly from other successful games of the present due to the very simple, functional graphics and the simple gameplay.<\/p>\n<h3>history and sales<\/h3>\n<p>The game Minecraft has now been sold over 140 million times worldwide (as of November 2018) and is therefore one of the most successful and popular games of the present. The game was programmed in 2009 by a Swedish developer within just 6 days. The software company Microsoft secured the rights to Minecraft in 2014 for 2.5 billion dollars by buying up the development studio “Mojang”.<\/p>\n<h3>Explanatory video for parents<\/h3>\n<p><iframe title=\"Minecraft - Für Eltern erklärt (Vorstellung-Erklärung was ist Minecraft)\" width=\"1140\" height=\"641\" src=\"https:\/\/www.youtube.com\/embed\/y1xgZPaqp6A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<h3>Why are children and young people so fascinated by it?<\/h3>\n<p>Minecraft serves a very original need of children &#8211; building. Male children and young people in particular enjoy the great creative freedom that the virtual &#8220;kit&#8221; Minecraft brings with it. In contrast to Lego and comparable kit toys, the player has a potentially infinite number of components. In contrast to Lego, the player&#8217;s works do not have to be destroyed in favor of new projects, but remain stored virtually. With Minecraft it is also possible to build a project with several friends at the same time over the Internet and to have adventures.<\/p>\n<p><img class=\"wp-image-3533 size-full\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654219592_14_My-child-is-playing-Minecraft-Explanation-for-parents.jpg\" alt=\"Minecraft for kids?\" width=\"924\" height=\"546\" \/>Minecraft allows the player to construct such imposing buildings. That&#8217;s where every Lego kit comes up against its limits.<\/p>\n<h3>The possible psychological impact of Minecraft on children<\/h3>\n<p><strong>Opportunities:<\/strong> To put it simply, there are &#8220;dumber games&#8221; than Minecraft. The game intensity (stress and hectic pace) is comparably low. Spatial and planning thinking is promoted. Players can learn teamwork and develop their creative ideas. The graphics, which are kept simple, allow room for imagination and are designed to be rather “unstimulating”.<\/p>\n<p><strong>Driven:<\/strong> The psychological danger of this game is that players can get lost in the game very quickly. In contrast to Lego or building blocks, fine motor skills are trained much less. In contrast to the physical game, the player is not mentally in the here and now, but directs his entire concentration into the virtual world.<\/p>\n<h3>parenting tips<\/h3>\n<ol>\n<li>Many parents are not very differentiated when it comes to video game consumption. Minecraft has many advantages: it can promote qualities such as spatial thinking, creativity and teamwork. In addition, it is adult-free and does not use violent content. Don&#8217;t do your child an injustice by depreciating the relatively intelligent game, but appreciate that your child is playing a &#8220;good game&#8221;.<\/li>\n<li>Be mindful of how much time your child spends playing. Younger children in particular lose all sense of time in video games. Set time limits and enforce them &#8211; even if it&#8217;s exhausting. In contrast to older teenagers, children find it very difficult to set their own limits due to their brain development.<\/li>\n<li>Try to meet your child&#8217;s need to &#8220;build&#8221;. Provide him with physical game materials. Build with your child.<\/li>\n<li>Take an interest in your child&#8217;s virtual activity. Build a work from Minecraft with Lego and take your time!<\/li>\n<li style=\"text-align: left;\">There are special Minecraft Legos that can help your child to implement their basic need to build away from the screen.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>content of the game Minecraft is a strategy game for various platforms (PC, smartphone, etc.) that takes place in an <\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/220"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=220"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/220\/revisions"}],"predecessor-version":[{"id":1768,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/220\/revisions\/1768"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=220"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=220"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=220"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}