{"id":224,"date":"2022-06-03T03:00:55","date_gmt":"2022-06-03T03:00:55","guid":{"rendered":"https:\/\/minecraft101.site\/how-dangerous-is-minecraft-wireltern-ch\/"},"modified":"2022-06-22T16:18:00","modified_gmt":"2022-06-22T16:18:00","slug":"how-dangerous-is-minecraft-wireltern-ch","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/how-dangerous-is-minecraft-wireltern-ch\/","title":{"rendered":"How dangerous is Minecraft?"},"content":{"rendered":"<p>After eight days of uncertainty, a German special task force, at the request of the Swiss investigators, freed the Solothurn primary school student Paul from an apartment in Düsseldorf.  This belongs to a 35-year-old man who had contacted the 12-year-old, who lives in Gunzgen, via a chat on the internet game Minecraft.  The Solothurn criminal police reported this on Sunday afternoon.<\/p>\n<p>The question comes to the fore: how dangerous are internet games for children?  And how should parents react when their children want to play them?<\/p>\n<p><strong>Solothurn student Paul (12) was lured into a chat in the Internet game Minecraft and then kidnapped.  The police freed him on Saturday in Düsseldorf.  How can this be prevented?<\/strong><\/p>\n<p><strong>Laurent Sedano:<\/strong> We still don&#8217;t know enough about this specific case to give an assessment.  Basically, however, it turns out that the contact between the parents and the child is crucial.  Parents should always know what their children are doing on the internet.<\/p>\n<p><strong>Isn&#8217;t that a bit too much of a control?<\/strong><\/p>\n<p>It&#8217;s not about control, it&#8217;s about contact.  At primary school age, parents should be left out when the child is playing internet games.  Parents should find out together with the children which functions a game offers and whether the child is mature enough to handle it.  For example, if it is clear that the game has no chat options, handling can also be relaxed.<\/p>\n<p><strong>Should primary school students not be allowed to chat?<\/strong><\/p>\n<p>If the chat allows contact with strangers, then it&#8217;s too early.  There is only one chat that I can recommend at this age and that is Zambo from the associated SRF show.  This chat is seriously controlled: It starts with access to the chat and does not stop with checking the chat histories.<\/p>\n<p><strong>Should parents generally ban their children from playing internet games like Minecraft?<\/strong><\/p>\n<p>It would be a reflex I don&#8217;t like.  It would be far better to sit down with the child, talk about the Paul case and ask, &#8220;Have you experienced something similar?&#8221;  Such cases are suitable for addressing dangers.  So the child can learn something.  Conversations about games shouldn&#8217;t just be about dangers, though.  Parents can also take the opportunity to learn more about their children&#8217;s games.  What do you enjoy?  What are they experiencing?<\/p>\n<p><strong>What do you think of Minecraft?<\/strong><\/p>\n<p>It&#8217;s a great game because it provides a great learning effect for the children.  It is one of the most popular games.  However, the integrated chat functions have dangers in store that children and parents must be aware of.<\/p>\n<p><strong>What needs to be considered?<\/strong><\/p>\n<p>We at Pro Juventute recommend the following rules:<\/p>\n<ul>\n<li>Never give out personal information without consulting your parents.<\/li>\n<li>Only use fantasy names in the chat and do not give any correct information about yourself.<\/li>\n<li>Only share webcam with people you know personally.<\/li>\n<li>Don&#8217;t give out personal secrets.<\/li>\n<li>If you feel strange or are being harassed, you should stop chatting immediately.<\/li>\n<li>Don&#8217;t believe everything that is said or written on the internet and talk to your parents or someone you trust about it.<\/li>\n<\/ul>\n<p><strong>How do you rate the prevention work of schools?<\/strong><\/p>\n<p>A lot is being done in the canton of Solothurn.  The cantonal police visit classes and talk to the children about the dangers of the internet.  However, different schools deal with the subject differently.  While some do it in an exemplary manner and enlighten, others find it difficult.  Media education is part of the new Curriculum 21, which also means that schools should deal with the dangers of the Internet and teach children how to use the Internet.<\/p>\n<p><strong>Is it enough to address the Internet danger?<\/strong><\/p>\n<p>Pro Juventute recommends that the cantons introduce regular media lessons in schools.  The regularity prevents the subject from falling between the chair and the bench.  It is extremely important that schools teach children how to use the internet, explaining the pros and cons and the dangers.  That supports her.  But it needs different actors, the parents, the school, school social work, youth counseling centers or the Pro Juventute emergency number 147.  But I think it&#8217;s just as important that the police, for example, discuss the topic with the children in the classroom.  That makes an impression.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After eight days of uncertainty, a German special task force, at the request of the Swiss investigators, freed the Solothurn <\/p>\n","protected":false},"author":1,"featured_media":225,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/224"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=224"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/224\/revisions"}],"predecessor-version":[{"id":1769,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/224\/revisions\/1769"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/225"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=224"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=224"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=224"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}