{"id":226,"date":"2022-06-03T03:59:25","date_gmt":"2022-06-03T03:59:25","guid":{"rendered":"https:\/\/minecraft101.site\/stiftung-warentest-minecraft-and-fortnite-for-children-unacceptable\/"},"modified":"2022-06-22T16:18:07","modified_gmt":"2022-06-22T16:18:07","slug":"stiftung-warentest-minecraft-and-fortnite-for-children-unacceptable","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/stiftung-warentest-minecraft-and-fortnite-for-children-unacceptable\/","title":{"rendered":"Stiftung Warentest: Minecraft and Fortnite for children &#8220;unacceptable&#8221;"},"content":{"rendered":"<p>Many mobile games have poor parental controls. Stiftung Warentest found this out in a test of 14 popular, mostly free mobile phone games (magazine &#8220;Test&#8221;, issue 10\/2019). According to the experts, none of the apps available for both Android and iOS, including titles like Minecraft and Fortnite, are recommended.<\/p>\n<p>Stiftung Warentest rates 13 out of 14 apps as &#8220;unacceptable&#8221;, only Pokémon Go gets the rating &#8220;questionable&#8221;. This is partly due to data protection, which according to the product test is not appropriate for any of the games. 10 of the 14 apps, including Minecraft and Fortnite, show very clear deficiencies in this area: they collect too much data or monitor users, want to access chat texts or voice messages. Some data protection declarations are not formulated in a child-friendly manner as required. Sometimes apps also transmit usage data when users switch off the so-called tracking.<\/p>\n<h3 id=\"nav_in_app_käufe__0\" class=\"subheading\">In-app purchases can cost money<\/h3>\n<p>Some of the in-app purchases, for example for digital accessories such as costumes for game characters, are not transparent. This could become a cost trap, especially for children. Hundreds of euros can be spent quickly, according to Stiftung Warentest. Many games directly or indirectly ask for a purchase &#8211; for example because the flow of the game can hardly continue without paid extras. In such cases, the experts advise blocking in-app purchases, for example with a password in the Google Play Store that the child does not know.<\/p>\n<p>At Apple, purchases can be deactivated under &#8220;Settings&#8221; in the &#8220;Screen Time&#8221; function. Not providing any payment details at all is most effective.<\/p>\n<h3 id=\"nav__quot_verstörend__1\" class=\"subheading\">&#8220;Disturbing Content&#8221;<\/h3>\n<p>The experts also found &#8220;disturbing content&#8221; in the games, which have recommended ages between 0 and 12 years. Anyone who goes online may encounter sexual, violent or extremist content in some titles. For example, when groups or individual players name themselves after porn sites or right-wing extremists give themselves player names.<\/p>\n<p>According to the product test, reporting such violations only works moderately in the tested apps. She recommends only letting the child play offline if the app allows it. This also prevents parents from spending money or chatting with strangers.<\/p>\n<p>In general, parents should better check all security settings that have been set up regularly, writes Warentest. The foundation advises keeping an eye on the children&#8217;s games and trying them out for yourself. This will help you form your own picture.<\/p>\n<p>Parents can get help with the search for suitable apps for children according to the information on the klick-tipps.net website. The website is supported by Jugendschutz.net, a federal and state competence center for the protection of children and young people on the Internet and the foundation&#8217;s cooperation partner for checking cell phone games. The video game test center USK is only responsible for games that appear on physical data carriers. Download titles and mobile games are often not submitted for review. Epic Games nevertheless submitted Fortnite in the summer – the USK released the game from the age of 12. (then)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many mobile games have poor parental controls. Stiftung Warentest found this out in a test of 14 popular, mostly free <\/p>\n","protected":false},"author":1,"featured_media":227,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/226"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=226"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/226\/revisions"}],"predecessor-version":[{"id":1770,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/226\/revisions\/1770"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/227"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=226"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=226"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=226"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}