{"id":238,"date":"2022-06-03T18:46:25","date_gmt":"2022-06-03T18:46:25","guid":{"rendered":"https:\/\/minecraft101.site\/how-do-i-protect-my-child-when-playing-online-games-like-minecraft\/"},"modified":"2022-06-03T18:46:25","modified_gmt":"2022-06-03T18:46:25","slug":"how-do-i-protect-my-child-when-playing-online-games-like-minecraft","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/how-do-i-protect-my-child-when-playing-online-games-like-minecraft\/","title":{"rendered":"How do I protect my child when playing online games like Minecraft?"},"content":{"rendered":"<p class=\"fw-bold\">Twelve-year-old Paul S. met his kidnapper through Minecraft.  Kristin Langer, media coach at &#8220;Schau hin!&#8221; explains how to protect your child when playing online games<\/p>\n<p class=\"text\">In Düsseldorf, the SEK stormed an apartment at the weekend where a Swiss boy who had been missing for eight days was found.  Paul S. met his kidnapper through an online game (&#8220;Minecraft&#8221;).  Parents are now asking themselves: Can this happen to my child too?  BZ sought advice from Kristin Langer, media coach for the “Look!  What your child does with Media.&#8221;:<\/p>\n<h3 class=\"text\">1. How can I protect my child from such situations?<\/h3>\n<p class=\"text\">First of all: The game &#8220;Minecraft&#8221; &#8211; a kind of digital Lego &#8211; is mostly harmless in itself, the entertainment software self-control has released it from the age of 6 years.  Advice sites such as the “Spieleratgeber-NRW” also recommend this age, although it depends very much on which mode you are playing.<\/p>\n<p class=\"text\">For the easy use of the game, it would be important for parents first of all to control that the child does not spend too much time in the virtual world and does not get lost in it.<\/p>\n<h3 class=\"text\">2. When does the game become dangerous?<\/h3>\n<p class=\"text\">The danger that opened up for Paul S. is only indirectly related to the game.  He met his kidnapper in a chat about the game.<\/p>\n<p class=\"text\">There are a number of risks for children lurking in chats.  Parents should pay close attention to who their children are in contact with.  And they should set clear rules according to which the child has to move around in these rooms.<\/p>\n<p class=\"text\">Very important: Children should not reveal too much about themselves and only use chat names that do not reveal anything about themselves, such as name or age.<\/p>\n<p class=\"text\">Explain to your child that they should be careful because you never know who is behind the nickname.  A 40-year-old criminal can hide behind a supposedly 13-year-old like-minded man.<\/p>\n<p class=\"text\">The disclosure of personal data and pictures as well as &#8220;real&#8221; meetings with chat partners without company are absolutely taboo.<\/p>\n<h3 class=\"text\">3. What is the correct way for parents to react when they suspect that the child has contacts that could become dangerous?<\/h3>\n<p class=\"text\">Important: Stay in touch with your child.  Parents should register for chats.  Sensitize the child to be suspicious, to stop awkward dialogues immediately, and to leave the chat.  In many chats there is an ignore function that hides troublemakers.<\/p>\n<p class=\"text\">In addition, many chat rooms have a help button that children should use.  It is important that parents document harassment with a screenshot and immediately report it to the chat operator and help their child process shocking experiences.<\/p>\n<p class=\"text\">To rule this out in advance, we generally recommend only using safe, protected surfing rooms that are accompanied by trained moderators.  Children should contact them as soon as they feel molested.  A list of such forums and more tips and advice can be found at www.schau-hin.info<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Twelve-year-old Paul S. met his kidnapper through Minecraft. Kristin Langer, media coach at &#8220;Schau hin!&#8221; explains how to protect your <\/p>\n","protected":false},"author":1,"featured_media":239,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/238"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=238"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/238\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/239"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=238"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=238"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=238"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}