{"id":240,"date":"2022-06-03T22:54:47","date_gmt":"2022-06-03T22:54:47","guid":{"rendered":"https:\/\/minecraft101.site\/10-things-parents-should-know\/"},"modified":"2022-06-03T22:54:47","modified_gmt":"2022-06-03T22:54:47","slug":"10-things-parents-should-know","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/10-things-parents-should-know\/","title":{"rendered":"10 things parents should know"},"content":{"rendered":"<p>Minecraft is a phenomenon.  It was first released for the PC in 2009, followed by the first console version on the Xbox 360 in 2012. The game is now available on almost all platforms, both stationary and mobile.  And for months it has been in the weekly top 10 best-selling games, and there are hundreds of videos about the game on YouTube.  In short: the kids love “Minecraft”!  But why actually?  Here are some basic things you should know about the game:<\/p>\n<p><strong>1. It&#8217;s like LEGO in digital form, but with infinite bricks and infinite space!<\/strong><\/p>\n<p>Have you ever wondered why &#8220;Minecraft&#8221; comes along with rather old-fashioned looking block graphics?  It&#8217;s the gameplay: All of these blocks are like building blocks.  The whole world of the game consists of it.  Even the water is made of blocks!  We can dismantle or add some and build buildings, for example.  The available resources are infinite.  So the player can create incredibly detailed worlds.<\/p>\n<p><\/p>\n<p id=\"caption-attachment-5800\" class=\"wp-caption-text\">Players can choose from a variety of building blocks to customize their world.  And who says there has to be only one house per player?  There is enough space for a terraced settlement!<\/p>\n<p><strong>2. The players have to act tactically and economize well.<\/strong><\/p>\n<p>&#8220;Minecraft&#8221; can have a very important learning effect on children &#8211; namely that of survival.  Ultimately, the aim of the game is to survive: the players build a house, craft weapons, collect food and thereby arm themselves for enemies that appear at night (the game has a day-night cycle).  So players need to turn their house into a fortress that protects them from these evil fiends and maybe even set up a sensible defense.  This requires not only fighting spirit, but above all good management.<\/p>\n<p><strong>3. In &#8220;Minecraft&#8221; you are not alone.<\/strong><\/p>\n<p>The Minecraft community is huge.  On the Internet, players exchange ideas, and not only about the game.  If you play online, you get to know other players.  This can result in friendships.<\/p>\n<p><strong>4. &#8220;Minecraft&#8221; is &#8220;what if&#8221; on the screen<\/strong><\/p>\n<p>Children love to make their own house out of oversized cardboard boxes and play with it.  Something very similar happens in Minecraft, the kids build their own world with a home.  However, in “Minecraft” there are no limits to the imagination.  If you want, you can build a meter-high tower or dig a sophisticated canal system in the ground.  If you look at videos on YouTube, you will see that many kids are extremely committed here.  At the end of the day, parents would probably prefer their kids to let their creative juices flow in a virtual world than just watch TV, right?<\/p>\n<p><img aria-describedby=\"caption-attachment-5803\" loading=\"lazy\" class=\"size-full wp-image-5803\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654296887_684_10-things-parents-should-know.jpg\" alt=\"Oops, there are monsters in the living room!  If you don't close your fortress, you'll get uninvited visitors.\" width=\"1000\" height=\"563\"  \/><\/p>\n<p id=\"caption-attachment-5803\" class=\"wp-caption-text\">Oops, there are monsters in the living room!  If you don&#8217;t close your fortress, you&#8217;ll get uninvited visitors.<\/p>\n<p><strong>5. There are numerous videos of the game on YouTube &#8211; many of them are how-to guides.<\/strong><\/p>\n<p>If you enter &#8220;Minecraft&#8221; on YouTube, you will get millions of hits.  Unbelievable.  The players tinker and share their experiences as much as they can.  But there are also clips showing how “Minecraft” works.  Kids can get information and be taught which tools they need or how they can collect valuable materials.  The children learn to look and listen carefully in order to follow the instructions.  Then they apply what they have learned to the game in their own way.<\/p>\n<p><strong>6. A universe that grows and grows.<\/strong><\/p>\n<p>Minecraft is not a game that is played through once and then left in the corner.  It always inspires to be rediscovered.  Above all, this is ensured by constant free updates that expand the game world.  After Microsoft bought the rights to the brand, the company has many projects running around &#8220;Minecraft&#8221;.  This also includes virtual reality experiences.  So it&#8217;s a game brand that definitely has its good years ahead of it!<\/p>\n<p><strong>7. There is no real violence, but there is death.<\/strong><\/p>\n<p>When creepy creatures attack the player&#8217;s fortress at night, the player can fight back with force of arms.  Otherwise the creatures will attack the player, destroying his collected goods.  It&#8217;s about survival.  Players can also raise and keep animals to gather food &#8211; but they must also slaughter them to ultimately get the meat.  It may be a little disturbing for parents to see their children killing virtual pigs and cows, but the meaning behind it is also revealed to young players.  It&#8217;s about survival.  So it&#8217;s never a senseless killing.  And that&#8217;s exactly what happens in reality.  If you, as a parent, want to protect your children from this or have a critical stance on it: Start a discussion about the topic with your children.  “Minecraft” can be a good occasion for this, because it ultimately adapts reality.<\/p>\n<p><img aria-describedby=\"caption-attachment-5802\" loading=\"lazy\" class=\"size-full wp-image-5802\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654296887_74_10-things-parents-should-know.jpg\" alt=\"Pigs can be raised and slaughtered for important food.\" width=\"1000\" height=\"563\"  \/><\/p>\n<p id=\"caption-attachment-5802\" class=\"wp-caption-text\">Pigs can be raised and slaughtered for important food.<\/p>\n<p><strong>8. The line between game and reality can blur in a positive way.<\/strong><\/p>\n<p>Parents report children tidying up their room and sorting their toys, just like they did in their virtual fortress in Minecraft.  Amazing, isn&#8217;t it?  The game adapts many things from reality in a simple way: Players can make clothes from sheep&#8217;s wool at the push of a button.  But how does it work in reality?  Maybe you can arouse your child&#8217;s curiosity.  Wouldn&#8217;t that be an opportunity for a trip to the farm?  You&#8217;ll be amazed at how many parallels your child will draw from the game!<\/p>\n<p><strong>9. Minecraft opens the door to more conversations on a variety of topics.<\/strong><\/p>\n<p>What is good, what is bad?  Who may live and who must die?  In Minecraft, that&#8217;s pretty simply defined.  In the real world, however, this is not the case.  Talk about it!  In the game, the children also have to deal with what makes a good house, how to take care of animals and how to use resources from the environment wisely.  All of these tasks reflect important actions from real love.<\/p>\n<p><strong>10. Parents can enjoy &#8220;Minecraft&#8221; wonderfully together with their children.<\/strong><\/p>\n<p>We have already indicated it before: Anyone who shears a sheep in “Minecraft” might want to see it in real life.  And so there are many topics from the game that parents can discuss or even experience together with their kids.  But it&#8217;s even easier: Play &#8220;Minecraft&#8221; together or just watch.  Let them show you the world your children have created.  You will see your offspring with completely different eyes.  The fact that there are so many videos online on YouTube shows how proud the children are of their creations.  You want to show it!  And since Minecraft can be played with four players at once on the console, it&#8217;s a great family experience.  Build a world together.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Minecraft is a phenomenon. It was first released for the PC in 2009, followed by the first console version on <\/p>\n","protected":false},"author":1,"featured_media":244,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/240"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=240"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/240\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/244"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=240"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=240"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=240"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}