{"id":257,"date":"2022-06-04T04:26:40","date_gmt":"2022-06-04T04:26:40","guid":{"rendered":"https:\/\/minecraft101.site\/media-education-practice-blog-minecraft\/"},"modified":"2022-06-04T04:26:40","modified_gmt":"2022-06-04T04:26:40","slug":"media-education-practice-blog-minecraft","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/media-education-practice-blog-minecraft\/","title":{"rendered":"Media Education Practice Blog » Minecraft"},"content":{"rendered":"<p>With the Raspberry Pi mini-computer, which costs only around EUR 40, and a free version of the game Minecraft, it is possible to learn in a motivating way how computers work and how to program them.<\/p>\n<table border=\"1\" width=\"100%\" cellspacing=\"0\" cellpadding=\"4\">\n<tbody>\n<tr bgcolor=\"#eeeeee\">\n<td width=\"20%\">setting<\/td>\n<td width=\"80%\">school lessons<\/td>\n<\/tr>\n<tr>\n<td>duration<\/td>\n<td>a project day<\/td>\n<\/tr>\n<tr bgcolor=\"#eeeeee\">\n<td>target group<\/td>\n<td>from the 6th grade, the project was carried out at a grammar school, but is also possible in other school types.  The children do not need any prerequisites, but no more than three children should share a Raspberry Pi<\/td>\n<\/tr>\n<tr>\n<td>objective<\/td>\n<td>The children should learn the basics of programming and electrical engineering.<\/td>\n<\/tr>\n<tr bgcolor=\"#eeeeee\">\n<td>Necessary equipment<\/td>\n<td>One Raspberry Pi per workstation (model B+ for approx. €32 or model 2B for approx. €38), 1 DVI monitor, 1 HDMI-DVI cable, 1 micro-USB power supply unit, 1 USB keyboard , 1 USB mouse, 1 SD card (min. 8 GB), 1 surprise egg, 1 LED (e.g. Kingbright L-53SGD), 1 button, 1 resistor 220 ohms (carbon film resistor 1\/4W 220), 2 jumper cables plugs -Socket (e.g. breadboard JBB flexible wire bridges, 15cm, plug-socket, 2 jumper cables socket-socket (e.g. breadboard JBB flexible wire bridges, 15cm, socket-socket)<\/td>\n<\/tr>\n<tr>\n<td>expenditure<\/td>\n<td>If the kids connect the Raspberry Pi themselves (which is easy to do), all they need to do is order and provide all the parts they need.  In addition, the operating system must be copied to the SD card, which takes a few minutes per card.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>  Read the whole post<\/p>\n<h3><strong>Suitability for (media) educational work<\/strong><\/h3>\n<p>The game Minecraft is very open and offers a variety of options to implement projects alone or in groups.  For example, you can plan buildings together on a specific topic and build them in the game.  This can lead to interesting group dynamic processes and conflicts &#8211; a good template for discussing common rules in groups.  Getting started is easy and you quickly achieve results that you can also present well.  Minecraft is the best-selling game in the world and very popular.  When it comes to media-pedagogical use, people often run into open doors.  The mobile version of Minecraft is not quite as flexible as the version for PCs.  The game is cheaper and can be played on many current smartphones and tablets.  A possible application are construction projects or the participation of children and young people in urban planning processes.<\/p>\n<p>  Read the whole post<\/p>\n<p>Minecraft is the best-selling computer game of all time.  And that&#8217;s wonderful, because it&#8217;s not only a great game (although it has many parts of sandbox games or building Lego), but also very exciting in terms of (media) education.<\/p>\n<p>In Minecraft, the whole world is made up of blocks that you can mine and use as building materials.  And you have to, because after a few minutes of play (in survival mode) night falls and monsters appear.  At first you have nothing to oppose them.  It is therefore well advised to build a protective cave or little house on the first &#8220;day&#8221;.  And usually one quickly finds this dwelling too small\/impractical\/ugly\/not representative.  And so most players automatically start thinking about design and architecture.<\/p>\n<p>This can also be used at school to treat the topic of architecture in art in the 7th grade of high school in accordance with the curriculum (!).  Here we describe how such a workshop can be structured.  Read the whole post<\/p>\n<p>The project is aimed at children between the ages of nine and 14, but can also be easily implemented with older participants.  The size of the group is primarily determined by the resources available. A group of around seven children can easily be cared for by two teachers, even without much previous knowledge.  The project will be carried out in two phases of one to two hours each.  Read the whole post<\/p>\n<p><img class=\"alignleft size-full wp-image-2789\" title=\"tastenbelegung\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654316800_931_Media-Education-Practice-Blog-Minecraft.jpg\" alt=\"\"\/>When using computer games in media education projects, learning the basic control elements often plays a central role.  Especially non-players need time and guidance to get into the game and thus the project.  If the game itself does not already have its own (useful) tutorial, it is up to the educators to adopt this guide and create as equal a playing field as possible between players and non-players.  In the case of the creative construction game &#8220;Minecraft&#8221;, whose pedagogical possibilities have been emphasized again and again lately, a tutorial is completely missing despite the numerous possibilities of the game.  In order to avoid a time-consuming explanation for each individual participant, a self-created tutorial world was used for the &#8220;BuildSomething @ Minecraft&#8221; project of the Institute for Computer Games &#8211; Spawnpoint.  Read the whole post<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the Raspberry Pi mini-computer, which costs only around EUR 40, and a free version of the game Minecraft, it <\/p>\n","protected":false},"author":1,"featured_media":260,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/257"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=257"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/257\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/260"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=257"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=257"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=257"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}