{"id":278,"date":"2022-06-04T12:48:48","date_gmt":"2022-06-04T12:48:48","guid":{"rendered":"https:\/\/minecraft101.site\/can-a-pedagogically-valuable-game-sometimes-degenerate\/"},"modified":"2022-06-04T12:48:48","modified_gmt":"2022-06-04T12:48:48","slug":"can-a-pedagogically-valuable-game-sometimes-degenerate","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/can-a-pedagogically-valuable-game-sometimes-degenerate\/","title":{"rendered":"Can a pedagogically valuable game sometimes degenerate?"},"content":{"rendered":"<h2>Tips for Parents<\/h2>\n<p><strong>Good to hear<\/strong><\/p>\n<p>Parents who listen carefully to their children also understand what is going on in their media world.  Unfortunately, parents like to switch off when they get the feeling that they don&#8217;t understand the words of young people &#8211; especially those related to gaming.  As with a foreign language, vocabulary builds up through conscious listening.  The chance of recognizing problems or critical media use increases with active listening.<\/p>\n<p><strong>Experience Minecraft together<\/strong><\/p>\n<p>Parents can be explained how Minecraft works and which game mode is interesting for their children.  This is very educational for adults, and children, in turn, will feel valued if the interest is genuine.<\/p>\n<p><strong>times of use<\/strong><\/p>\n<p>Minecraft can get very time consuming.  Especially with larger construction projects, the hours fly by.  Important for Parents: Minecraft cannot be stopped or paused in multiplayer as it is an online game.  Before your child leaves the game, they need to find a safe place where they cannot be attacked by other players.  This means that spontaneous interruptions, e.g.  B. because of homework or meals, can lead to conflicts.  The game can only be paused with the Esc key in single-player mode, which is significantly less attractive.<\/p>\n<p><strong>to make rules<\/strong><\/p>\n<p>In order to get the times of use under control, a set of rules should definitely be drawn up together with the child.  It specifies how the usage times are, how personal data is to be handled and that the playing time must not affect the completion of homework.  The Minecraft Contract, which first appeared in Richard Eisenmenger&#8217;s book, The Minecraft Coach for Parents, provides an ideal template for a written set of rules.<\/p>\n<p><strong>Discuss risks and offer solutions<\/strong><\/p>\n<p>First of all, children must be made aware of the risks mentioned above and at the same time suggested solutions must also be conveyed:<\/p>\n<ul>\n<li>Do not believe that behind the chat partner is the person who is presented.<\/li>\n<li>Insults and questions about where you live or your phone number are taboo.<\/li>\n<li>Demonstrate how the help button and the ignore function work.<\/li>\n<li>Show how to document insults with screenshots.<\/li>\n<li>Show that you can complain to the server operator.<\/li>\n<\/ul>\n<p><strong>Enable security settings and use kid-friendly Minecraft servers<\/strong><\/p>\n<p>If Minecraft is played on a game console like a Playstation or X-Box, the security settings should be enabled.  Parents can find more settings at www.medien-kindersicher.de.  In addition, when choosing the server, care should be taken to ensure that it is moderated and that it is specifically aimed at children.  Parents&#8217; forums discuss which server meets the requirements or whether your own server is more effective.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tips for Parents Good to hear Parents who listen carefully to their children also understand what is going on in <\/p>\n","protected":false},"author":1,"featured_media":279,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/278"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=278"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/278\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/279"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=278"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=278"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=278"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}