{"id":284,"date":"2022-06-04T15:48:05","date_gmt":"2022-06-04T15:48:05","guid":{"rendered":"https:\/\/minecraft101.site\/addicted-to-minecraft-what-to-do\/"},"modified":"2022-06-04T15:48:05","modified_gmt":"2022-06-04T15:48:05","slug":"addicted-to-minecraft-what-to-do","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/addicted-to-minecraft-what-to-do\/","title":{"rendered":"Addicted to Minecraft &#8211; what to do?"},"content":{"rendered":"<p>Sure, computer games are fun and can also be a useful leisure activity.  So does the creative online game Minecraft.  But when the fun turns into an addiction, you should definitely do something about it.<\/p>\n<h2>How to tell if you&#8217;re addicted to Minecraft<\/h2>\n<p>Unfortunately, no generally applicable criteria have yet been established on the subject of online addiction as to when passion becomes addiction.  Still, there are certain signs that can clearly indicate if you or your child are addicted to Minecraft.<\/p>\n<ul>\n<li>If you find that your or your child&#8217;s thoughts are on the game even when it is not being played.<\/li>\n<p>&#13;<\/p>\n<li>When the time spent on the computer increases day by day.<\/li>\n<p>&#13;<\/p>\n<li>If you or your child can&#8217;t stop playing, even though you&#8217;ve promised to do so beforehand.<\/li>\n<p>&#13;<\/p>\n<li>If you or your child become depressed, restless or even aggressive when playing is not possible.<\/li>\n<p>&#13;\n<\/ul>\n<h2>Here&#8217;s what you can do if you&#8217;re addicted<\/h2>\n<p>Unfortunately, the addiction to online games like Minecraft among children and young people, but also among adult gamers, is a trend that is increasing more and more.  But something can and should be done about it.<\/p>\n<ul>\n<li>First of all, as with any addiction, it is necessary to become really aware of the problem.<\/li>\n<p>&#13;<\/p>\n<li>After that, the person concerned should first talk seriously about the problem with relatives, friends or acquaintances: It is not uncommon for people who are familiar with the problem to motivate the person concerned to find a solution themselves through an alternative occupation such as sport.<\/li>\n<p>&#13;<\/p>\n<li>If the problem persists, be sure to contact trained experts: Advice centers in your area on the subject of addiction or portals specializing in online addiction can help you.<\/li>\n<p>&#13;<\/p>\n<li>Talking to your general practitioner or pediatrician can also help, and they can always help you if you or your child are addicted to Minecraft.<\/li>\n<p>&#13;\n<\/ul>\n<p class=\"feedback-title\">How helpful do you find this article?<\/p>\n<p>The content of the pages of www.helpster.de was created with the greatest care and to the best of our knowledge and belief.  However, no guarantee can be given for the correctness and completeness.  For this reason, any liability for any damage in connection with the use of the information offered is excluded.  Information and articles should in no way be considered a substitute for professional advice and\/or treatment by trained and recognized doctors.  The content of www.helpster.de cannot and must not be used to independently make a diagnosis or start treatment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sure, computer games are fun and can also be a useful leisure activity. So does the creative online game Minecraft. <\/p>\n","protected":false},"author":1,"featured_media":285,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/284"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=284"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/284\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/285"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=284"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=284"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=284"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}