{"id":286,"date":"2022-06-04T16:32:47","date_gmt":"2022-06-04T16:32:47","guid":{"rendered":"https:\/\/minecraft101.site\/game-apps-in-the-test-anything-but-child-friendly\/"},"modified":"2022-06-04T16:32:47","modified_gmt":"2022-06-04T16:32:47","slug":"game-apps-in-the-test-anything-but-child-friendly","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/game-apps-in-the-test-anything-but-child-friendly\/","title":{"rendered":"Game apps in the test: Anything but child-friendly"},"content":{"rendered":"<p><source media=\"(min-width: 768px)\"  type=\"image\/webp\"\/><source media=\"(min-width: 768px)\" \/><source media=\"(min-width: 440px) and (max-width: 767px)\"  type=\"image\/webp\"\/><source media=\"(min-width: 440px)\" \/><source media=\"(min-width: 1px) and (max-width: 439px)\"  type=\"image\/webp\"\/><source media=\"(min-width: 1px)\" \/><source  type=\"image\/webp\"\/><\/p>\n<p>highest concentration.  When children play, they dive deep into other worlds.  But with game apps, they sometimes encounter very problematic content.  © Alamy Stock Photo \/ BSIP SA <\/p>\n<p class=\"para\">Children love them, but cell phone games are rarely suitable for children.  This is also due to fellow players who bring Nazi slogans and pornography into play.  The multimedia experts at Stiftung Warentest tested 14 game apps, including Minecraft, Brawl Stars, Fortnite and Clash of Clans.  We tested from the perspective of a 10-year-old child.  Alarming result: We cannot recommend a single app.  We tell you how to protect your child and prevent in-app purchases.<\/p>\n<h2 class=\"headline headline--h2\">Minecraft: Lava from Hell<\/h2>\n<p class=\"para\">Small blocks of gold ore, grass or explosives are their world.  Lukas and Mathis use it to build houses, machines or portals in another dimension on their smartphones.  The Berlin boys are fans of the game app <strong>Minecraft<\/strong>.  &#8220;Let&#8217;s go to hell and collect lava,&#8221; says 13-year-old Lukas to his friend Mathis.  He is 14 and &#8220;completely pro&#8221;.  Pro means professional in adult language.  “I&#8217;ve been playing Minecraft for four years.  The cool thing about it is that you can learn a bit of programming,” says Mathis.<\/p><source media=\"(min-width: 768px)\"  type=\"image\/webp\"\/><source media=\"(min-width: 768px)\" \/><source media=\"(min-width: 440px) and (max-width: 767px)\"  type=\"image\/webp\"\/><source media=\"(min-width: 440px)\" \/><source media=\"(min-width: 1px) and (max-width: 439px)\"  type=\"image\/webp\"\/><source media=\"(min-width: 1px)\" \/><source  type=\"image\/webp\"\/><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654360367_170_Game-apps-in-the-test-Anything-but-child-friendly.jpg\" class=\"image\" alt=\"Game apps in the test - anything but child-friendly\" width=\"600\" height=\"291\" loading=\"lazy\"\/><\/p>\n<p>Scene from Minecraft<\/p>\n<h3 class=\"headline headline--h3\">Our advice<\/h3>\n<p class=\"para\">We cannot recommend any of the 14 tested mobile games for children.  One thing is questionable in terms of child protection, we even classify 13 as unacceptable.  In 7, we encountered sensitive content like references to porn sites.  For many families, doing without games apps altogether is not a solution.  With our tips, parents can noticeably reduce the risks of cost traps and data protection.<\/p>\n<h2 class=\"headline headline--h2\">Disturbing content in the test<\/h2>\n<p class=\"para\"><strong>Minecraft <\/strong>is one of 14 popular game apps we tested for parental controls, with around 10 more <strong>BrawlStars<\/strong>, <strong>Fortnite <\/strong>and <strong>clash of clans<\/strong>.  Some are offered in the app store for children from the age of 0 years, the highest recommended age for the games in the test is 12 years and over.  We tested from the perspective of 10-year-olds.  Wherever a game required an age rating, we specified 10 years.<\/p>\n<h2 class=\"headline headline--h2\">“Poor” was the best verdict<\/h2>\n<p class=\"para\">Our results are alarming: we cannot recommend a single app.  13 offer unacceptable child protection, the least bad, <strong>Pokemon Go<\/strong>we classify as questionable.<\/p>\n<h2 class=\"headline headline--h2\">Children are supposed to kill “bad Jews”.<\/h2>\n<p class=\"para\">The dangers often come from a corner that parents shouldn&#8217;t expect: We found links to porn sites, players with right-wing extremist pseudonyms and a game in which &#8220;bad Jews&#8221; are supposed to be killed.  The Android version of <strong>Subway Surfers<\/strong> for children aged 6 and over showed an advertisement for a game aged 18 and up in which people are constantly being shot.<\/p>\n<h2 class=\"headline headline--h2\">Almost all games are free<\/h2>\n<p class=\"para\">We tested 13 mobile phone apps for the operating systems Android and iOS.  the 14th app, <strong>Fortnite<\/strong>, we only checked for iOS, because an Android version was not available in the Google Play Store.  Almost all games can be downloaded free of charge from the app stores, <strong>Minecraft <\/strong>costs a one-off fee of 7.99 euros.  We publish our results in a profile for each app.  Most of the time, all verdicts are the same for Android and iOS.  We name exceptions in the profiles.  Unlike usual, we didn&#8217;t sort the apps according to our judgments, but alphabetically by name.<\/p>\n<h2 class=\"headline headline--h2\">Anything but child-friendly<\/h2>\n<p class=\"para\">We examined the apps in cooperation with Jugendschutz.net, the joint federal and state competence center for child and youth protection on the Internet.  We wanted to know how child-friendly the games are, whether the default settings allow safe use and how easy it is to report violations by other players to the provider.  The latter works moderately, but would often be necessary.  We encountered right-wing extremist player names such as &#8220;SiegHeil&#8221; or &#8220;Judentöter&#8221;, for example in the apps <strong>Fortnite <\/strong>and <strong>clash of clans<\/strong>.  at <strong>clash royale<\/strong> and <strong>BrawlStars<\/strong> are the names of a number of players as well as Internet addresses of porn sites.<\/p>\n<p class=\"p-title cta-box__text h3\" aria-label=\"Artikel Alle Testergebnisse für Spiele Apps 10\/2019 Spiele-Apps im Test freischalten\">\n<p>\t\t\t\t\tGaming apps tested All test results for gaming apps 10\/2019<\/p>\n<h2 class=\"headline headline--h2\">Angry Birds 2: Digital gems for 110 euros<\/h2>\n<p class=\"para\">We also checked how tempting in-app purchases are.  “My parents deactivated them on my cell phone.  I like that.  I definitely don&#8217;t want to click on anything wrong,&#8221; says Lukas.  His concern is justified: in the app <strong>Minecraft<\/strong> the in-app purchases are partly non-transparent.  Other children have fallen into cost traps like this one.  Hundreds of euros can be spent very quickly.  at <strong>Angry Birds 2<\/strong> for example, players can waste around 110 euros on virtual gems with a purchase.  The business model is based on this if the app itself is free.  You can also buy costumes for game characters or raw materials in the apps.<\/p>\n<h2 class=\"headline headline--h2\">Candy Crush &#038; Homescapes: Nothing going on without moss<\/h2>\n<p class=\"para\">A number of games directly ask for a purchase – or push indirectly.  at <strong>Candy Crush<\/strong> and <strong>homescapes<\/strong> for example, players can only progress with difficulty if they do not buy any extras.  The following often applies: Only those who pay can make quick progress.  Read our tips on how to prevent in-app purchases.<\/p>\n<h2 class=\"headline headline--h2\">Incomprehensible for children: When it comes to data protection, everyone loses<\/h2>\n<p class=\"para\">According to the General Data Protection Regulation, the privacy statements for services that are also aimed at children must be worded in a way that children can understand.  None of the tested apps adhere to it.  This is one of the reasons why we do not rate the data protection of any game as appropriate.  In addition, most of them transmit more user data than they need to function.  One example of many: <strong>Temple Run 2<\/strong> transmits player usage statistics to an analysis service in the Android version &#8211; even if the user has deactivated &#8220;tracking&#8221;.<\/p>\n<h2 class=\"headline headline--h2\">Inadmissible clauses in the general terms and conditions<\/h2>\n<p class=\"para\">Our specialist lawyer found numerous illegal clauses in the general terms and conditions of the apps.  10 of the 14 apps contain very obvious flaws in the Android and iOS versions.  The makers of <strong>Angry Birds 2<\/strong> For example, they state that they monitor their users and state: “You irrevocably consent to this monitoring and recording.  Accordingly, you agree that you will not expect any privacy&#8230; including but not limited to chat texts or voice messages.” <strong>Candy Crush<\/strong> for example, will not be responsible for any loss if fraudsters access the user account.<\/p>\n<h2 class=\"headline headline--h2\">If there are no general terms and conditions, German law applies<\/h2>\n<p class=\"para\">The providers of <strong>Temple Run 2<\/strong>, <strong>Subway Surfers<\/strong>, <strong>Empires &#038; Puzzles<\/strong> and <strong>Helix jump<\/strong> (Android version) do not provide T&#038;Cs.  Instead, German law applies &#8211; an advantage for consumers.<\/p>\n<h2 class=\"headline headline--h2\">A magical surprise<\/h2>\n<p class=\"para\">Lukas read the terms and conditions for Minecraft with his parents.  &#8220;It was really hard,&#8221; he recalls of the small print.  His parents have activated the child safety functions on Lukas&#8217; smartphone and agreed on a fixed media time with him.  They were surprised when a few weeks ago Lukas and Mathis suddenly threw themselves into a new game with great enthusiasm.  Totally analogue.  They are now practicing magic tricks.  Minecraft is always too boring for them in the long run.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>highest concentration. When children play, they dive deep into other worlds. But with game apps, they sometimes encounter very problematic <\/p>\n","protected":false},"author":1,"featured_media":289,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/286"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=286"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/286\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/289"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=286"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=286"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=286"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}