{"id":292,"date":"2022-06-04T18:27:43","date_gmt":"2022-06-04T18:27:43","guid":{"rendered":"https:\/\/minecraft101.site\/learn-languages-%e2%80%8b%e2%80%8bwith-minecraft-gostudent\/"},"modified":"2022-06-04T18:27:43","modified_gmt":"2022-06-04T18:27:43","slug":"learn-languages-%e2%80%8b%e2%80%8bwith-minecraft-gostudent","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/learn-languages-%e2%80%8b%e2%80%8bwith-minecraft-gostudent\/","title":{"rendered":"Learn languages ​​with Minecraft |  GoStudent"},"content":{"rendered":"<p style=\"font-size: 24px;\">\n<p style=\"font-size: 24px; font-weight: bold;\">Chapter<\/p>\n<p>1. Minecraft &#8211; what is it and why do kids love the game?<br \/>2. How can children learn with Minecraft at school?<br \/>3. How can kids learn languages ​​at home with Minecraft?<\/p>\n<p>Gaming is extremely popular with children and young people: almost 90% of 10 to 18 year olds regularly play video games.  They are an integral part of everyday life and fill up a large part of our free time.  Often so much that parents worry that learning is not neglected.  It&#8217;s the recurring theme of motivation in children and how we can improve it.  When it comes to computer games or other hobbies, it just seems to be a lot bigger.  🎮<\/p>\n<p>The games FIFA, Minecraft, Sims and Fortnite are particularly successful with young people.<\/p>\n<p>But Minecraft is a special case among games &#8211; it appeals to both girls and boys and even offers opportunities for education.  📚 🧪<\/p>\n<\/p>\n<p style=\"font-size: 18px;\"><\/p>\n<h2 style=\"font-size: 24px; font-weight: bold;\"> <\/h2>\n<h2 style=\"font-size: 24px; font-weight: bold;\">Minecraft &#8211; What is it and why do kids love the game?<\/h2>\n<\/p>\n<p>Minecraft.  What kind of game is it that inspires children, teenagers and even adults?  🤔<\/p>\n<p>First a record: With 200 million copies, Minecraft is the best-selling computer game in the world.  It is characterized by a block look and almost limitless creative possibilities.  Players start as a character on an uncharted island and must construct items or buildings and defend themselves against monsters.  👾<\/p>\n<p>The creative and adventure mode is suitable for children from the age of six and allows building and dismantling the blocks.  In survival mode, players also defend themselves against creatures such as zombies and must endure nights without losing life points.  ❤️❤️<\/p>\n<p>The successful game comes from Sweden and has belonged to Microsoft since 2014.  There are now a lot of Minecraft fan articles, including books that are suitable for young gamers.  📚 <\/p>\n<p>So users can build their own worlds and experience adventures in them.  The special thing about the successful computer game: It was discovered more and more as a tool for learning.  While other games and apps convey history as a sideline, Minecraft is really used in schools.  🧑‍🏫<\/p>\n<h3 style=\"font-size: 20px;\"> <\/h3>\n<h2 style=\"font-size: 24px; font-weight: bold;\">How can kids learn with Minecraft at school?<\/h2>\n<\/p>\n<p>Among the versions of Minecraft, there is also one that is officially only intended for educational institutions.  It&#8217;s called Minecraft Education Edition 🏘️<\/p>\n<p>Courses in the game developed for education include, for example, the subjects of math, computer science, art and languages, but also inclusion and emotional competence.  Many of them are also available in German and you can try at least some demo versions at home and convince yourself of the potential.  😊<\/p>\n<\/p>\n<h3 style=\"font-size: 20px;\">👍 Learn to code with Minecraft<\/h3>\n<\/p>\n<p>Minecraft is often used in computer science, which is also obvious for a game.  In Code Hour, students learn the basics of coding while also learning compassion and cooperation.  It&#8217;s about reuniting the people from two villages through in-game coding tasks.  So Minecraft can link learning areas through its virtual environment.  This educational experience is free to try as a demo.  You have to download the Education Edition for this.  A few more demos are also included.  🖥️<\/p>\n<\/p>\n<h3 style=\"font-size: 20px;\">👍 You can also learn languages ​​with Minecraft<\/h3>\n<\/p>\n<p>Minecraft Education is even suitable for languages: the English Adventures lesson was developed by Cambridge Assessment English and follows language level A1.  In the game&#8217;s immersive environment, students can improve their English communication skills and solve in-game puzzles.  Then have the children fill out worksheets answering questions about the adventure in English.  🇬🇧<\/p>\n<p>And even writing can be combined with the game.  The Leagues of Literacy course explores how students can use the virtual world to create a story.  This provides incentives through the interactive adventure, which the children then implement as text.  Our tip: Your child can also write about their Minecraft experience at home.  They can either plan their buildings and projects in writing beforehand or describe the gaming adventure afterwards.  ✍🏻 <\/p>\n<h2 style=\"font-size: 24px; font-weight: bold;\"> <\/h2>\n<h2 style=\"font-size: 24px; font-weight: bold;\">How can kids learn languages ​​at home with Minecraft?<\/h2>\n<\/p>\n<p>As already mentioned, the Education Edition is closed to private individuals.  But what about at home and in your free time?  Can children learn languages ​​with Minecraft here too?<\/p>\n<\/p>\n<h3 style=\"font-size: 20px;\">👍 Change the language setting of Minecraft<\/h3>\n<\/p>\n<p>This tip is easy to implement.  To learn a foreign language with Minecraft, you can simply change the language setting in the options.  Of course, it doesn&#8217;t have to be like this all the time.  But after a while, children and young people get used to it very well.  There is a large selection, with English there are even variants for countries such as Australia, the United Kingdom or Canada.  Even old English from Shakespeare&#8217;s time is among them.  And of course the other major languages ​​like French, Spanish and Chinese, but also, for example, Somali and Gaelic.  Your children probably won&#8217;t learn the last two.  😉<\/p>\n<\/p>\n<h3 style=\"font-size: 20px;\">👍 Play Minecraft with the language tandem for two<\/h3>\n<\/p>\n<p>The so-called language tandem is a proven method for learning foreign languages.  This is where two people meet who each want to learn the language of the other.  Depending on the agreement, they then speak German for half an hour and English for half an hour, for example.  In addition to training, great friendships can also develop.  🤝<\/p>\n<\/p>\n<p>Of course, the whole thing also works online and when playing together in multiplayer mode.  All you have to do is find a kid who speaks the foreign language and loves Minecraft.  Maybe someone in your circle of acquaintances is growing up bilingual?  Or you search in Facebook groups and other social media channels.  Teachers at your school may be able to help with this question.  And of course you can look for tutors who know about Minecraft!  🙃<\/p>\n<\/p>\n<p>Depending on the edition of Minecraft or platform you&#8217;re using (PC, XBOX, Nintendo Switch, etc.), the technical setup works a little differently.  And depending on the platform, you will also need software to talk together. TeamSpeak is particularly popular on the PC, but of course you can also use Zoom.  🎤<\/p>\n<\/p>\n<h3 style=\"font-size: 20px;\">👍 Watch Minecraft gamers on YouTube or stream<\/h3>\n<\/p>\n<p>As with many other games, Minecraft has a lot of gamers who create YouTube videos or stream their adventures live.  Maybe your child is already watching clips of this type. Of course, this is also possible in other languages ​​and can be a great compromise in order to watch longer, but also to learn.  On the popular streaming platform Twitch, small buttons under the videos even show the respective language.  And on YouTube you can search for Minecraft gameplays and select a suitable channel.  Depending on the age of the child, parents should of course make sure that the content is appropriate.  YouTubeKids is more suitable for the younger ones.  📺<\/p>\n<\/p>\n<h3 style=\"font-size: 20px;\">👍 Community creations from the Minecraft Marketplace<\/h3>\n<\/p>\n<p>As I said, Minecraft Education Edition courses are not available to individuals.  But on the Minecraft Marketplace, you can find mini-games created by other Minecraft fans.  And these can be at least as good!  The offer is large, but thanks to the star ratings and short videos you can make your choice.  There is also content for language learning, such as Spanish 1: TNT squad from Lifeboat.  With this you can practice Spanish vocabulary and numbers in 12 levels.<\/p>\n<p>So Minecraft is a wonderful invention and the potential of the game is far from exhausted.  But of course it is important to also encourage activities away from the screen.  We have also collected a few tips for this.  🚀<\/p>\n<\/p>\n<h2 style=\"font-size: 24px;\"><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/Learn-languages-​​with-Minecraft-GoStudent.gif\" alt=\"gs_tutor_wheel04\" width=\"850\" loading=\"lazy\" style=\"color: #555978; background-color: transparent; width: 850px;\"  \/><\/h2>\n","protected":false},"excerpt":{"rendered":"<p>Chapter 1. Minecraft &#8211; what is it and why do kids love the game?2. How can children learn with Minecraft <\/p>\n","protected":false},"author":1,"featured_media":295,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/292"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=292"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/292\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/295"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=292"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=292"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=292"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}