{"id":300,"date":"2022-06-04T20:51:05","date_gmt":"2022-06-04T20:51:05","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-in-the-district-work-utopolis\/"},"modified":"2022-06-22T16:19:36","modified_gmt":"2022-06-22T16:19:36","slug":"minecraft-in-the-district-work-utopolis","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-in-the-district-work-utopolis\/","title":{"rendered":"Minecraft in the district work &#8211; Utopolis"},"content":{"rendered":"<p>Minecraft, a game that looks like an outdated 3D pixel game at first glance and is reminiscent of an infinite terminal block world, has been one of the most popular games among children and young people for over 10 years (see the JIM study by the media education research association Südwest). The game is characterized by the fact that there is no clearly defined goal in it. The players decide for themselves how and for what they want to use Minecraft. For example, it can be used for mini-games on servers, the challenge in so-called survival mode or designing entire worlds with friends in creative mode.<\/p>\n<p>Therefore, the idea of ​​using Minecraft in district work is very obvious. Many children and young people know or play the game. The possibility of implementing the worlds in Minecraft on a scale of 1:1 means that ideas from real surroundings in one&#8217;s own district can be implemented very well &#8211; be it a replica of favorite places in one&#8217;s own residential area or the development of new buildings, such as a youth center . Even smaller projects such as the design of green spaces or brownfield sites can be implemented quickly, in a grassroots-democratic and citizen-friendly manner.<\/p>\n<p>A plus is the simplicity in terms of hardware, software and technical knowledge. The basis is PCs, consoles or mobile devices and the Minecraft Bedrock Edition including server. As soon as the server and the games are activated, you can start. Much of the game is intuitive and can be explored on your own; However, it is just as helpful to first let the young and old Minecraft experts show you the possibilities of the game. The adults should act more as an accompaniment and not be afraid to let the children and young people bring the game closer to them. However, it is also important to have clearly defined goals for your own project. Above all, however, it is also about playing together, detached from a specific project. Because even with the most ambitious Minecraft project, one should not forget that it is a game and therefore the focus should be on having fun. This is where the best and most creative suggestions come from anyway, which hopefully will find their way into the “real” world.<\/p>\n<p>An extensive collection of Minecraft projects can be found here.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Minecraft, a game that looks like an outdated 3D pixel game at first glance and is reminiscent of an infinite <\/p>\n","protected":false},"author":1,"featured_media":301,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/300"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=300"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/300\/revisions"}],"predecessor-version":[{"id":1771,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/300\/revisions\/1771"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/301"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=300"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=300"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=300"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}