{"id":343,"date":"2022-06-05T11:35:50","date_gmt":"2022-06-05T11:35:50","guid":{"rendered":"https:\/\/minecraft101.site\/build-me-a-castle-why-minecraft-is-great-for-kids\/"},"modified":"2022-06-05T11:35:50","modified_gmt":"2022-06-05T11:35:50","slug":"build-me-a-castle-why-minecraft-is-great-for-kids","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/build-me-a-castle-why-minecraft-is-great-for-kids\/","title":{"rendered":"build me a castle  Why Minecraft is great for kids"},"content":{"rendered":"<p>It all started when I happened to get into a Minecraft workshop with my daughter.  What I saw there amazed me.  Next to us at the table sat a boy of about six who could build houses and create worlds in the computer game Minecraft faster than I could watch.  I was actually on business at the EduCamp in Leipzig.  People who deal with the topic of education meet on an “Education Campus”.  My team and I were led there by the focus on digital teaching and learning. <\/p>\n<p>In a so-called BarCamp, people meet who present topics in a very free format and exchange ideas on topics related to (digital) education.  Parallel to the area for adults, there were many offers for kids at the EduCamp &#8211; coding workshops, Minecraft workshops or makey-makey workshops by the young inventors.  Up to that point, we had only a few points of contact with “digital toys” for kids at home.<\/p>\n<p><iframe title=\"Minecraft Fan-Made Trailer\" width=\"1140\" height=\"641\" src=\"https:\/\/www.youtube.com\/embed\/FaMTedT6P0I?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<p>And while I was still watching the six-year-old Minecraft pro in amazement, my nine-year-old daughter was already taking her first steps in this digital world.  The only thing remotely familiar to me was the look of these digital building blocks, which reminded me of Lego bricks.<\/p>\n<p>Today it feels like Minecraft has always been part of our family.  My daughter now arranges to meet up with her friends on a shared server.  Parallel to playing Minecraft, the kids chat on a second device &#8211; preferably on the good old landline phone.  They give each other tips with great passion, slip into their roles and talk about their characters.  Together they think about what they want to do next or help each other with problems.  On the one hand, they dive deep into their Minecraft world &#8211; and on the other hand, at the end of the virtual game, they like to meet up to play table tennis on the playground around the corner.<\/p>\n<h3 class=\"subheading    after-text \">Dive into the digital world together<\/h3>\n<p>What surprises me?  To observe how quickly she moves in this world and how intuitively she operates the game.  Quite unlike me, I have to admit, I feel absolutely insecure in the Minecraft world.  Even though I&#8217;ve tried it time and time again!  What fascinates me?  Minecraft is a game in which the kids creatively and collaboratively, i.e. together with their friends, build a world, build palaces and castles, masterfully handling the technologies and imaginatively building and playing. <\/p>\n<h2>More about Minecraft<\/h2>\n<p><strong>Begin:<\/strong> On this page you can download Minecraft and create a user account.<\/p>\n<p><strong>Dialog:<\/strong> Millions of people around the world play Minecraft.  If you want to exchange ideas, the Minecraft forum is the place to be.<\/p>\n<p><strong>Help: <\/strong>The Minecraft Wiki is probably where most of the information about the game can be found. <\/p>\n<p>My takeaway: Minecraft gives girls the opportunity to learn basic programming skills.  And in an environment that they themselves find pleasant and that they enjoy.  So why not start with Minecraft?<\/p>\n<p>Minecraft is now also anchored in some school projects.  Increasing (learning) motivation through gamification and e-didactics at schools and universities is a major topic that is now also being intensively dealt with by science.  It is no longer a question of whether the world is going digital, but rather how we as parents or trainers and trainers react to it.  Also, in order to create the necessary skills for the future of our children for job profiles that we don&#8217;t even know yet.<\/p>\n<p>My tip: Children learn how to use technology very quickly and easily through games like Minecraft.  They actively shape their game instead of sitting back and consuming like other jump-and-run games.  Accompany your children at the beginning, try out the game together (and treat your child to the success that they will probably take over the command right away after the installation and then explain everything else to you).  Observe whether your child is having fun playing or still needs a helping hand.  And don&#8217;t be afraid to regulate the duration of the game gently either.  Then talk about the impressions to identify insecurities.  Learn with and from your child and immerse yourself in the digital world together.<\/p>\n<h2>To person<\/h2>\n<p>In her column, Stefanie Quade writes about digital learning worlds for children.  When Stefanie is not out and about for coding kids, she researches e-education and e-didactics at the Berlin School of Economics and Law and works as a lecturer and trainer on international project and innovation management.  Otherwise she blogs about e-didactics and blended learning or about her book about media innovation &#8220;DesignAgility&#8221;.  She is also doing her doctorate in London on corporate social learning.  In 2012 and 2013 she received the International E-Learning Award at Columbia University in New York City.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It all started when I happened to get into a Minecraft workshop with my daughter. What I saw there amazed <\/p>\n","protected":false},"author":1,"featured_media":344,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/343"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=343"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/343\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/344"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=343"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=343"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=343"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}