{"id":345,"date":"2022-06-05T12:17:24","date_gmt":"2022-06-05T12:17:24","guid":{"rendered":"https:\/\/minecraft101.site\/the-kids-are-playing-minecraft-and-i-tested-the-pc-game-kidscats\/"},"modified":"2022-06-05T12:17:24","modified_gmt":"2022-06-05T12:17:24","slug":"the-kids-are-playing-minecraft-and-i-tested-the-pc-game-kidscats","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/the-kids-are-playing-minecraft-and-i-tested-the-pc-game-kidscats\/","title":{"rendered":"The kids are playing Minecraft &#8211; and I tested the PC game!  &#8211; Kids&#038;Cats"},"content":{"rendered":"<p>My kids discovered the PC game &#8220;Minecraft&#8221; a few days ago.  Now they build new worlds from pixel blocks.  For all of you who don&#8217;t know this game: Minecraft is a bit like Lego, only virtual.  You build a complete game world out of many individual blocks.  In principle, it is a totally creative affair, because the children can really let off steam and build all sorts of strange things.  The game is actually not child&#8217;s play &#8211; or at least not designed as such.  Many different people let off steam on the platform and always create new worlds.  The recommended age for Minecraft is 6 years.<\/p>\n<p>Of course I tested it right away to see if the PC game was even fun ;-).<\/p>\n<h2>Minecraft: Foster Creativity, Learn Collaboration, Overcome Challenges<\/h2>\n<p>In Minecraft, players build and create their own world.  There is a multiplayer mode where you can play with others.  Various game modes mean that even younger children can have a lot of fun with the game.<\/p>\n<p>Design your own world with square blocks &#8211; it&#8217;s easy with Minecraft.<\/p>\n<p>We play in creative mode, which allows the player to build their world as they wish and to develop freely.  In this mode there are no restrictions on the building materials, which is why you can build big houses, deep caves or castles in the clouds very quickly.  My children are also very enthusiastic about the many animals that you can bring into the world.  The character can even ride the horses.<\/p>\n<p><img class=\"size-full wp-image-2642\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654431440_469_The-kids-are-playing-Minecraft-and-I-tested-the.png\" alt=\"Toolbar in Minecraft\" width=\"800\" height=\"600\" data-recalc-dims=\"1\"\/>The unlimited selection and number of building materials and components is a lot of fun.<\/p>\n<p>There are also types of monsters, zombies and other unsympathetic creatures.  But since we are in creative mode, these creatures are also totally shy and leave us alone.<\/p>\n<h2>stone on stone<\/h2>\n<p>Minecraft is mainly built with square blocks.  You put stone on stone, you can use window panes and doors or build a pile of snow.<\/p>\n<p><img class=\"size-full wp-image-2638\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654431442_249_The-kids-are-playing-Minecraft-and-I-tested-the.png\" alt=\"minecraft house\" width=\"800\" height=\"600\" data-recalc-dims=\"1\"\/>A terrace of snow and a llama running across it &#8211; no problem in Minecraft.<\/p>\n<p>You can also remove terrain and destroy buildings or dig deep into the earth.  It takes a bit of practice to master the controls well.  However, once you know it, it&#8217;s very easy.<\/p>\n<p>So far so nice.  So Mincraft is a really nice PC game, not just for kids but for everyone else too.  It&#8217;s really fun to play and you can play with it for a long time.  You can let off steam incredibly creatively and once you&#8217;ve started there&#8217;s almost no end to it &#8211; it&#8217;s not just the kids who feel that way, I felt the same way when I tested the game.  Due to the never-ending building materials you can create endless buildings and time flies by.<\/p>\n<p><img class=\"size-full wp-image-2641\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654431444_58_The-kids-are-playing-Minecraft-and-I-tested-the.png\" alt=\"Horse Minecraft\" width=\"800\" height=\"600\" data-recalc-dims=\"1\"\/>You can even ride the horses.<\/p>\n<p>I&#8217;ll add a link to the NRW game guide, where the game is presented in detail.  Here you get a better insight into Minecraft.<\/p>\n<h2>Minecraft &#8211; creativity-enhancing, motivating and&#8230; time-consuming!<\/h2>\n<p>But the &#8220;time&#8221; factor is of course also the disadvantage of the game (as always with PC games).<\/p>\n<p>I think it makes a lot of sense for the children to use computers and the Internet.  I even think it is essential that they play, surf and research on computers, tablets and smartphones.<\/p>\n<p>What I find extremely annoying, on the other hand, are the ongoing discussions about the season.  Since my children are not that small anymore, they naturally know very well where they can play tricks so that they can play longer than agreed.<\/p>\n<p>For example at the weekend when my husband and I sat on the terrace and the children had &#8220;half an hour of playtime&#8221; inside.  And we parents didn&#8217;t pay attention to the time and then went into the country for a short 90 minutes.  The stupid thing is: we parents are no better.  We don&#8217;t play Minecraft, we do other things.  Blogging for example.  Or spinning out other little web projects.  Of course that takes time.  Anyone who blogs knows how quickly time flies.  And because we hadn&#8217;t set an alarm &#8211; neither for us nor for the children &#8211; two very red-eyed, red-cheeked Minecraft fans came out of the children&#8217;s rooms after 1.5 hours.<\/p>\n<h2>Set clear agreements and alarm clocks<\/h2>\n<p>Yesterday I set up a little set of rules with the kids.  I was annoyed (again).  My two cuties came in the door after school, peppered the satchels in a corner and then it started:<\/p>\n<p>&#8220;May we play Minecraft later?&#8221;<\/p>\n<p>&#8220;May we? May we? May we?&#8221;<\/p>\n<p>And because I really don&#8217;t feel like having this conversation every day, I discussed two rules with the children:<\/p>\n<ol>\n<li>Half an hour of Minecraft can be played every day.<\/li>\n<p>&#13;<\/p>\n<li>There are only exceptions if I am ill or if I urgently need some rest in my home office.<\/li>\n<p>&#13;\n<\/ol>\n<h2>The children are allowed to play and I don&#8217;t have to argue<\/h2>\n<p>All discussions could have ended by now.  Or so I thought.  Practice shows that we still discuss every day.  But since we have rules, I can at least refer to them ;-).<\/p>\n<p>And there are new discussions that I didn&#8217;t foresee.  The other day the smaller child set the alarm clock.  To 50 minutes!  I explained to the son that half an hour is only 30 minutes and the whole hour is 60.<\/p>\n<p>&#8220;That&#8217;s totally illogical, Mom! Everything else is always 100. Are you sure that there aren&#8217;t 100 minutes in an hour?&#8221;<\/p>\n<p>well  I have to think about that first ;-).<\/p>\n<p>Your Carola<\/p>\n<h3 class=\"sd-title\">I like it:<\/h3>\n<p>Like Loading&#8230;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>My kids discovered the PC game &#8220;Minecraft&#8221; a few days ago. Now they build new worlds from pixel blocks. For <\/p>\n","protected":false},"author":1,"featured_media":350,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/345"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=345"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/345\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/350"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=345"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=345"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=345"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}