{"id":492,"date":"2022-06-07T06:35:13","date_gmt":"2022-06-07T06:35:13","guid":{"rendered":"https:\/\/minecraft101.site\/how-to-build-a-minecraft-server-on-java-bedrock-for-free\/"},"modified":"2022-06-07T06:35:13","modified_gmt":"2022-06-07T06:35:13","slug":"how-to-build-a-minecraft-server-on-java-bedrock-for-free","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/how-to-build-a-minecraft-server-on-java-bedrock-for-free\/","title":{"rendered":"How to Build a Minecraft Server on Java &#038; Bedrock for Free"},"content":{"rendered":"<p><strong>Minecraft<\/strong> Gamers who want to play with their friends might think that creating and hosting an online server is a nightmare.  Setting up codes for the server and downloading files to make it work seems like a monumental challenge that most won&#8217;t be able to handle.  However, we can change the narrative by putting an end to this digital horror by finding the easiest way to create a free Minecraft server on either the Minecraft Java or Bedrock editions.  You can do all of this in just 15 minutes.  It takes players more than twice as long to find and defeat the Overseer.  Having said that <strong>Here&#8217;s how to create a Minecraft server on Java &#038; Bedrock for free<\/strong>.<\/p>\n<h3>Creating a Free Minecraft Server on Java &#038; Bedrock<\/h3>\n<p>To create an easy and free Minecraft server for you and your friends to play on, you need to find a server host.  Here are the best free Minecraft server hosts to choose from:<\/p>\n<ul>\n<li>aternus<\/li>\n<li>PloudOS<\/li>\n<li>mine hat<\/li>\n<li>TridentSDK<\/li>\n<li>FreeMcServer.net<\/li>\n<li>server pro<\/li>\n<li>FelixNodes.net<\/li>\n<\/ul>\n<h3>Sign up for a free online Minecraft server through Aternos<\/h3>\n<p>The server host we&#8217;re going to use to show you how to create a free Minecraft server is Aternos.  You have the simplest and easiest way to create a free minecraft server:<\/p>\n<ol>\n<li>First, go to their website and click on the &#8220;Play&#8221; button in the bottom right corner of the screen.<\/li>\n<li>Second, create an Aternos account to start creating a server.  Use your Google or Facebook to sign in, or just use the sign in button to use your email address.<\/li>\n<li>Third, if you select the &#8220;Sign In&#8221; button, you will require a username and then agree to the Privacy Policy and Terms of Service next to the &#8220;Username&#8221; field.  Click on &#8220;Next&#8221; with the arrow next to it to continue.<\/li>\n<li>Fourth, set a password for your server.  You can also give the site your email address for recovery efforts in case you ever forget your password.  Click the Sign Up button with a lock next to it to proceed with signing up to create your free server in Minecraft Java or Bedrock edition.<\/li>\n<\/ol>\n<h3>Build your free Aternos Minecraft server<\/h3>\n<p>Now that you&#8217;ve created your account, you can start creating a server in Minecraft:<\/p>\n<ol>\n<li>First, go to the &#8220;Create Server&#8221; button in the middle of the screen and click on it.<\/li>\n<li>Second, choose whether you want to build a server for Java or Bedrock edition.  You can always change the version later.  There are also options to change the server name and add a welcome message to your server.  When you&#8217;re done, click the &#8220;Create&#8221; button to finish setting up your free Minecraft server in Bedrock or Java edition.<\/li>\n<li>Third, click the &#8220;Start&#8221; button to start the server.  Don&#8217;t play with it just yet though, as there are still some adjustments to be made.<\/li>\n<\/ol>\n<p>See also<\/p>\n<p>Minecraft: How to get Honeycomb and what it&#8217;s used for<\/p>\n<h3>Customization of the Aternos server<\/h3>\n<p>With so many options to choose from on other server hosting sites, it can still be overwhelming trying to figure out how to know exactly what things to choose from in the beginning.  Aternos makes it easier than most to toggle some options on your server.  Here are some server settings and changes below:<\/p>\n<ol>\n<li>To change the server settings, first go to the “Options” tab and click on it on the left side.  You can change basic things like game mode, difficulty, and spawns for specific mobs like animals and villagers.<\/li>\n<li>Second, go to the &#8220;Players&#8221; tab in the left pane and list the usernames you want to &#8220;ban&#8221;, meaning they can&#8217;t play on your server, or &#8220;whitelist&#8221;, meaning they can&#8217;t play on your servers are allowed.<\/li>\n<li>Third, the Worlds tab in the left pane gives you the option to upload existing Minecraft worlds as .zip files.  If you want to download the world your server is already in, you can do it on this tab.<\/li>\n<\/ol>\n<h3>How to connect your server with Minecraft Java or Bedrock Edition<\/h3>\n<p>With the server up and running, now it&#8217;s time to invite your friends over and play Minecraft.  The process of connecting your server to Minecraft or Java edition is relatively the same.  Follow these steps to join and play on your new free Minecraft server:<\/p>\n<ol>\n<li>First go to the server&#8217;s homepage and make sure your server is the same version as your Minecraft.<\/li>\n<li>Second, copy the server address by clicking the copy icon that looks like two sheets of paper on top of each other.<\/li>\n<li>Third, if you haven&#8217;t already, click the &#8220;Start&#8221; button and open Minecraft on your PC, console, or mobile device.<\/li>\n<li>Fourth, after opening Minecraft, click on the “Multiplayer” option on the Minecraft homepage.<\/li>\n<li>Fifth, click the Direct Connect button on the multiplayer screen.<\/li>\n<li>Sixth, enter the server address you copied from Aternos and click the &#8220;Join Server&#8221; button.<\/li>\n<\/ol>\n<p>And how to create a server on minecraft to create a free minecraft server on java &#038; bedrock.<\/p>\n<p><strong>Minecraft<\/strong> is currently available on PC, Mobile, Playstation, Xbox and Nintendo Switch.<\/p>\n<p id=\"breadcrumbs\">Attack of the Fanboy \/ GAME GUIDE \/ How to Make a Minecraft Server on Java &#038; Bedrock for Free<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Minecraft Gamers who want to play with their friends might think that creating and hosting an online server is a <\/p>\n","protected":false},"author":1,"featured_media":493,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/492"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=492"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/492\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/493"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=492"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=492"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=492"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}