{"id":542,"date":"2022-06-08T00:31:39","date_gmt":"2022-06-08T00:31:39","guid":{"rendered":"https:\/\/minecraft101.site\/create-minecraft-servers-for-free-how-it-works\/"},"modified":"2022-06-08T00:31:39","modified_gmt":"2022-06-08T00:31:39","slug":"create-minecraft-servers-for-free-how-it-works","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/create-minecraft-servers-for-free-how-it-works\/","title":{"rendered":"Create Minecraft servers for free &#8211; how it works!"},"content":{"rendered":"<p>Minecraft continues to be one of the most popular games out there.  The game is now available for various platforms such as Windows, Mac, PS4, Xbox One or Android\/iOS.  There has always been a multiplayer, in which you can build together with your friends in a world. <\/p>\n<p><strong>Unfortunately, it usually costs money to rent a Minecraft server.<\/strong> <strong>However, there are also ways to play together for free.<\/strong> <strong>We show you how to do this in our article on Technology Capital!<\/strong><\/p>\n<h2>Possibility 1 &#8211; play together via LAN<\/h2>\n<p>If you are in the same network, i.e. in the same WLAN or LAN, you don&#8217;t need a server to play together.  One of the players can simply open their single-player world in the LAN and the others can now join this world like a multiplayer server &#8211; without any additional effort.<\/p>\n<p>Just click on &#8220;Open in LAN&#8221; and you should see an IP for your friends to join in the chat.<\/p>\n<p>However, as mentioned, this option is only available if all devices are in the same network.  So if you are in different places, this is unfortunately not that easy.<br \/>Likewise, players of the Java version on PC can only play with other people who also own the Java version, while there is also crossplay in all other Minecraft versions.     <\/p>\n<p>In this article we will show you where the difference between the Java and Windows 10 Edition lies!<\/p>\n<h2>Possibility 2 – host the server yourself<\/h2>\n<p>Unfortunately, this method is a bit more complicated than the first method, but it should be possible for everyone with a short read-in.  Unfortunately, it has the disadvantage that your server is only online as long as the PC on which the server is hosted is online.<\/p>\n<p>First of all, you have to download the server from the game from the official Minecraft website from the developer Mojang.  But note that this is only compatible with the Java version.<\/p>\n<p>Now whoever wants to host the server has to run the Minecraft server on their computer.  Using the cmd command &#8220;localhost&#8221;, he can now find out his IP, which the other players can use to join the server.  Ideally, the player with the best internet and the best PC will host your Minecraft server.  Additional ports may have to be released, but we cannot give you any more precise instructions.  You can also find more detailed instructions on the Minecraft Wiki!  (English)<\/p>\n<p>If you need a new gaming PC to host your server, you will find cheap offers here![Anzeige]<\/p>\n<p>With each of the options mentioned, your server only stays online as long as the hosting PC is switched on.  For permanent availability, however, it is more worth renting a server from the usual hosters than leaving your PC on permanently.  We&#8217;ll show you how to do this in a separate article!<\/p>\n<p>Thank you for reading!  We hope that we could help you!  You can find more articles about Minecraft here!  For the Tech Capital main page click here!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Minecraft continues to be one of the most popular games out there. The game is now available for various platforms <\/p>\n","protected":false},"author":1,"featured_media":543,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/542"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=542"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/542\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/543"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=542"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=542"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=542"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}