{"id":683,"date":"2022-06-11T11:47:37","date_gmt":"2022-06-11T11:47:37","guid":{"rendered":"https:\/\/minecraft101.site\/tips-and-tricks-for-getting-started-with-the-popular-game\/"},"modified":"2022-06-11T11:47:37","modified_gmt":"2022-06-11T11:47:37","slug":"tips-and-tricks-for-getting-started-with-the-popular-game","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/tips-and-tricks-for-getting-started-with-the-popular-game\/","title":{"rendered":"Tips and tricks for getting started with the popular game"},"content":{"rendered":"<p><strong>The classic Minecraft has been experiencing a renaissance for several months.  However, the game has become so complex that the survival mode can be a bit intimidating for beginners.  But nothing so wild: With our tips you can build a magnificent property in no time.<\/strong><\/p>\n<p>Last year we gave you some general Minecraft tips for the Switch version of the game.  Among other things, it was about the gameplay, texture packs and the different biomes.  This time, we&#8217;re going to be specifically covering how to get into Survival mode so that the first few hours aren&#8217;t too frustrating.<\/p>\n<h2 id=\"ftoc-heading-1\" class=\"ftwp-heading\"><strong>The entry point in Survival mode<\/strong><\/h2>\n<p>First of all, you should know a few things about the spawn point of your character: You start your Minecraft adventure in a freshly generated world, at a point that is within a few hundred blocks of the center, i.e. at the coordinate 0;0.  If you press the F3 key, a lot of information appears on the top left of the screen.  Approximately in the middle of the information field you will see the information about &#8220;XYZ&#8221;, i.e. the three axes that show your exact position in the game.  The middle indication (Y) is perhaps not so important for the initial orientation &#8211; it shows the position in the vertical.  If you get lost and don&#8217;t know where your base is, you should try to return to coordinate 0;0 and look for your base from there.<\/p>\n<p>If you crafted a compass later in the game, the needle will always point to this central spawn point.  It can therefore be advisable to build the first dwelling not far from it.  If you haven&#8217;t made a bed in the game yet, you&#8217;ll also end up back at the original spawn point when you die.  In fairness, the game ensures that the point is (more or less) secure so you don&#8217;t resign right away.  We recommend that you set up your first base not too far from the 0;0 coordinate and, if possible, on the water.  A small lake is already completely sufficient, so that later, for example, your grain will thrive magnificently.<\/p>\n<p><\/p>\n<p class=\"wp-caption-text\">Such a village offers important resources in Minecraft.  &#8211; Picture: <strong>picture alliance \/ Georg Wendt \/ dpa<\/strong><\/p>\n<h2 id=\"ftoc-heading-2\" class=\"ftwp-heading\"><strong>Necessary first steps in the game<\/strong><\/h2>\n<p>There is a day-night cycle in Minecraft.  While there are many ways to die during the day (the heart meter shows your life energy), it becomes even more dangerous at night.  Zombies, exploding Creepers, skeletons with bows and arrows, spiders, and (when sleep deprived) flying phantoms make the darkness a real gauntlet for unprotected newcomers.  Therefore, in the beginning it is important not to waste too much time and start collecting resources.<\/p>\n<p>In the first step you collect wood by removing blocks from trees with your bare hands (left mouse button).  Then press &#8220;E&#8221; to open your inventory.  Here you can craft basic things and also see clothing\/armor and other equipment of your character.  The really good stuff, however, is made with the help of a workbench.  It is very easy to craft: drag the wooden blocks into the 2&#215;2 crafting field.  The symbol for the wooden planks then appears on the right.  Drag some of them into your inventory &#8211; if you put items in the bottom row, you can select and use them (use the mouse wheel to scroll or switch between the items).  The right mouse button is the action button, the left one is primarily for cutting\/hitting.  If you fill all four crafting fields with wooden boards &#8211; whether oak, birch or another type of wood &#8211; the workbench (in English &#8220;crafting table&#8221;) appears on the right.  Drag them to the selection bar and place them anywhere you like with the right mouse button.  Maybe there, where you also want to build your first hut.<\/p>\n<p>When you collect the first raw materials, explore the area and lose track of time, dusk usually comes faster than expected.  As a beginner, the best way to get through the night is in a bed that is in a safe place.  Around your original spawn point there is usually a village from which you will probably steal one or the other resource.  Find a hut with a bed and cheekily lie down in it (right mouse button).<\/p>\n<p><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" frameborder=\"0\" name=\"\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https:\/\/www.youtube-nocookie.com\/embed\/e-LpPTnme_M?iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=1&amp;autoplay=0\" width=\"480\" height=\"270\"><\/iframe><\/p>\n<h2 id=\"ftoc-heading-3\" class=\"ftwp-heading\"><strong>Important items for survival<\/strong><\/h2>\n<p>Incidentally, you can also simply remove the stranger&#8217;s bed, collect it and set it up at any point &#8211; probably your first small hut.  By the way, if you take beds and raw materials from the village, partially dismantle the huts and stalk the vegetables from the beds, the village will almost certainly be orphaned quickly.  Your first Minecraft house will probably be made of wood or simple quarry stone.  In order to collect rubble and not having to laboriously remove everything with your hands, you should craft a pickaxe at the workbench as quickly as possible.  The simplest variant consists only of wood.  First, craft sticks &#8211; this can be done both in the inventory and at the workbench by arranging two of them one below the other.<\/p>\n<p>Video: Own creation<\/p>\n<p>Then just place three wooden planks in the top row and in the bottom two squares of the middle vertical.  If you have removed some quarry stone from the earth or stone houses, you can craft a better pickaxe by filling the top three crafting fields with quarry stone.  The iron pickaxe is even better &#8211; but it&#8217;s best to keep it, because you need it to mine gold and diamonds.  A gold pickaxe is very effective but breaks easily, and the diamond one is second to none.  Select the workbench&#8217;s book icon to view the recipes for new items.  Other important items in Minecraft include the sword, a simple door for your hut, torches to light up caves and living quarters, and a furnace, which is used to craft other materials and items.<\/p>\n<p>You craft an oven by filling all fields except the middle one with quarry stone.  Once placed, fuel is also required.  The best thing to do is to build up a supply of charcoal.  Glass bricks, which serve as simple windows, are made by melting sand (off the deserts, mainly near water) with coal in the furnace.  You can also make your meat edible here by leaving it in the oven for a while.  The food fills up your inventory quickly, so it&#8217;s best to store it in a chest.  You either remove chests from the village or you create one yourself by filling all the crafting fields on the workbench with wooden boards.  If you place two boxes next to each other, they automatically become one long chest.  We recommend always keeping things tidy and storing the items in different chests, sorted by category, so that you can always find what you need quickly.<\/p>\n<p><img class=\"aligncenter wp-image-99133 size-full\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/Tips-and-tricks-for-getting-started-with-the-popular-game.png\" alt=\"GigaCube\" width=\"1920\" height=\"1080\"\/><\/p>\n<h2 id=\"ftoc-heading-4\" class=\"ftwp-heading\"><strong>Satisfy the Hunger in Minecraft &#8211; Your First Wheat Harvest<\/strong><\/h2>\n<p>When your life energy is running low, there is only one way to regenerate quickly: filling up the food bar.  This means the ten legs of meat on the bottom right, which stand for 20 food points.  So half a leg represents one food point.  There are countless foods in Minecraft: the meat and milk of animals, all kinds of vegetables and recently even honey, which you can generate yourself with beehives in your base.  Growing fruits, vegetables and grains is perhaps the most important and most controllable food source.  To till your land, first create a few conditions:<\/p>\n<p>First you organize some seeds &#8211; in the village you will surely find wheat, which is the basis for making bread.  If you harvest it, you will also get your hands on the valuable wheat seeds.  Now you are looking for a nice free piece of land that is on the water.  Alternatively, you can simply dig water ditches (it works best with a shovel) so that the soil is nice and moist and fertile.<\/p>\n<p>Video: Own creation<\/p>\n<p>Now you have to craft a hoe at the workbench.  For starters, a simple pickaxe made of wood or stone is absolutely sufficient.  To do this, you pack one unit of the material from which the blade of the hoe is to be made into the first two fields of the top row.  In addition to wooden boards and quarry stone, later iron, gold and diamonds are also possible.  A stick for the handle of the hoe is placed in the bottom two fields of the middle vertical row.  If you hold the hoe in your hand, you can turn the ground into farmland field by field with the right mouse button.  If the soil is moist enough, the arable land should become significantly darker after a short time.<\/p>\n<p>Immediately after creating the field, you take the seeds in your hand and plant them in the ground with the right mouse button.  It takes a while for the wheat to grow to its full size and turn golden.  Then it can be harvested, even with bare hands.  Don&#8217;t forget to replant the seeds you have obtained.  If the growth process is taking too long for you, there is a trick to speed it up.  However, as a beginner you probably won&#8217;t like it: you have to kill skeletons and collect their bones.  If you process them into bone meal and spread this generously over the bed, the harvest is ready in no time.  However, you can also use the bones to turn a wolf into a faithful canine companion.<\/p>\n<h2 id=\"ftoc-heading-5\" class=\"ftwp-heading\"><strong>How to become a rancher<\/strong><\/h2>\n<p>Most livestock and pets are suitable for breeding.  We recommend using sheep and cows as your first livestock.  Craft a supply of simple fence elements from sticks and wooden boards and use them to mark out an area of ​​grassy pasture.  You also need a gate.  More practical than the gate is a piece of carpet on the fence that gives you access without the animals escaping.  However, you need wool – and first of all, sheep.  Just like cows, they can be lured to your base quite easily if you are holding a bundle of wheat in your hand.  If two animals are trapped in the pen, use Wheat on them to make them multiply.<\/p>\n<p>The sheep bring you mutton and the wool mentioned above, which will later be an important material for you.  You also win them if you slaughter the lambs;  more effective, however, is the use of scissors, which are crafted from two iron ingots.  You catch the milk of the cows with a bucket.  They also deliver beef and leather to you after the slaughter.  Leather is also an important material.  For example, the simplest type of armor and books are made (in part) of it.<\/p>\n<p><img class=\"aligncenter wp-image-63505 size-full\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654948057_163_Tips-and-tricks-for-getting-started-with-the-popular-game.png\" alt=\"GigaTV Movie Highlights\" width=\"1920\" height=\"1000\"\/><\/p>\n<h2 id=\"ftoc-heading-6\" class=\"ftwp-heading\"><strong>How to proceed for you in Minecraft<\/strong><\/h2>\n<p>If you have a safe place to stay, the most important tools and enough food, you can devote yourself to other things, such as finding diamonds, building a nether portal or finding the ender dragon.  Survive raids, explore biomes such as jungles and icy snowy landscapes, build a rail network and enormous structures that can be seen from far away.  Keep parrots, foxes, dogs, cats and even polar bears or skeleton horses as pets.  If you are tech-savvy, the world of redstone mechanics awaits you.  You should discover all this on your own.<\/p>\n<p>Could we help you with our tips on Minecraft?  What tricks should beginners know?  Recommend them to the featured community by leaving us a comment here!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The classic Minecraft has been experiencing a renaissance for several months. However, the game has become so complex that the <\/p>\n","protected":false},"author":1,"featured_media":687,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/683"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=683"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/683\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/687"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=683"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=683"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}