{"id":688,"date":"2022-06-11T14:43:58","date_gmt":"2022-06-11T14:43:58","guid":{"rendered":"https:\/\/minecraft101.site\/which-notebook-for-minecraft-an-overview-for-every-budget\/"},"modified":"2022-06-11T14:43:58","modified_gmt":"2022-06-11T14:43:58","slug":"which-notebook-for-minecraft-an-overview-for-every-budget","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/which-notebook-for-minecraft-an-overview-for-every-budget\/","title":{"rendered":"Which notebook for Minecraft?  An overview for every budget"},"content":{"rendered":"<p>We are often asked whether device XY can be used to play Minecraft, or how well it would go.  Not that unusual, because the system requirements and requirements for Minecraft are anything but clear.  Therefore, I would like to summarize a few tips and recommendations for you here as to what kind of device you need to be able to play Minecraft smoothly &#8211; of course there is something for every budget, including the upcoming ray tracing in Minecraft.<\/p>\n<p>As a basis I use version 1.12.2 of Minecraft under Microsoft Windows 10 64 bit.  Depending on the device, software version or mod or texture pack, the results may vary.<\/p>\n<h2><strong>Last updated:<\/strong> January 2020<\/h2>\n<p>Anyone who does not have high demands on the display quality or does not necessarily need short loading times can find what they are looking for for very little money.  A little optimization with the mod &#8220;optifine&#8221; is necessary, but everyone should be able to do it.  Ultimately, the decisive factor for Minecraft is primarily the processor.  It is best to have a quad-core processor here so that it runs smoothly.  Minecraft actually only supports a single processor core, but the Optifine modification mentioned above uses all four processor cores, which leads to significantly higher performance.<\/p>\n<h2>Entry-level devices under 400 euros<\/h2>\n<p>A recommendable processor in the very low segment is, for example, the Pentium N4417U.  The Ryzen 3200U is also recommended and comes with a much more powerful integrated graphics unit (Vega 3).  Both processors are already available in the price segment around 300 euros.  The integrated graphics card of the N4417U is also sufficient for Minecraft.  If you want to invest a little more, you can also use an Intel Core i3 processor.<\/p>\n<p>AMD is currently starting with the Lenovo V155-15API.  However, the operating system is still missing here.<\/p>\n<p><\/p>\n<p>If you don&#8217;t want to tinker, you can directly access another model from Lenovo: the Lenovo V130-15IKB.<\/p>\n<p>You can currently get an Intel Core i5 processor in the HP 250 G7 for less than 400 euros*.  It is clearly superior to the above.  With the UHD 620, it offers a graphics solution that beats the AMD processor&#8217;s Vega 3 chip by around 20%.  It also comes with a full HD display and 8GB RAM, which should be the minimum for future-proof surfing.<\/p>\n<p>The bottom line is that Minecraft runs smoothly in this context, at least in HD resolution (1366&#215;768 pixels) and low graphics settings.  The exception is the HP 250 G7.  In terms of performance, he actually plays a league higher.  You still have to add Windows for this.<\/p>\n<p>Windows 10 on Notebooksbilliger.de<\/p>\n<h2>Middle class from 450 euros<\/h2>\n<p>With a slightly higher budget, Minecraft can be played smoothly without any restrictions on the graphics settings.  Resolutions up to Full HD (1920 x 1080 pixels) are no problem.  It all starts with a Core i5 processor including integrated Intel HD graphics, and there are currently corresponding notebooks for less than 450 euros.  Here, too, one should not do without the optimization mentioned above.<\/p>\n<p><img title=\"source: imgur.com\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/Which-notebook-for-Minecraft-An-overview-for-every-budget.png\" alt=\"\"\/><\/p>\n<p>An old acquaintance comes here for around 500 euros* and already comes with an operating system and faster SSD storage: HP 250 G7 6HM85ES.<\/p>\n<p>The HP 15-da2133ng is a whole lot stronger and has a dedicated graphics card.  Here you get a CPU of the latest generation and an MX 110 from Nvidia.  So you are well prepared for Minecraft.<\/p>\n<p>It&#8217;s always faster, of course, for example with the Asus M570DD-E4003T, which comes with a dedicated graphics card from NVIDIA.  With the GTX 1050, nothing stands in the way of performance-hungry modifications.  Windows 10 is also included.  You can currently get the Asus M570DD for about 680 euros*.<\/p>\n<p>Nowadays, an SSD should not be missing.  Devices equipped with an SSD are simply faster, smoother and more pleasant to use.  If you can or want to do some tinkering yourself, you can also swap the HDD for an SSD in each of the devices mentioned above.  The Acer Aspire 5 (A514-52-58NK) is recommended for fans of finished systems.  Here you can get the built-in components in a very portable form factor of 14 inches.  For me personally, the sweet spot between mobility and pleasant working\/gaming.<\/p>\n<h2>High end from 700 euros<\/h2>\n<p>That leaves only those of you who want to use shaders, HD textures or modpacks in Minecraft.  This is where the graphics card becomes important.  An Intel Core i7 or Ryzen 7 along with a powerful graphics card such as the nVidia GeForce GTX 1650 are at least mandatory.<\/p>\n<p><img title=\"source: imgur.com\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1654958638_156_Which-notebook-for-Minecraft-An-overview-for-every-budget.jpg\" alt=\"\"\/><\/p>\n<p>Suitable devices are already available here quite cheaply, such as the Asus TUF Gaming FX505DT-BQ331, which even comes with a GeForce GTX 1650.  The limiting factor here is the relatively small main memory, which you can easily expand.  It&#8217;s yours for 750 euros*.  However, you have to buy Windows again here.<\/p>\n<p>There are no compromises with the HP Omen 15.  It did very well in the test and is therefore definitely worth recommending.<\/p>\n<p>Absolute high-end fans who may also want to play in 4K will have to dig much deeper into their pockets.  The MSI GL63 8SFK-696 offers everything for enthusiasts, but also has a correspondingly high price tag of currently 1700 euros*.<\/p>\n<h2>Minecraft gets ray racing<\/h2>\n<p>Recently, Nvidia also announced DXR or ray tracing for Minecraft.  Of course, this makes the block world even more attractive.  The following video gives you a foretaste:<\/p>\n<p>Playing back the content establishes a connection to the provider and transfers personal data.  More information in our privacy policy.<\/p>\n<p>If you don&#8217;t want to miss out on ray tracing in Minecraft, you should rely on a notebook with an RTX graphics card from Nvidia.  The mentioned MSI GL63 8SFK-696 with RTX 2070 comes into question here.  With the RTX 2060, the ASUS ROG Strix G731GV-EV190 is also a bit cheaper.  We have already tested a similar device from ASUS.<\/p>\n<p>Of course, you can also gamble in 4K UHD without an external display – but the price should then be more of a deterrent, as it makes the aforementioned appear really cheap.  A current top model with a 4K display and high-end components around one gigabyte AERO 15. We have also tested a sister model for you here.<\/p>\n<\/p>\n<p>*All prices as of November 22, 2019<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are often asked whether device XY can be used to play Minecraft, or how well it would go. Not <\/p>\n","protected":false},"author":1,"featured_media":689,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/688"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=688"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/688\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/689"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=688"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=688"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=688"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}