{"id":702,"date":"2022-06-11T17:15:37","date_gmt":"2022-06-11T17:15:37","guid":{"rendered":"https:\/\/minecraft101.site\/10-years-of-minecraft-the-cult-game-in-fast-motion\/"},"modified":"2022-06-11T17:15:37","modified_gmt":"2022-06-11T17:15:37","slug":"10-years-of-minecraft-the-cult-game-in-fast-motion","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/10-years-of-minecraft-the-cult-game-in-fast-motion\/","title":{"rendered":"10 years of Minecraft: The cult game in fast motion"},"content":{"rendered":"<p><strong>Minecraft turns ten years old.  We review the success story from the first click to one of the most successful video games of all time.  What&#8217;s next and why is there no Minecraft 2 yet?  You can find answers here at featured.<\/strong><\/p>\n<p>The original concept of Minecraft is simple.  You explore a block-shaped open world (see Open World Games).  There you collect resources (raw materials, food) and use them to build tools, swords, shields and – here we come to the core competence – buildings.  Every size, every style is conceivable and can be implemented, from a stylish design house to a Greek garden.<\/p>\n<h2 id=\"ftoc-heading-1\" class=\"ftwp-heading\"><strong>Minecraft: Make the world as you like it<\/strong><\/h2>\n<p>There are different game modes in Minecraft.  In survival mode you have to take care of food, protect yourself from zombies and other attackers and finally defeat the boss in another dimension.  If you are looking for a special challenge, you can use the hardcore mode.  If you die there, you can only participate as a spectator or delete the world if you created it yourself.<\/p>\n<p>The creative mode dispenses with the struggle for survival, makes the exploitation of resources child&#8217;s play and offers you completely new possibilities with the ability to fly.  Incidentally, this is also where you create the worlds for the adventure mode.  In this you build exciting worlds with different focuses, for example survival or jump-and-run.  You can share the files created in this way in forums and communities.  Other players only need to install them and then explore them.<\/p>\n<p><\/p>\n<p>And in spectator mode, you can take on the perspective of other players or explore the world through the eyes of the creatures on the fly.<\/p>\n<p>Players have now created countless of their own modes on their own servers.  Physics, goals and game mechanics are very individual.  From new food and tools to graphic adjustments to new (survival) living conditions, there is everything.<\/p>\n<h2 id=\"ftoc-heading-2\" class=\"ftwp-heading\"><strong>Minecraft History: From pastime game to classroom subject<\/strong><\/h2>\n<p><strong>2009 <\/strong>Swedish game developer Markus &#8216;Notch&#8217; Persson publishes a first demo of Minecraft in an online forum.<\/p>\n<p><strong>2010 <\/strong>Persson has already quit his regular job and is concentrating on Minecraft full-time.  The first major update, the alpha version, brings new items, implements survival mode and tweaks the game physics.  With the money earned, Persson founds the Mojang studio.  Fifty people attend the first Minecraft Convention.<\/p>\n<p><strong>2011 <\/strong>the official version 1.0 (today: Minecraft Classic) will be released at MineCon 2011.  In addition, a version optimized for mobile devices will appear with Minecraft Pocket for Apple iOS.  In the same year, Jens &#8216;Jeb&#8217; Bergensten of Sweden becomes the lead developer and designer at Mojang.<\/p>\n<p><strong>2012<\/strong> Minecraft is now conquering children&#8217;s rooms in an analogous way thanks to a license partnership with Lego.  The game will also be released for the Xbox 360. Another update implements bats, witches and scary creatures.<\/p>\n<p><strong>2013<\/strong> Minecraft appears for Playstation 3. More important: Mojang is updating the game again.  So extensive this time that from now on it will be listed in Minecraft history as The update that changed the world.  In Sweden, Minecraft will even be introduced as a compulsory subject in schools at this point.<\/p>\n<p><strong>2014<\/strong> Microsoft buys Studio Mojang, including Minecraft, for the equivalent of around 2.2 billion euros.  The game was released for Playstation 4, Playstation Vita and Xbox One in the same year.<\/p>\n<p><strong>2015<\/strong> Nintendo Wii owners can finally play Minecraft.  In addition, Minecraft: Story Mode, an episodic point-and-click spin-off, will be released in cooperation with the game studio Telltale Games.<\/p>\n<p><strong>2016 <\/strong>brings an update polar bears and ice walkers into the game.  And with Minecraft: Education Edition, there is now an official offshoot for school lessons, which is intended to bring children closer to working together and creatively on problems, among other things.  A virtual reality version is also appearing on various platforms with Minecraft VR.<\/p>\n<p><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" frameborder=\"0\" name=\"\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https:\/\/www.youtube-nocookie.com\/embed\/hl9ZQiektJE?iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=1&amp;autoplay=0\" width=\"480\" height=\"270\"><\/iframe><\/p>\n<p><strong>2017<\/strong> Minecraft finally jumps to the Nintendo Switch too.  With the Better Together update, players can play together across platforms (Xbox One, PC and Mobile).  With Minecraft: The Island, bestselling author Max Brooks delivers the first Minecraft novel.<\/p>\n<p><strong>2018 <\/strong>follows the Nintendo Switch with the Better Together update.  An update brings all sorts of sea creatures to the world of Minecraft.  But also… the phantom!<\/p>\n<p><strong>In 2019, Minecraft celebrates its tenth birthday. <\/strong>Thanks to the extensive update Village &#038; Pillage, players will discover numerous new characters, items, blocks &#8211; and pandas.  Microsoft is now also including the game in its gaming flat rate: The Xbox Game Pass.  Minecraft AR is a brand new mobile game in the style of Pokémon Go and Ingress.<\/p>\n<h2 id=\"ftoc-heading-3\" class=\"ftwp-heading\"><strong>Minecraft 2029: Future, Movies, Building Franchises<\/strong><\/h2>\n<p>If the Minecraft developers have their way, Minecraft 2029 will eventually be released on Mars.<\/p>\n<p>In real life, on March 4th, 2022, a live action Minecraft movie is coming our way.  The exact storyline is yet to be revealed, but the core of the story is about a group of friends who must save the Minecraft world from the horrific ender dragon.  Warner Bros. acquired the film rights back in 2014 and originally planned to release a film this year.  However, the project was then put on hold.<\/p>\n<p>The topic Minecraft 2 does not seem to be, at least for Microsoft itself.  Minecraft is so strong mainly thanks to its community.  A new main game could split the fan community.<\/p>\n<p><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" frameborder=\"0\" name=\"\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https:\/\/www.youtube-nocookie.com\/embed\/HJicIi8Lvx0?iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=1&amp;autoplay=0\" width=\"480\" height=\"270\"><\/iframe><\/p>\n<p>In 2019, on the other hand, PC owners can look forward to it.  Minecraft: Dungeons is a new branch of the Minecraft universe.  In the fantasy adventure you explore different dungeons and caves.  The game is based on the classic role-playing subgenre dungeon crawl.<\/p>\n<p>What would you like from Minecraft in the future?  Build us your suggestions in the comment cave!<\/p>\n<p>Cover photo: Minecraft<\/p>\n<h3>You might also be interested in this<\/h3>\n","protected":false},"excerpt":{"rendered":"<p>Minecraft turns ten years old. We review the success story from the first click to one of the most successful <\/p>\n","protected":false},"author":1,"featured_media":704,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/702"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=702"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/702\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/704"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=702"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=702"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=702"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}