{"id":745,"date":"2022-06-12T03:50:37","date_gmt":"2022-06-12T03:50:37","guid":{"rendered":"https:\/\/minecraft101.site\/how-to-set-up-minecraft-so-your-kids-can-play-with-friends-online\/"},"modified":"2022-06-12T03:50:37","modified_gmt":"2022-06-12T03:50:37","slug":"how-to-set-up-minecraft-so-your-kids-can-play-with-friends-online","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/how-to-set-up-minecraft-so-your-kids-can-play-with-friends-online\/","title":{"rendered":"How to set up Minecraft so your kids can play with friends online"},"content":{"rendered":"<p align=\"center\"><\/p>\n<p>Your kids love Minecraft, your friends love Minecraft, and they want to play it together when they&#8217;re not in the same physical location &#8211; and they&#8217;re asking you to make that possible.  Don&#8217;t worry, you don&#8217;t have to figure it out on your own: we&#8217;re here to help.<\/p>\n<p>Setting up a private server for your kids and their friends to play Minecraft is a great way to create a safe place for them to enjoy the wildly popular game.  Unlike public servers, a private server only has players you know (your child and the friends and family members you specifically allow to join).  Additionally, the issues that plague large and poorly moderated servers, such as swearing, inappropriate content and behavior, or griefing (where players antagonize another player by usually destroying things or stealing their stuff) will either not exist on a private server or, when they show up, you&#8217;ll know who the culprit is and can chat with their parent.<\/p>\n<p>There are four ways to do this.  In the following sections, you&#8217;ll see all four, ranked by ease of use—easiest to most difficult.<\/p>\n<p>If you are looking to find out more about Minecraft in general, the game your child and all their friends are obsessed with, we highly recommend checking out our parents&#8217; guide to Minecraft if you have a solid grasp of the game with parental concerns in mind want.  For a deeper dive, check out our extended series on the game here.  With your basic questions about the game answered through these articles, we can focus on the big question: how to safely get your child online so they can play with their friends.<\/p>\n<h2>Option One: Buy a Minecraft game for dead simple shared play<\/h2>\n<p align=\"center\"><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655005834_437_How-to-set-up-Minecraft-so-your-kids-can-play.jpg\"\/><\/p>\n<ul>\n<li><strong>  Advantages: <\/strong> Dead easy.  Hosted by the company behind Minecraft.<\/li>\n<li><strong>  Disadvantages: <\/strong> Only supports 10 players.  No advanced features (Relatively) expensive.<\/li>\n<li><strong>  Suitable for: <\/strong> Who wants to have an online server without much hassle right this second.<\/li>\n<\/ul>\n<p>The simplest and easiest solution is to buy a Minecraft Realms subscription.  Minecraft Realms is the only officially hosted Minecraft server platform in the world as it is hosted and maintained directly by Mojang, Minecraft&#8217;s parent company.<\/p>\n<p>For $7.99 per month (first month is free so you can try it out) you get an easily accessible and always up-to-date Minecraft server with three world slots (so your kids can spin out which Minecraft worlds they play on ) as well as a set of mini-game templates if they want your friends to play mini-games.<\/p>\n<p>The Realms servers are strictly whitelisted, which means players must be manually approved to gain access to the server &#8211; a random person can never enter the server with your children.  You can support up to 10 players.<\/p>\n<p>If your kids just want to play Minecraft with friends, have no interest in playing with Minecraft game mods or server plugins (advanced tools that extend the functionality of Minecraft) just need space for 10 or fewer players, then it&#8217;s a Easy as pie to get a Minecraft Realms account.<\/p>\n<p>We have a step-by-step guide to setting up a Realms account that you can run right in your child&#8217;s copy of Minecraft.  Better still, we even have a guide to finding local Minecraft worlds and uploading them to Minecraft Realms so you can take the world your kid and friends worked in to your Realms world hiccup.<\/p>\n<h2>Option 2: Third-party hosts are flexible but more at hand<\/h2>\n<p align=\"center\"><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/How-to-set-up-Minecraft-so-your-kids-can-play.png\"\/><\/p>\n<ul>\n<li><strong>  Advantages: <\/strong> Best price performance ratio.  Host more players for less.  Supports plugins and advanced features.<\/li>\n<li><strong>  Disadvantages: <\/strong> Requires more hands-on configuration and parental involvement.<\/li>\n<li><strong>  Best for: <\/strong> Parents who are familiar with Minecraft and do some manual setup (or older kids who can do it themselves).<\/li>\n<\/ul>\n<p>If you&#8217;re willing to put a little extra energy into the project (or you have a very tech-savvy kid who can), then consider buying a third-party Minecraft host.<\/p>\n<p>There are a variety of benefits that come with using a third-party host over a Realms server.  First and foremost, you get more bang for your buck: for the $8 a month you spend on a Realms server, you get a third-party host that supports more players (typically 20 or more at this price point).<\/p>\n<p><strong>  RELATED : <\/strong> <strong>  How to choose a remote Minecraft host <\/strong><\/p>\n<p>Additionally, most hosts will include support for plugins that extend Minecraft with cool features, a subdomain, so your kids server will have a catchy name like &#8220;coolkidsbuilding.someMChost.com&#8221;.  and a good host will even have a web-based control panel where you can control the server (like managing the whitelist and turning plugins on and off).<\/p>\n<p>The downside is that you get more bang for your buck -Bucks, than buying a Realms account you also get more work: it&#8217;s up to you to ensure, for example, that the whitelist is enabled and you will be responsible for to manage all the great extras that come with an advanced host.<\/p>\n<p>It&#8217;s absolutely more work than just buying a Realms server subscription, but it&#8217;s also way more flexible.  If you&#8217;re willing to have more hands or have a kid mature enough to be their own server admin, get a cheap hosting plan from a reputable third-party hosting service like BeastNode or MCProHosting.  Need help comparing and comparing features to make an informed purchase?  Check out our guide to choosing a remote Minecraft host.<\/p>\n<h2>Option 3: Host It at Home &#8211; Your hardware, your hassle<\/h2>\n<p align=\"center\"><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655005835_467_How-to-set-up-Minecraft-so-your-kids-can-play.png\"\/><\/p>\n<ul>\n<li><strong>  Advantages: <\/strong> Your only expense is electricity.  You have total control over everything.<\/li>\n<li><strong>  Disadvantages: <\/strong> You have to install and configure everything.  You supply the hardware.  There is no quick launch or friendly dashboard.<\/li>\n<li><strong>  Best for: <\/strong> Parents who are very knowledgeable about Minecraft and computers in general (or for older kids who like to get hands on).<\/li>\n<\/ul>\n<p>If you consider yourself the geeky type and you&#8217;re not afraid to manage every aspect of a Minecraft server for your kids (or you have kids who can handle all of this on their own), then you can host a Minecraft server right from the comfort of your own home let run.<\/p>\n<p>One at the top: you have total control over the whole process, you can opt for the server software you want, the files are stored right at home, and the entire game is played right at home.  We have guides for setting up Mojang&#8217;s vanilla Minecraft server platform or a third-party server platform like Spigot that supports plugins.<\/p>\n<p>The downside: if you want to use the server 24\/7, you&#8217;ll have to leave a computer on 24 hours a day (that&#8217;ll cost you as much electricity a month as a cheap Minecraft host).  You need enough hardware to run the server smoothly.  You&#8217;ll have to fiddle with setting up port forwarding rules to allow external access to the server (so your child&#8217;s friends can join), and while you&#8217;re at it you&#8217;ll probably need to set up a dynamic DNS address so friends can easily find the server , even if your private IP address changes.<\/p>\n<p>Running a custom server from home is exactly what we do in my household (and I have a lot of fun with it), but not everyone has a home server that they already run 24\/7 anyway, nor the desire to mess with and maintain the server.<\/p>\n<h2>Option 4: Sharing a LAN game where a big headache awaits<\/h2>\n<p align=\"center\"><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655005836_170_How-to-set-up-Minecraft-so-your-kids-can-play.jpg\"\/><\/p>\n<ul>\n<li><strong>  Advantages: <\/strong> Requires no server software or any knowledge of game or server settings.  Free.<\/li>\n<li><strong>  Disadvantages: <\/strong> Requires changing a router setting every time your child.<\/li>\n<li><strong>  Best for: <\/strong> Kids sharing a game once with a friend in blue moon (but really, it&#8217;s not the best for anyone).<\/li>\n<\/ul>\n<p>We&#8217;re nothing if not thorough, and we&#8217;re including that last entry not so much as a tip, but as a likely-no tip.  Your child might suggest that all you have to do to get them and their friends playing is figure out how to connect the local play feature to the internet &#8211; we&#8217;re here to tell you it&#8217;s not worth it .<\/p>\n<p>If two people are playing Minecraft on the same network (e.g. your kid and her friend are playing Minecraft on two laptops in your house), one of them can use the &#8220;Open to LAN&#8221; feature to share the game locally so that his friends they can join and they can play together.  However, the hoops you have to jump through to make this work over the internet are extremely annoying and way too convenient: every time your kid starts a Minecraft game and uses the &#8220;Open to LAN&#8221; feature, it will it will require you to dig into and change your home router&#8217;s settings (because every LAN game has a random port number that needs an updated port forwarding rule).<\/p>\n<p>We have described the process step by step here.  so feel free to read about it, shake your head and say &#8220;Yeah&#8230;no deal. I&#8217;ll just get a Realms account for her.&#8221; You&#8217;ll be glad you did.<\/p>\n<p>          <img class=\"card-img-top\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655005836_178_How-to-set-up-Minecraft-so-your-kids-can-play.png\" alt=\"Does PowerShell work on other operating systems besides Windows?\"\/><\/p>\n<p>Does PowerShell work on other operating systems besides Windows?<\/p>\n<p class=\"card-text\">It can be very frustrating when your professor says something about PowerShell and various websites prove otherwise.  Does PowerShell actually work on non-windows systems or not?  Today&#8217;s SuperUser Q&#038;A post has the answer to a confused reader&#8217;s question.  Today&#8217;s Q&#038;A session comes thanks to SuperUser &#8211; a subdivision of Stack Exchange, a community-driven grouping of Q&#038;A websites.<\/p>\n<p>(how top)<\/p>\n<p>          <img class=\"card-img-top\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655005837_659_How-to-set-up-Minecraft-so-your-kids-can-play.png\" alt=\"How to manage podcasts in Google Play Music\"\/><\/p>\n<p>How to manage podcasts in Google Play Music<\/p>\n<p class=\"card-text\">You know that the Google Play Music app that comes with your Android phone can subscribe, stream and download podcasts?  The feature works well, although not nearly as sophisticated as the various dedicated podcast managers.  But if you hate extra apps on your phone and are already an avid Play Music user, this might be the step for you.<\/p>\n<p>(how top)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your kids love Minecraft, your friends love Minecraft, and they want to play it together when they&#8217;re not in the <\/p>\n","protected":false},"author":1,"featured_media":746,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/745"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=745"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/745\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/746"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=745"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=745"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=745"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}