{"id":758,"date":"2022-06-12T08:00:17","date_gmt":"2022-06-12T08:00:17","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-rtx-graphics-card-benchmarks\/"},"modified":"2022-06-12T08:00:17","modified_gmt":"2022-06-12T08:00:17","slug":"minecraft-rtx-graphics-card-benchmarks","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-rtx-graphics-card-benchmarks\/","title":{"rendered":"Minecraft RTX: Graphics Card Benchmarks"},"content":{"rendered":"<h2 class=\"anchorHeadline hasIcon\">Minecraft RTX: Graphics Card Benchmarks      <\/h2>\n<p>  How does Minecraft RTX (Beta) run on my machine?  The fear that the snazzy lighting demands more than just a small fee is obvious.  After many hours of testing, we cannot give a general all-clear, but it is not as bad as one might expect.  Microsoft and Nvidia have extensively hand-optimized the path tracing lighting and devised standard settings that can be used smoothly.  However, if you want to experience the full glory of Minecraft RTX, you need a really powerful PC.<\/p>\n<p>The PCGH editorial team is currently in the home office, so the available test hardware is limited.  Our benchmarks are therefore a bit different than usual, since the writers&#8217; private computers are used.  Nothing has changed in the premise of always being up-to-date and sophisticated.  Not only the current Minecraft RTX beta is used, but also the Geforce driver 445.87 WHQL just released by Nvidia.  Before we get to the performance measurements, however, some explanation is needed.<\/p>\n<p><\/p>\n<p>Minecraft RTX: The test system used for the ray tracing benchmarks Source: PC Games Hardware <\/p>\n<h3 class=\"anchorHeadline hasIcon\">Ray Tracing Render Distance      <\/h3>\n<p>The more objects, the greater the performance cost &#8211; this rule is ancient, understandable, and also applicable to Minecraft RTX.  Games therefore use various tricks to reduce the detail display with increasing distance or display depth in space, so-called LoD systems (level of detail).  A popular approach in sprawling open-world games is to divide the world into tiles.  For example, if a map consists of 9×9 (81 tiles) and the player is in the middle, initially only 3×3 (9) are loaded and displayed all around.  Movement within the room causes corresponding tiles to be loaded.  It would also be possible to display them all at the same time, but this requires a gigantic amount of computing time and storage space in comparison.<\/p>\n<p>Minecraft divides the game worlds into so-called &#8220;chunks&#8221;, i.e. pieces.  Assuming a powerful PC, the player can drastically increase the default setting to see more at once.  Minecraft RTX takes up this principle and introduces a new graphics option that is basically the same: Raytracing Render Distance.  Again, everything revolves around chunks, within which rays are fired and the lighting is applied.  The default is 8 chunks.  The view range is vaguely reminiscent of the 3D shooter classic Turok, which was known for its wafts of fog that rose only a few meters in front of the player to save performance.  In Minecraft RTX you have the option to go all the way up to 24 chunks.  This makes significantly more graphics visible, but also jerking.<\/p>\n<p><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655020813_790_Minecraft-RTX-Graphics-Card-Benchmarks.jpg\" alt=\"Ray Tracing Render Distance has a huge impact on quality and performance.\"\/><\/p>\n<p>Ray Tracing Render Distance has a huge impact on quality and performance.  Source: PC Games Hardware The maximum raytracing render distance is well below the maximum that Minecraft offers without raytracing (160 chunks) and even with the standard With settings of 128 chunks, Minecraft draws a far greater distance with the RTX deactivated than even the maximum RTX settings of 24. However, this also causes performance to drop drastically in scenes with high visibility: In comparison, the Ryzen 9 3900X used manages with it deactivated Raytracing and with the 128 chunks set by default in the options menu not even 20 fps, while the voxel graphics, due to the admittedly very impressive range of vision, with almost 16 GiByte occupancy in the 32 GiByte main memory makes wide.<\/p>\n<p>comparison of visibility<\/p>\n<p> <img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655020814_26_Minecraft-RTX-Graphics-Card-Benchmarks.jpg\" alt=\"Minecraft RTX - View range without RTX (default setting: 128 chunks)\" width=\"1280\" height=\"720\"\/><\/p>\n<p>Due to the high visibility with ray tracing disabled and the resulting drastic CPU limitation, Minecraft with RTX in this example actually runs much more smoothly than without &#8211; although the comparison is of course not entirely fair, since the CPU with ray tracing enabled due to the low visibility of 24 Chunks has a lot less work to do compared to 128.  On the other hand, the worlds of Minecraft naturally lose some of their perceived size with the view range being quite limited due to ray tracing.  However, maximum visibility cannot really be implemented without ray tracing, with the Ryzen 9 3900X we have to go down to at least 96 chunks in order to achieve reasonably stable performance, but with such a high visibility it only becomes really playable from 64 chunks &#8211; with these it works View into the distance much less impressive.<\/p>\n<p>Visibility and performance in comparison<\/p>\n<p> <img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655020815_680_Minecraft-RTX-Graphics-Card-Benchmarks.jpg\" alt=\"Minecraft RTX - View\/Performance - RTX on DLSS on, 24 Chunks\" width=\"1280\" height=\"720\"\/><\/p>\n<p>  High time for a few example benchmarks.  We chose two scenes from two different RTX theme worlds.  There is the very hardware-demanding map &#8220;Of Temples And Totems&#8221; and the fundamentally different, slightly less demanding map &#8220;Aquatic Adventure&#8221;.  In both cases, we walk a previously defined path for 20 seconds, which is typical for PCGH, and average three measured values ​​via OCAT.  A manually accelerated Geforce RTX 2080 Ti is used, with which we represent the best case of RTX performance.  As always, we offer you benchmarks in the three popular resolutions Full HD, WQHD, UWQHD and Ultra HD.  DLSS upscaling is consistently enabled on the highlighted benchmarks.  The results:<\/p>\n<h2>Minecraft RTX: RT + DLSS<\/h2>\n<p title=\"Description\">Please select your desired resolution from the drop-down menu.<\/p>\n<table class=\"infoBoxContainer\">\n<tbody>\n<tr>\n<td class=\"infoIconContainer\">\n<img class=\"infoIcon\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/Minecraft-RTX-Graphics-Card-Benchmarks.png\" alt=\"info icon\" height=\"100%\" width=\"100%\"\/><\/td>\n<td>\n<table>\n<tbody>\n<tr>\n<td class=\"title\">game\/version<\/td>\n<td class=\"beschreibung\">Minecraft RTX (1.15.7.0; Beta), PCGH benchmarks Aquatic &#038; Temples<\/td>\n<\/tr>\n<tr>\n<td class=\"title\">details<\/td>\n<td class=\"beschreibung\">Direct X 12 API (UWP), DLSS ON, scaled Raytracing Render Distance<\/td>\n<\/tr>\n<tr>\n<td class=\"title\">Software\/Drivers<\/td>\n<td class=\"beschreibung\">Geforce 445.87 WHQL, patched Windows 10 x64<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>MSI RTX 2080 Ti Gaming X Trio\/11G Aquatic &#8212; 8 RT chunks (def.)\n<\/p>\n<p>MSI RTX 2080 Ti Gaming X Trio\/11G Temples &#8212; 8 RT chunks (def.)\n<\/p>\n<p>MSI RTX 2080 Ti Gaming X Trio\/11G Temples &#8212; 16 RT chunks (med.)\n<\/p>\n<p>MSI RTX 2080 Ti Gaming X Trio\/11G Aquatic &#8212; 16 RT chunks (med.)\n<\/p>\n<p>MSI RTX 2080 Ti Gaming X Trio\/11G Temples &#8212; 24 RT chunks (max.)\n<\/p>\n<p>MSI RTX 2080 Ti Gaming X Trio\/11G Aquatic &#8212; 24 RT chunks (max.)\n<\/p>\n<p>0<\/p>\n<p>10<\/p>\n<p>20<\/p>\n<p>30<\/p>\n<p>40<\/p>\n<p>50<\/p>\n<p>60<\/p>\n<p>70<\/p>\n<p>80<\/p>\n<p>90<\/p>\n<p>100<\/p>\n<p>110<\/p>\n<p>120<\/p>\n<p>Surname\n<\/p>\n<p>1920 × 1080 (Average fps)\n<\/p>\n<p>1,920 × 1,080 (P99 percentile)\n<\/p>\n<p>2560 × 1440 (average fps)\n<\/p>\n<p>2,560 × 1,440 (P99 percentile)\n<\/p>\n<p>3440 × 1440 (average fps)\n<\/p>\n<p>3,440 × 1,440 (P99 percentile)\n<\/p>\n<p>3840 × 2160 (average fps)\n<\/p>\n<p>3,840 × 2,160 (P99 percentile)\n<\/p>\n<p>Please note that for reasons of clarity we have only shown &#8220;Temples&#8221; by default.  You can select &#8220;Aquatic&#8221; manually.  We deliberately put the more demanding RTX map in the foreground because it shows what happens when a Minecraft artist really lets off steam with a lot of objects and materials: it stutters.  The raytracing render distance is the most important parameter, which is why we always test the standard setting (8 chunks), the middle switch position (16 chunks) and the maximum (24 chunks).<\/p>\n<h3 class=\"anchorHeadline hasIcon\">Importance of graphics memory: Moderate to exorbitant      <\/h3>\n<p>Ray tracing requires numerous calculations that are not involved in classic rasterization.  Of course, these calculations have to be saved all the time &#8211; and, as with Wolfenstein Youngblood and Battlefield 5, that can be a problem<br \/>\n[&#8230;] that even the 11 GiByte of a Geforce RTX 2080 Ti are not enough.  will.  Our benchmarks also show this (as well as the embedded video): Depending on the card complexity, it may be that even the 11 GiByte of a Geforce RTX 2080 Ti is not enough, so that data has to be swapped out to the main memory.  This is exactly what happens with &#8220;Temples&#8221; as soon as the displayed chunks move towards the maximum.  With 24 world pieces, the memory of our test card is consistently full;  first there is reloading jerking and then, with further outsourcing at runtime, permanently low performance.  As the resolution increases, the symptoms worsen as the frame buffers get larger.<\/p>\n<p>Chunks and the effect on (graphics) memory)<\/p>\n<p> <img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655020816_869_Minecraft-RTX-Graphics-Card-Benchmarks.jpg\" alt=\"Minecraft RTX - graphics memory\/performance - 8 chunks\" width=\"1280\" height=\"720\"\/><\/p>\n<p>The ray tracing render distance should therefore not be underestimated, although the other RTX worlds do not indulge in such memory gluttony.  But here, too, 8 GiBytes can be tight, purely in relation to the addressed memory.  We even consider the 6 GiByte of a Geforce RTX 2060 (non-Super) to be completely undersized to have fun in Minecraft RTX.  The many PCGH readers who use above-average RTX cards (RTX 2070 to 2080 Ti) are well advised to use the middle switch position for 16 chunks.<\/p>\n<p>  Anyone who dares to compare the benchmark values ​​will also find out that DLSS costs memory, even though fewer pixels are used.  The best way to filter that out is to compare the data at 24 RT cunks between Ultra HD + DLSS versus native WQHD.  If DLSS is active, a Geforce RTX 2080 Ti in UHD will no longer get off the ground, the performance is completely in the basement due to the large data swapping.  The same amount of pixels in native WQHD (without AI reconstruction) does not run smoothly, but it is much better.  With fewer RT chunks it is the other way around, here DLSS helps to achieve a significant increase in performance.<\/p>\n<p>Also popular with PCGH readers:\n<\/p>\n<p><img alt=\"&nbsp;<strong>Minecraft 1.19: The Wild is here &#8211; trouble in block paradise?<\/strong>&#8221; src=&#8221;https:\/\/www.pcgameshardware.de\/screenshots\/237&#215;133\/2022\/05\/Minecraft-Update-119-The-Wild-pcgh_b2teaser_169.jpg&#8221;\/><\/p>\n<h3 class=\"headlineBox\">\n<p>Minecraft 1.19: The Wild Update is here &#8211; trouble in block paradise?<br \/>\n<\/h3>\n<p>Minecraft update 1.19 &#8211; The Wild &#8211; has been available for two days.<\/p>\n<p><img alt=\"A gaming journalist recently reported that a new Minecraft game is in development.  We're talking about a real-time strategy game.\" src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655020816_412_Minecraft-RTX-Graphics-Card-Benchmarks.jpg\"\/><\/p>\n<h3 class=\"headlineBox\">\n<p>Rumor: Is there a third-person Minecraft RTS coming soon?<br \/>\n<\/h3>\n<p>A gaming journalist recently reported that a new Minecraft game is in development.  We&#8217;re talking about a real-time strategy game.<\/p>\n<p><b>advertisement:<\/b> Order Minecraft now from Amazon<\/p>\n<p><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655020817_151_Minecraft-RTX-Graphics-Card-Benchmarks.png\" alt=\"[PLUS]  Comparative test: 15 graphics cards with 8 GiB between 350 and 450 euros\"\/><\/p>\n<p>[PLUS]  Comparative test: 15 graphics cards with 8 GiB between 350 and 450 euros PCGH Plus: 15 graphics cards with future-oriented 8 GiByte in a comparative test.  If the Geforce RTX 2070 Super is too expensive for you, you don&#8217;t have to do without good things.  PCGH honors the gaming kings up to 450 euros.  The article comes from PC Games Hardware 05\/2020.<br \/>more &#8230; to the article next page next page Jump to the comments (87)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Minecraft RTX: Graphics Card Benchmarks How does Minecraft RTX (Beta) run on my machine? The fear that the snazzy lighting <\/p>\n","protected":false},"author":1,"featured_media":767,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/758"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=758"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/758\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/767"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=758"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=758"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=758"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}