{"id":951,"date":"2022-06-15T14:55:27","date_gmt":"2022-06-15T14:55:27","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-minecraft-page-1-user-articles\/"},"modified":"2022-06-15T14:55:27","modified_gmt":"2022-06-15T14:55:27","slug":"minecraft-minecraft-page-1-user-articles","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-minecraft-page-1-user-articles\/","title":{"rendered":"Minecraft &#8211; Minecraft &#8211; Page 1 &#8211; User Articles"},"content":{"rendered":"<p>            A lot of people have heard of the game Minecraft, but hardly any non-Minecraft players know what it&#8217;s really all about and why a simple 31-year-old Java programmer became a millionaire with it.        <\/p>\n<p>          This content would not be financially viable without the premium users.  But we urgently need more supporters: You can help too!<\/p>\n<blockquote>\n<p>Even if the sky were to turn blood red right now and demons were to enslave humanity, more than 100,000 people around the world would not notice it because they are currently playing Minecraft.<\/p>\n<\/blockquote>\n<p class=\"MsoNormal\">First of all, I would like to say about this article that I decided against writing a review for the game.  In my opinion it is impossible <strong>Minecraft <\/strong>to impose a rating, since everyone will have a completely different impression of the game than I did.  That&#8217;s why I&#8217;m only presenting the game here so that everyone can form their own picture of it.<\/p>\n<table class=\"artikel-bild-600\">\n<tr>\n<td><\/td>\n<\/tr>\n<tr class=\"artikel-bu\">\n<td class=\"artikel-bu\">With a little practice you can build such houses within a few hours.<\/td>\n<\/tr>\n<\/table>\n<p><\/p>\n<p>On May 10, 2009 <strong>Markus Persson<\/strong> aka Notch started programming Minecraft after resigning from flash games site King.com to pursue his own project.  In the meantime he has become a millionaire, even though his project is only in the alpha version so far.  He only took a few ideas from the games Dwarf Fortress, RollerCoaster Tycoon, Dungeon Keeper and especially Infiniminer and programmed Minecraft from them.<\/p>\n<p class=\"MsoNormal\"><u>All LEGO or what?<\/u><b><\/b><\/p>\n<p class=\"MsoNormal\">If I had to describe Minecraft in one sentence, it would be: &#8220;Minecraft is a game where you place sort of LEGO bricks while running screaming from an exploding zombie.&#8221;.  Strictly speaking, however, it is a sandbox game in which there is no superior goal, but you set your own goals.  So about the same as putting someone in front of a box of LEGO bricks.  But what if you locked someone in a huge warehouse full of LEGO, where they would kill you if you didn&#8217;t build?  That&#8217;s where Minecraft comes in.<br \/><b><br \/><\/b><u>Free vs Paid<\/u> <u> <\/u>\n<\/p>\n<table class=\"artikel-bild-300-links\">\n<tr>\n<td><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655304927_952_Minecraft-Minecraft-Page-1-User-Articles.jpg\" alt=\"\" \/><\/td>\n<\/tr>\n<tr>\n<td class=\"artikel-bu\">My first own house in Minecraft.  Initially, it was a mud hut intended only to protect monsters.<\/td>\n<\/tr>\n<\/table>\n<p><\/p>\n<p>There are currently 2 different versions of Minecraft.  First, the Classic version, which is free and started it all.  You have a randomly generated world and 9 different colored blocks that you can place.  In this game mode there are no monsters, no crafting, no gathering of resources, you can just build any buildings of your choice without restrictions, or even dig up to the center of the game world.  Classic mode will no longer be developed, but will remain as it is.<\/p>\n<p class=\"MsoNormal\">The second variant is currently called Minecraft Alpha and is based on older versions, such as the Indev version (in development).  In the alpha version of the game it still costs 10€, from the beta then 20€.  This variant includes the survival mode, which is about surviving while building your world the way you want it.<\/p>\n<p class=\"MsoNormal\"><u>Brick by brick, brick by brick, the little house will be ready soon<\/u><b><\/b><\/p>\n<p class=\"MsoNormal\">Most of the time, when you first start Minecraft, you&#8217;ll think something like, &#8220;Oh my, those graphics are giving me eye cancer.&#8221;  Many players are already turning off the game at this point, because most of them think &#8220;The game can be so good, I don&#8217;t want to do such graphics.&#8221;.  However, those who keep playing it start banging on blocks to find that they can pick up those blocks and place them somewhere else.  you do that for a few minutes until night falls and you see the first monsters.  Now you face the first problem in Minecraft: What do you do against these monsters?  In most cases, the first thing you do is open Youtube and search for something like &#8220;Minecraft Tutorial&#8221;.  Behold, there is a tutorial called &#8220;Minecraft Alpha Tutorial &#8211; How to Survive your First Night&#8221;.  So you start mining wood so you can build a pickaxe that you can use to chop rocks to make a sword out of them.  Of course that&#8217;s not enough, because you also need a place to stay for the night until it gets light again.  By this time at the latest, Minecraft has already caught one.\n<\/p>\n<table class=\"artikel-bild-300-rechts\">\n<tr>\n<td><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655304927_70_Minecraft-Minecraft-Page-1-User-Articles.jpg\" alt=\"\" \/><\/td>\n<\/tr>\n<tr>\n<td class=\"artikel-bu\">This created lava column will eventually become a huge volcano.<\/td>\n<\/tr>\n<\/table>\n<p class=\"MsoNormal\"> The world of Minecraft is infinite.  If you stubbornly run in one direction, you&#8217;ll never find an end, as the world expands dynamically as you get closer to the edge of the world.  In addition, each generated world is completely different, as it is also created completely randomly when it is first created.  So you have more than enough space to let off steam in your sandbox world.  Some enjoy building and exploring underground caves, while others prefer to build a home sweet home, a small village, or even an entire city.  There are no limits to the imagination in Minecraft.<\/p>\n<p class=\"MsoNormal\"><u>Twice as good in multiplayer<\/u><b><\/b><\/p>\n<p class=\"MsoNormal\">However, the game not only offers a single player but also a multiplayer mode.  This basically works the same as the single player, but it still has a few bugs.  For example, no monsters spawn, you don&#8217;t lose any life energy and sometimes objects can disappear.  However, building a project together, such as a small town, is much more fun than just going it alone.<\/p>\n<p class=\"MsoNormal\"><u>DRM, Bugs and Paypal<\/u><b><\/b><\/p>\n<p class=\"MsoNormal\">Meanwhile, while I was looking for ideas for this article, Minecraft found well over 100,000 buyers and counting every day.  The programmer Notch has already had talks with Valve, who want to take him and his project under their wing.  In the meantime, Paypal has also noticed that an unusually large amount of money is flowing into the programmer&#8217;s private account and has blocked the account to check whether everything is going right (we reported). Unfortunately, there are also negative things to report about Minecraft.  First off is the fact that Notch initially used DRM as copy protection and required an internet connection to log in to play.  However, the outcry from the fans in the forum was so great that it was only then that he decided to implement an offline mode for which you don&#8217;t have to be online.  Basically, it used copy protection similar to that of Steam, with the difference being that it listened to the fans.  Then you have the feeling that the whole Notch thing is now getting a little overwhelming.  But he saw it, rented an office, hired a few programmers and is now working with them on Minecraft.<\/p>\n<table class=\"artikel-bild-600\">\n<tr>\n<td><img src=\"https:\/\/minecraft101.site\/wp-content\/uploads\/2022\/06\/1655304927_276_Minecraft-Minecraft-Page-1-User-Articles.jpg\" alt=\"\" \/><\/td>\n<\/tr>\n<tr class=\"artikel-bu\">\n<td class=\"artikel-bu\">If you can choose where to build, why not a beach with an ocean view?<\/td>\n<\/tr>\n<\/table>\n<p><\/p>\n<p>There are also more than enough bugs in Minecraft, such as the problem that the game crashes as soon as I activate the sound.  However, Notch is continuously working on the game and releases the so-called &#8220;Secret Friday Update&#8221; every Friday.  In this, bugs are fixed and new features are added, such as new items or stars in the sky. <\/p>\n<p>Minecraft was programmed entirely in Java and Notch has already announced that it will eventually release the source code once it stops making money from the game.  But as long as he does, regular patches will come. If you&#8217;re not sure whether the game is something for you, then I can recommend you simply ask a friend or acquaintance who has already bought the game.  Namely, account sharing is condoned as it is the best way of promoting this game. <\/p>\n<p class=\"MsoNormal\">Finally, a small review from me personally:<\/p>\n<p class=\"MsoNormal\">The $10 on Minecraft was the best $10 I&#8217;ve ever invested in a game. <\/p>\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A lot of people have heard of the game Minecraft, but hardly any non-Minecraft players know what it&#8217;s really all <\/p>\n","protected":false},"author":1,"featured_media":956,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/951"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=951"}],"version-history":[{"count":0,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/951\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/956"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}