{"id":961,"date":"2022-06-15T16:58:50","date_gmt":"2022-06-15T16:58:50","guid":{"rendered":"https:\/\/minecraft101.site\/minecraft-nintendo-switch-games\/"},"modified":"2022-06-22T15:49:59","modified_gmt":"2022-06-22T15:49:59","slug":"minecraft-nintendo-switch-games","status":"publish","type":"post","link":"https:\/\/minecraft101.site\/minecraft-nintendo-switch-games\/","title":{"rendered":"Minecraft |  Nintendo Switch |  games"},"content":{"rendered":"<p class=\"news-list-title\">what you need to know<\/p>\n<p>This content is sold by Nintendo of Europe GmbH. Payment is made with Nintendo eShop credit usable through the Nintendo Account.<\/p>\n<p>This content is sold by Nintendo of Europe GmbH. Payment is made with Nintendo eShop credit usable through the Nintendo Account. The purchase of this content applies to <strong>Nintendo Account Agreement<\/strong>.<\/p>\n<p>This content can be purchased by users who have registered a Nintendo Account and accepted the applicable legal terms. In order to purchase content for Wii U or Nintendo 3DS family systems, a Nintendo Network ID is also required and the funds usable via the Nintendo Account must have been merged with the funds on your Nintendo Network ID. If the credit has not yet been combined, you will be given the option to do so during the purchase. At the beginning of the purchase process, you need to sign in with your Nintendo Account and Nintendo Network ID. After logging in, you can review the information and make the purchase.<\/p>\n<p>In order to purchase content for Wii U or Nintendo 3DS family systems, a Nintendo Network ID is also required and the funds usable via the Nintendo Account must have been merged with the funds on your Nintendo Network ID. If the credit has not yet been combined, you will be given the option to do so during the purchase. On the next screen you can review the details and complete the purchase.<\/p>\n<p>The details of this offer apply to users who sign in with a Nintendo Account whose locale matches the locale of this website. If the country setting of a Nintendo Account differs, the details of this offer may be adjusted accordingly (e.g. the price is displayed in the respective local currency).<\/p>\n<p>After the payment has been processed, the content will be downloaded to the console associated with your Nintendo Account (or, in the case of Wii U and Nintendo 3DS family systems, your Nintendo Network ID). The system must be updated to the latest system update and connected to the internet. In addition, automatic downloads must be activated and sufficient storage space must be available for the download. Depending on the system\/console\/hardware model you own and your personal use of the same, an additional storage medium may be required to download software from Nintendo eShop. In our <strong>Customer Service Section<\/strong> you can find more information.<\/p>\n<p>For games that use cloud streaming technology, only the free starter app can be downloaded.<\/p>\n<p><strong>There must be enough disk space to complete the download.<\/strong><\/p>\n<p>After the payment has been processed, the content will be downloaded to the console associated with your Nintendo Account (or, in the case of Wii U and Nintendo 3DS family systems, your Nintendo Network ID). The system must be updated to the latest system update and connected to the internet. In addition, automatic downloads must be activated and sufficient storage space must be available for the download. Depending on the system\/console\/hardware model you own and your personal use of the same, an additional storage medium may be required to download software from Nintendo eShop. In our <strong>Customer Service Section<\/strong> you can find more information.<\/p>\n<p>For games that use cloud streaming technology, only the free starter app can be downloaded.<\/p>\n<p><strong>There must be enough disk space to complete the download.<\/strong><\/p>\n<p>The details of the offer depend on the country settings of your Nintendo Account.<\/p>\n<p>The purchase of this content applies to <strong>Nintendo Account Agreement<\/strong>.<\/p>\n<p>Pre-Order Information<\/p>\n<p>Use of an unauthorized device or software that allows technical modification of the Nintendo console or the software may render that software unusable.<\/p>\n<p>This product is copy protected by technological protection measures.<\/p>\n<p>The content cannot be played before the official release date: {{releaseDate}} . For pre-orders, the purchase price will be automatically debited within seven days before the release date. If you pre-order the software less than seven days before release, your credit will be charged immediately.<\/p>\n<p>To purchase download games or download demos and free software from Nintendo eShop on the official website, you need a Nintendo Account linked to your Nintendo Switch console. In addition, your console must be registered as an active console for downloads to your Nintendo Account. To do this, you must have visited the Nintendo eShop at least once on the console you wish to download to. In order to automatically download a track, the system must have the latest system software and be connected to the internet. In addition, automatic software downloads must be activated and sufficient storage space must be available for the download. You can find out more about this in our <strong>Customer Service Section<\/strong>. Purchases and demo downloads made through the Nintendo website are processed through the Nintendo eShop.<\/p>\n<p>An internet connection is required while playing online. In order to use Online Services, you must create a Nintendo Account and accept the Nintendo Account Agreement. The Nintendo Account Privacy Policy applies. Some online services may not be available in all countries. Online play requires membership to a paid service. Learn more about paid online services.<\/p>\n<p>Broadband internet access is required. In order to use Online Services, you must create a Nintendo Account and accept the Nintendo Account Agreement. The Nintendo Account Privacy Policy applies. Some online services may not be available in all countries.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>what you need to know This content is sold by Nintendo of Europe GmbH. Payment is made with Nintendo eShop <\/p>\n","protected":false},"author":1,"featured_media":962,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/961"}],"collection":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/comments?post=961"}],"version-history":[{"count":1,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/961\/revisions"}],"predecessor-version":[{"id":1558,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/posts\/961\/revisions\/1558"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media\/962"}],"wp:attachment":[{"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/media?parent=961"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/categories?post=961"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/minecraft101.site\/wp-json\/wp\/v2\/tags?post=961"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}